#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 95299ec03ce3d12f6533360042385e68.pdb
; shader hash: 95299ec03ce3d12f6533360042385e68
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.VertexPositionNormalColorTexture
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float4 color;                                 ; Offset:   24
;       float2 uv;                                    ; Offset:   40
;   
;   } $Element;                                       ; Offset:    0 Size:    48
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !78)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 47, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 47, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !46, !49, !57, !60}
!17 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 16, type: !18, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !24)
!31 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 65, type: !32, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!4, !34, !37}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 3)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 47, size: 64, align: 32, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !37, file: !1, line: 47, baseType: !40, size: 64, align: 32)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 47, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!46 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 80, type: !47, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!47 = !DISubroutineType(types: !48)
!48 = !{null}
!49 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 132, type: !50, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !56}
!52 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 73, size: 128, align: 32, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !53, file: !1, line: 75, baseType: !4, size: 128, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 72, baseType: !37)
!57 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 158, type: !58, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !52}
!60 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 49, type: !61, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !69, !69}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !65, templateParams: !68)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !64, file: !1, line: 30, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !64, file: !1, line: 30, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !{!28, !45}
!69 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 108, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 108, size: 96, align: 32, elements: !73, templateParams: !77)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !72, file: !1, line: 108, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !72, file: !1, line: 108, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !72, file: !1, line: 108, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!77 = !{!13, !29}
!78 = !{!79, !81, !85, !87, !99}
!79 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !80, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 8, size: 32, align: 32, elements: !2)
!81 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !82, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !5)
!85 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !86, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 10, size: 32, align: 32, elements: !2)
!87 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !88, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !2, templateParams: !89)
!89 = !{!90}
!90 = !DITemplateTypeParameter(name: "element", type: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !92, line: 37, size: 384, align: 32, elements: !93)
!92 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !91, file: !92, line: 39, baseType: !71, size: 96, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !91, file: !92, line: 40, baseType: !71, size: 96, align: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !91, file: !92, line: 41, baseType: !4, size: 128, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !91, file: !92, line: 42, baseType: !98, size: 64, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !40)
!99 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 13, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !92, line: 23, size: 1024, align: 32, elements: !104)
!104 = !{!105, !128, !129, !130, !131}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !103, file: !92, line: 25, baseType: !106, size: 512, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 13, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 13, size: 512, align: 32, elements: !108, templateParams: !125)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !107, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!125 = !{!13, !126, !127}
!126 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!127 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !103, file: !92, line: 26, baseType: !4, size: 128, align: 32, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !103, file: !92, line: 27, baseType: !4, size: 128, align: 32, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !103, file: !92, line: 28, baseType: !4, size: 128, align: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !103, file: !92, line: 29, baseType: !4, size: 128, align: 32, offset: 896)
!132 = !{i32 2, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!135 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0A\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    //float2 lerpValues = (float2) DispatchRaysIndex() / (float2) DispatchRaysDimensions();\0D\0A\0D\0A    //// Orthographic projection since we're raytracing in screen space.\0D\0A    //float3 rayDir = float3(0, 0, 1);\0D\0A    //float3 origin = float3(\0D\0A    //    lerp(-1, 1, lerpValues.x),\0D\0A    //    lerp(-1, 1, lerpValues.y),\0D\0A    //    0.0f);\0D\0A\0D\0A    //// Trace the ray.\0D\0A    //// Set the ray's extents.\0D\0A    //RayDesc ray;\0D\0A    //ray.Origin = origin;\0D\0A    //ray.Direction = float3(0, 0, 1);\0D\0A\0D\0A    //// Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    //// TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    //ray.TMin = 0.001;\0D\0A    //ray.TMax = 10000.0;\0D\0A    //RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    //TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    //// Write the raytraced color to the output texture.\0D\0A    //gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A\0D\0A\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A    \0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    //TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float4 color = float4(0, 0, 0, 0);\0D\0A\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStride = indexSizeInBytes * 3;\0D\0A    uint iBaseIndex = PrimitiveIndex() * iTriangleIndexStride; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(iBaseIndex);\0D\0A\0D\0A    float4 triangleColors[3] =\0D\0A    {\0D\0A        Vertices[indices3[0]].color,\0D\0A        Vertices[indices3[1]].color,\0D\0A        Vertices[indices3[2]].color\0D\0A    };\0D\0A\0D\0A    \0D\0A\0D\0A\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColors, attr);\0D\0A    //payload.color = Vertices[0].color;\0D\0A    //payload.color = float4(0, 0, 0, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!136 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!137 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A//typedef Vertex VertexPositionNormalColorTexture;\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!138 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!139 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!140 = !{i32 1, i32 3}
!141 = !{i32 1, i32 6}
!142 = !{!"lib", i32 6, i32 3}
!143 = !{!144, !150, !153, null}
!144 = !{!145, !147, !148}
!145 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !146}
!146 = !{i32 0, i32 4}
!147 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!148 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !149}
!149 = !{i32 1, i32 48}
!150 = !{!151}
!151 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !152}
!152 = !{i32 0, i32 9}
!153 = !{!154}
!154 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!155 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !156, %"class.RWTexture2D<vector<float, 4> >" undef, !158, %struct.ByteAddressBuffer undef, !156, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !160, %struct.VertexPositionNormalColorTexture undef, !162, %struct.DXR_Scene_CB undef, !167, %struct.BuiltInTriangleIntersectionAttributes undef, !174, %struct.RayDesc undef, !176, %struct.RayPayload undef, !181, %g_sceneCB undef, !183}
!156 = !{i32 4, !157}
!157 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!158 = !{i32 16, !159}
!159 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!160 = !{i32 56, !161}
!161 = !{i32 6, !"h", i32 3, i32 0}
!162 = !{i32 56, !163, !164, !165, !166}
!163 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!165 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!166 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!167 = !{i32 128, !168, !170, !171, !172, !173}
!168 = !{i32 6, !"viewProjectionInv", i32 2, !169, i32 3, i32 0, i32 7, i32 9}
!169 = !{i32 4, i32 4, i32 2}
!170 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!171 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!172 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!173 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!174 = !{i32 8, !175}
!175 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!176 = !{i32 32, !177, !178, !179, !180}
!177 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!178 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!179 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!180 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!181 = !{i32 16, !182}
!182 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!183 = !{i32 128, !184}
!184 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!185 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !186, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !188, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !191}
!186 = !{!187}
!187 = !{i32 1, !2, !2}
!188 = !{!187, !189, !190}
!189 = !{i32 2, !2, !2}
!190 = !{i32 0, !2, !2}
!191 = !{!187, !189}
!192 = !{null, !"", null, !143, !193}
!193 = !{i32 0, i64 65553}
!194 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !195}
!195 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !196}
!196 = !{i32 0}
!197 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !198}
!198 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !196}
!199 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !200}
!200 = !{i32 8, i32 7, i32 5, !196}
!201 = !DILocation(line: 125, column: 5, scope: !46)
!202 = !DILocation(line: 128, column: 5, scope: !46)
!203 = !DILocation(line: 112, column: 23, scope: !46)
!204 = !DILocation(line: 112, column: 5, scope: !46)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !60, file: !1, line: 49, type: !63)
!206 = !DIExpression(DW_OP_bit_piece, 0, 32)
!207 = !DILocation(line: 49, column: 37, scope: !60, inlinedAt: !208)
!208 = distinct !DILocation(line: 112, column: 5, scope: !46)
!209 = !DIExpression(DW_OP_bit_piece, 32, 32)
!210 = !DILocation(line: 51, column: 17, scope: !60, inlinedAt: !208)
!211 = !DILocation(line: 51, column: 23, scope: !60, inlinedAt: !208)
!212 = !DILocation(line: 51, column: 12, scope: !60, inlinedAt: !208)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !60, file: !1, line: 51, type: !98)
!214 = !DILocation(line: 52, column: 29, scope: !60, inlinedAt: !208)
!215 = !DILocation(line: 52, column: 27, scope: !60, inlinedAt: !208)
!216 = !DILocation(line: 52, column: 57, scope: !60, inlinedAt: !208)
!217 = !DILocation(line: 52, column: 63, scope: !60, inlinedAt: !208)
!218 = !DILocation(line: 52, column: 12, scope: !60, inlinedAt: !208)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !60, file: !1, line: 52, type: !98)
!220 = !DILocation(line: 55, column: 19, scope: !60, inlinedAt: !208)
!221 = !DILocation(line: 55, column: 17, scope: !60, inlinedAt: !208)
!222 = !DILocation(line: 58, column: 59, scope: !60, inlinedAt: !208)
!223 = !DILocation(line: 58, column: 20, scope: !60, inlinedAt: !208)
!224 = !DILocation(line: 58, column: 12, scope: !60, inlinedAt: !208)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !60, file: !1, line: 58, type: !4)
!226 = !DIExpression(DW_OP_bit_piece, 64, 32)
!227 = !DIExpression(DW_OP_bit_piece, 96, 32)
!228 = !DILocation(line: 59, column: 15, scope: !60, inlinedAt: !208)
!229 = !DILocation(line: 60, column: 14, scope: !60, inlinedAt: !208)
!230 = !DILocation(line: 60, column: 12, scope: !60, inlinedAt: !208)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !60, file: !1, line: 49, type: !71)
!232 = !DILocation(line: 49, column: 55, scope: !60, inlinedAt: !208)
!233 = !DILocation(line: 61, column: 37, scope: !60, inlinedAt: !208)
!234 = !DILocation(line: 61, column: 17, scope: !60, inlinedAt: !208)
!235 = !DILocation(line: 61, column: 15, scope: !60, inlinedAt: !208)
!236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !60, file: !1, line: 49, type: !71)
!237 = !DILocation(line: 49, column: 74, scope: !60, inlinedAt: !208)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !46, file: !1, line: 108, type: !71)
!239 = !DILocation(line: 108, column: 12, scope: !46)
!240 = !DILocation(line: 62, column: 1, scope: !60, inlinedAt: !208)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !46, file: !1, line: 109, type: !71)
!242 = !DILocation(line: 109, column: 12, scope: !46)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !46, file: !1, line: 116, type: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 116, size: 256, align: 32, elements: !245)
!245 = !{!246, !247, !248, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !244, file: !1, line: 116, baseType: !72, size: 96, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !244, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !244, file: !1, line: 116, baseType: !72, size: 96, align: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !244, file: !1, line: 116, baseType: !8, size: 32, align: 32, offset: 224)
!250 = !DIExpression()
!251 = !DILocation(line: 116, column: 13, scope: !46)
!252 = !DILocation(line: 117, column: 9, scope: !46)
!253 = !DILocation(line: 117, column: 16, scope: !46)
!254 = !DILocation(line: 118, column: 9, scope: !46)
!255 = !DILocation(line: 118, column: 19, scope: !46)
!256 = !DILocation(line: 121, column: 9, scope: !46)
!257 = !DILocation(line: 121, column: 14, scope: !46)
!258 = !DILocation(line: 122, column: 9, scope: !46)
!259 = !DILocation(line: 122, column: 14, scope: !46)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !46, file: !1, line: 123, type: !53)
!261 = !DILocation(line: 123, column: 16, scope: !46)
!262 = !DILocation(line: 123, column: 26, scope: !46)
!263 = !DILocation(line: 128, column: 53, scope: !46)
!264 = !DILocation(line: 128, column: 19, scope: !46)
!265 = !DILocation(line: 128, column: 43, scope: !46)
!266 = !DILocation(line: 129, column: 1, scope: !46)
!267 = !DILocation(line: 144, column: 9, scope: !49)
!268 = !DILocation(line: 30, column: 36, scope: !17, inlinedAt: !269)
!269 = distinct !DILocation(line: 140, column: 28, scope: !49)
!270 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !49, file: !1, line: 132, type: !56)
!271 = !DILocation(line: 132, column: 67, scope: !49)
!272 = !DILocation(line: 134, column: 12, scope: !49)
!273 = !DILocation(line: 136, column: 10, scope: !49)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !49, file: !1, line: 136, type: !30)
!275 = !DILocation(line: 137, column: 50, scope: !49)
!276 = !DILocation(line: 137, column: 10, scope: !49)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStride", scope: !49, file: !1, line: 137, type: !30)
!278 = !DILocation(line: 138, column: 23, scope: !49)
!279 = !DILocation(line: 138, column: 40, scope: !49)
!280 = !DILocation(line: 138, column: 10, scope: !49)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseIndex", scope: !49, file: !1, line: 138, type: !30)
!282 = !DILocation(line: 140, column: 28, scope: !49)
!283 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !17, file: !1, line: 16, type: !30)
!284 = !DILocation(line: 16, column: 31, scope: !17, inlinedAt: !269)
!285 = !DILocation(line: 27, column: 49, scope: !17, inlinedAt: !269)
!286 = !DILocation(line: 27, column: 16, scope: !17, inlinedAt: !269)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !17, file: !1, line: 27, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !17, file: !1, line: 30, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!291 = !DILocation(line: 30, column: 17, scope: !17, inlinedAt: !269)
!292 = !DILocation(line: 33, column: 28, scope: !293, inlinedAt: !269)
!293 = distinct !DILexicalBlock(scope: !17, file: !1, line: 33, column: 9)
!294 = !DILocation(line: 33, column: 9, scope: !17, inlinedAt: !269)
!295 = !DILocation(line: 35, column: 40, scope: !296, inlinedAt: !269)
!296 = distinct !DILexicalBlock(scope: !293, file: !1, line: 34, column: 5)
!297 = !DILocation(line: 35, column: 19, scope: !296, inlinedAt: !269)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !17, file: !1, line: 18, type: !20)
!299 = !DILocation(line: 18, column: 11, scope: !17, inlinedAt: !269)
!300 = !DILocation(line: 36, column: 41, scope: !296, inlinedAt: !269)
!301 = !DILocation(line: 36, column: 48, scope: !296, inlinedAt: !269)
!302 = !DILocation(line: 36, column: 19, scope: !296, inlinedAt: !269)
!303 = !DILocation(line: 37, column: 40, scope: !296, inlinedAt: !269)
!304 = !DILocation(line: 37, column: 19, scope: !296, inlinedAt: !269)
