#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 2cd84c9da7a69f0180172c85db84fb0b.pdb
; shader hash: 2cd84c9da7a69f0180172c85db84fb0b
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer l_ObjectCB
; {
;
;   struct l_ObjectCB
;   {
;
;       struct struct.OBJECT_CB_STATIC_Arr
;       {
;
;           struct struct.OBJECT_CB_STATIC
;           {
;
;               uint startIndex_in_IB_SRV;            ; Offset:    0
;               uint startIndex_in_VB_SRV;            ; Offset:    4
;               float2 padding;                       ; Offset:    8
;               float4 albedo;                        ; Offset:   16
;           
;           } object_cb_static[2];;                   ; Offset:    0
;
;       
;       } l_ObjectCB;                                 ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !30, globals: !140)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 74, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingDefines.h", directory: "")
!5 = !DINamespace(name: "RayType", scope: null, file: !4, line: 73)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "Radiance", value: 0)
!8 = !DIEnumerator(name: "Count", value: 1)
!9 = !{!10, !22}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 40, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 40, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 83, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 83, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!19, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 3)
!30 = !{!31, !47, !91, !95, !98, !101, !111, !114, !117, !127, !130}
!31 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@UByteAddressBuffer@@I@Z", scope: !32, file: !32, line: 9, type: !33, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingFunctions.hlsli", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !44, !46}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !29}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, size: 32, align: 32, elements: !45)
!45 = !{}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !39)
!47 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !32, file: !32, line: 78, type: !48, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!10, !50, !79, !82}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !4, line: 32, size: 1024, align: 32, elements: !51)
!51 = !{!52, !75, !76, !77, !78}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !50, file: !4, line: 34, baseType: !53, size: 512, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 40, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 40, size: 512, align: 32, elements: !55, templateParams: !72)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !54, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!72 = !{!19, !73, !74}
!73 = !DITemplateValueParameter(name: "row_count", type: !21, value: i32 4)
!74 = !DITemplateValueParameter(name: "col_count", type: !21, value: i32 4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !50, file: !4, line: 35, baseType: !10, size: 128, align: 32, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !50, file: !4, line: 36, baseType: !10, size: 128, align: 32, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !50, file: !4, line: 37, baseType: !10, size: 128, align: 32, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !50, file: !4, line: 38, baseType: !10, size: 128, align: 32, offset: 896)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, align: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 3)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 40, size: 64, align: 32, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !82, file: !1, line: 40, baseType: !85, size: 64, align: 32)
!85 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !86, templateParams: !89)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !85, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !85, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!89 = !{!19, !90}
!90 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 2)
!91 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !32, file: !32, line: 84, type: !92, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!22, !94, !82}
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 288, align: 32, elements: !80)
!95 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@V?$vector@M$02@@1@Z", scope: !32, file: !32, line: 91, type: !96, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DISubroutineType(types: !97)
!97 = !{!10, !50, !22, !22}
!98 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !32, file: !32, line: 101, type: !99, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DISubroutineType(types: !100)
!100 = !{!22, !22, !22, !22}
!101 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URaytracingAccelerationStructure@@UMyRay@@I@Z", scope: !1, file: !1, line: 18, type: !102, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubroutineType(types: !103)
!103 = !{!10, !104, !105, !109}
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 105, size: 32, align: 32, elements: !45)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRay", file: !4, line: 61, size: 192, align: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !105, file: !4, line: 63, baseType: !22, size: 96, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !105, file: !4, line: 64, baseType: !22, size: 96, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !110, line: 19, baseType: !46)
!110 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!111 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 49, type: !112, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 90, type: !115, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DISubroutineType(types: !116)
!116 = !{!22}
!117 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 96, type: !118, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120, !126}
!120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRayPayload", file: !4, line: 66, size: 160, align: 32, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !121, file: !4, line: 68, baseType: !124, size: 128, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !110, line: 16, baseType: !10)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "recursionDepth", scope: !121, file: !4, line: 69, baseType: !109, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !32, line: 6, baseType: !82)
!127 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXUMyRayPayload@@@Z", scope: !1, file: !1, line: 149, type: !128, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z")
!128 = !DISubroutineType(types: !129)
!129 = !{null, !120}
!130 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AUMyRay@@V?$vector@H$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !32, file: !32, line: 58, type: !131, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!131 = !DISubroutineType(types: !132)
!132 = !{!105, !133, !22, !53}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 15, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 15, size: 64, align: 32, elements: !135, templateParams: !138)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !134, file: !1, line: 15, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !134, file: !1, line: 15, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!138 = !{!139, !90}
!139 = !DITemplateTypeParameter(name: "element", type: !21)
!140 = !{!141, !145, !146, !147, !151, !152, !154, !155, !159, !160, !171, !175}
!141 = !DIGlobalVariable(name: "GeometryStride", scope: !142, file: !4, line: 90, type: !144, isLocal: true, isDefinition: true, variable: i32 1)
!142 = !DINamespace(name: "HitGroup", scope: !143, file: !4, line: 84)
!143 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 81)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!145 = !DIGlobalVariable(name: "InstanceMask", scope: !143, file: !4, line: 83, type: !144, isLocal: true, isDefinition: true, variable: i32 -1)
!146 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !143, file: !4, line: 83, type: !144, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !142, file: !4, line: 85, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 32, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !142, file: !4, line: 90, type: !144, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !153, file: !4, line: 93, type: !148, isLocal: true, isDefinition: true)
!153 = !DINamespace(name: "MissShader", scope: !143, file: !4, line: 92)
!154 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !104, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!155 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !156, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !45, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "element", type: !11)
!159 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !44, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!160 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !161, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !45, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "element", type: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !4, line: 53, size: 384, align: 32, elements: !165)
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !164, file: !4, line: 55, baseType: !22, size: 96, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !164, file: !4, line: 56, baseType: !22, size: 96, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !164, file: !4, line: 57, baseType: !10, size: 128, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !164, file: !4, line: 58, baseType: !170, size: 64, align: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !85)
!171 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 12, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 12, size: 32, align: 32, elements: !45, templateParams: !173)
!173 = !{!174}
!174 = !DITemplateTypeParameter(name: "T", type: !50)
!175 = !DIGlobalVariable(name: "l_ObjectCB", linkageName: "\01?l_ObjectCB@@3U?$ConstantBuffer@UOBJECT_CB_STATIC_Arr@@@@A", scope: !0, file: !1, line: 15, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_STATIC_Arr>", file: !1, line: 15, size: 32, align: 32, elements: !45, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "T", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC_Arr", file: !4, line: 48, size: 512, align: 32, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_static", scope: !179, file: !4, line: 50, baseType: !182, size: 512, align: 32)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 512, align: 32, elements: !189)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC", file: !4, line: 41, size: 256, align: 32, elements: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_IB_SRV", scope: !183, file: !4, line: 43, baseType: !109, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_VB_SRV", scope: !183, file: !4, line: 44, baseType: !109, size: 32, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !183, file: !4, line: 45, baseType: !170, size: 64, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !183, file: !4, line: 46, baseType: !124, size: 128, align: 32, offset: 128)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!194 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingFunctions.hlsli\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// Local RootSig\0D\0AConstantBuffer<OBJECT_CB_STATIC_Arr> l_ObjectCB : register(b1, space1);\0D\0A\0D\0A// Trace a radiance ray into the scene and returns a shaded color.\0D\0Afloat4 TraceRadianceRay(RaytracingAccelerationStructure scene, in MyRay ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return float4(0, 0, 0, 0);\0D\0A    }\0D\0A//----------------------\0D\0A\09// Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\09// Set TMin to a zero value to avoid aliasing artifacts along contact areas.\0D\0A\09// Note: make sure to enable face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0.001;\0D\0A    rayDesc.TMax = 10000;\0D\0A    MyRayPayload rayPayload = { float4(0, 0, 0, 0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A    TraceRay(scene,\0D\0A    //RAY_FLAG_CULL_BACK_FACING_TRIANGLES,\0D\0A    0,\0D\0A    TraceRayParameters::InstanceMask,\0D\0A    TraceRayParameters::HitGroup::Offset[RayType::Radiance],\0D\0A    TraceRayParameters::HitGroup::GeometryStride,\0D\0A    TraceRayParameters::MissShader::Offset[RayType::Radiance],\0D\0A    rayDesc,\0D\0A    rayPayload);\0D\0A\0D\0A    return rayPayload.color;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    //    float3 rayDir;\0D\0A    //    float3 origin;\0D\0A    \0D\0A    //// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    //    GenerateCameraRay(g_sceneCB, DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    //// Trace the ray.\0D\0A    //// Set the ray's extents.\0D\0A    //    RayDesc rayDesc;\0D\0A    //    rayDesc.Origin = origin;\0D\0A    //    rayDesc.Direction = rayDir;\0D\0A    //// Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    //// TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    //    rayDesc.TMin = 0.001;\0D\0A    //    rayDesc.TMax = 10000.0;\0D\0A    //    MyRayPayload payload = { float4(0, 0, 0, 0), 2 };\0D\0A    ////TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    //    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, rayDesc, payload);\0D\0A\0D\0A    ////// Cast a ray into the scene and retrieve a shaded color.\0D\0A    ////UINT currentRecursionDepth = 0;\0D\0A    ////float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    //// Write the raytraced color to the output texture.\0D\0A    //    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A\0D\0A\0D\0A    //------------------------\0D\0A\09// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    MyRay ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewProjectionInv);\0D\0A \0D\0A    // Cast a ray into the scene and retrieve a shaded color.\0D\0A    UINT currentRecursionDepth = 0;\0D\0A    float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout MyRayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStrideInBytes = indexSizeInBytes * 3;\0D\0A    uint iBaseOffsetInBytes = (l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_IB_SRV / 3 + PrimitiveIndex())\0D\0A     * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A    \0D\0A    uint startIndex_in_VB_SRV = l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_VB_SRV; //0 or 24\0D\0A    const uint3 indices3 = Load3x16BitIndices(Indices, iBaseOffsetInBytes);\0D\0A    \0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[1]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[2]].color\0D\0A    };\0D\0A\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[1]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[2]].normal\0D\0A    };\0D\0A\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A\0D\0A    float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A    if (true)\0D\0A    {\0D\0A\09   // Trace a reflection ray.\0D\0A        MyRay reflectionRay = { HitWorldPosition(), reflect(WorldRayDirection(), triangleNormal) };\0D\0A        float4 reflectionColor = TraceRadianceRay(Scene_TLAS, reflectionRay, payload.recursionDepth);\0D\0A\0D\0A        float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), triangleNormal, float3(0.9f, 0.9f, 0.9f) /*albedo*/);\0D\0A        reflectedColor = 0.25f /*reflectanceCoef*/ * float4(fresnelR, 1) * reflectionColor;\0D\0A    }\0D\0A\0D\0A\0D\0A    float4 diffuseColor = CalculateDiffuseLighting(g_sceneCB, hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    //payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A    payload.color = l_ObjectCB.object_cb_static[InstanceIndex()].albedo; // for debug albedo\0D\0A    payload.color = Apply_Barycentric_Float4(g_sceneCB, triangleColorArr, attr);\0D\0A\0D\0A   \0D\0A\0D\0A    payload.color += reflectedColor;\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout MyRayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!195 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!196 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingDefines.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_DEFINES\0D\0A#define RAYTRACING_DEFINES\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 2\0D\0A//#define MAX_RAY_RECURSION_DEPTH 3    // ~ primary rays + reflections + shadow rays from reflected geometry.\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_STATIC\0D\0A{\0D\0A    UINT startIndex_in_IB_SRV; // Index Buffer ShaderResourceView\EC\9D\98 \EC\8B\9C\EC\9E\91 \EC\9D\B8\EB\8D\B1\EC\8A\A4\0D\0A    UINT startIndex_in_VB_SRV;\0D\0A    float2 padding;\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0Astruct OBJECT_CB_STATIC_Arr\0D\0A{\0D\0A    OBJECT_CB_STATIC object_cb_static[2]; // TODO \EA\B0\9C\EC\88\98 TEMP\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A\0D\0Astruct MyRay\0D\0A{\0D\0A    float3 origin;\0D\0A    float3 direction;\0D\0A};\0D\0Astruct MyRayPayload\0D\0A{\0D\0A    XMFLOAT4 color;\0D\0A    UINT   recursionDepth;\0D\0A};\0D\0A\0D\0A// Ray types traced\0D\0Anamespace RayType {\0D\0A    enum Enum {\0D\0A        Radiance = 0,   // ~ Primary, reflected camera/view rays calculating color for each hit.\0D\0A        //Shadow,         // ~ Shadow/visibility rays, only testing for occlusion\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A        static const UINT GeometryStride = RayType::Count;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A#endif // RAYTRACING_DEFINES"}
!197 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingFunctions.hlsli", !"#ifndef RAYTRACING_FUNCTIONS\0D\0A#define RAYTRACING_FUNCTIONS\0D\0A\0D\0A\0D\0A#include \22RaytracingDefines.h\22\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(ByteAddressBuffer Indices,uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(DXR_Scene_CB sceneCB, uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray\0D\0A    float4 world = mul(float4(screenPos, 0, 1), sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline MyRay GenerateCameraRay(int2 index, in float3 cameraPosition, in float4x4 viewProjectionInv)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A\0D\0A    MyRay ray;\0D\0A    ray.origin = cameraPosition;\0D\0A    ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(DXR_Scene_CB sceneCB, float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(DXR_Scene_CB sceneCB, float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return sceneCB.lightDiffuseColor * fNDotL; // TODO : LocalRootSig\EC\9D\98 \EC\98\A4\EB\B8\8C\EC\A0\9D\ED\8A\B8 \EC\95\8C\EB\B2\A0\EB\8F\84 \EC\A0\81\EC\9A\A9\0D\0A}\0D\0A\0D\0A// Fresnel reflectance - schlick approximation.\0D\0Afloat3 FresnelReflectanceSchlick(in float3 I, in float3 N, in float3 f0)\0D\0A{\0D\0A    float cosi = saturate(dot(-I, N));\0D\0A    return f0 + (1 - f0) * pow(1 - cosi, 5);\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!198 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!199 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!200 = !{i32 1, i32 3}
!201 = !{i32 1, i32 6}
!202 = !{!"lib", i32 6, i32 3}
!203 = !{!204, !210, !213, null}
!204 = !{!205, !207, !208}
!205 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !206}
!206 = !{i32 0, i32 4}
!207 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!208 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !209}
!209 = !{i32 1, i32 48}
!210 = !{!211}
!211 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !212}
!212 = !{i32 0, i32 9}
!213 = !{!214, !215}
!214 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!215 = !{i32 1, %l_ObjectCB* @l_ObjectCB, !"l_ObjectCB", i32 1, i32 1, i32 1, i32 64, null}
!216 = !{i32 0, %struct.ByteAddressBuffer undef, !217, %struct.DXR_Scene_CB undef, !219, %struct.BuiltInTriangleIntersectionAttributes undef, !226, %struct.RaytracingAccelerationStructure undef, !217, %"class.RWTexture2D<vector<float, 4> >" undef, !228, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !230, %struct.VertexPositionNormalColorTexture undef, !232, %struct.OBJECT_CB_STATIC_Arr undef, !237, %struct.OBJECT_CB_STATIC undef, !239, %struct.MyRay undef, !244, %struct.RayDesc undef, !247, %struct.MyRayPayload undef, !252, %g_sceneCB undef, !255, %l_ObjectCB undef, !257}
!217 = !{i32 4, !218}
!218 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!219 = !{i32 128, !220, !222, !223, !224, !225}
!220 = !{i32 6, !"viewProjectionInv", i32 2, !221, i32 3, i32 0, i32 7, i32 9}
!221 = !{i32 4, i32 4, i32 2}
!222 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!223 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!224 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!225 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!226 = !{i32 8, !227}
!227 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!228 = !{i32 16, !229}
!229 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!230 = !{i32 56, !231}
!231 = !{i32 6, !"h", i32 3, i32 0}
!232 = !{i32 56, !233, !234, !235, !236}
!233 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!234 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!235 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!236 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!237 = !{i32 64, !238}
!238 = !{i32 6, !"object_cb_static", i32 3, i32 0}
!239 = !{i32 32, !240, !241, !242, !243}
!240 = !{i32 6, !"startIndex_in_IB_SRV", i32 3, i32 0, i32 7, i32 5}
!241 = !{i32 6, !"startIndex_in_VB_SRV", i32 3, i32 4, i32 7, i32 5}
!242 = !{i32 6, !"padding", i32 3, i32 8, i32 7, i32 9}
!243 = !{i32 6, !"albedo", i32 3, i32 16, i32 7, i32 9}
!244 = !{i32 28, !245, !246}
!245 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!246 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!247 = !{i32 32, !248, !249, !250, !251}
!248 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!249 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!250 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!251 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!252 = !{i32 20, !253, !254}
!253 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!254 = !{i32 6, !"recursionDepth", i32 3, i32 16, i32 7, i32 5}
!255 = !{i32 128, !256}
!256 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!257 = !{i32 64, !258}
!258 = !{i32 6, !"l_ObjectCB", i32 3, i32 0}
!259 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !260, void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !262, void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !265}
!260 = !{!261}
!261 = !{i32 1, !45, !45}
!262 = !{!261, !263, !264}
!263 = !{i32 2, !45, !45}
!264 = !{i32 0, !45, !45}
!265 = !{!261, !263}
!266 = !{null, !"", null, !203, !267}
!267 = !{i32 0, i64 65553}
!268 = !{void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !269}
!269 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !270}
!270 = !{i32 0}
!271 = !{void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !"\01?MyMissShader@@YAXUMyRayPayload@@@Z", null, null, !272}
!272 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !270}
!273 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !274}
!274 = !{i32 8, i32 7, i32 5, !270}
!275 = !DILocation(line: 35, column: 5, scope: !101, inlinedAt: !276)
!276 = distinct !DILocation(line: 84, column: 20, scope: !111)
!277 = !DILocation(line: 87, column: 5, scope: !111)
!278 = !DILocation(line: 80, column: 99, scope: !111)
!279 = !DILocation(line: 80, column: 59, scope: !111)
!280 = !DILocation(line: 80, column: 35, scope: !111)
!281 = !DILocation(line: 80, column: 17, scope: !111)
!282 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewProjectionInv", arg: 3, scope: !130, file: !32, line: 58, type: !53)
!283 = !DIExpression(DW_OP_bit_piece, 0, 32)
!284 = !DILocation(line: 58, column: 82, scope: !130, inlinedAt: !285)
!285 = distinct !DILocation(line: 80, column: 17, scope: !111)
!286 = !DIExpression(DW_OP_bit_piece, 32, 32)
!287 = !DIExpression(DW_OP_bit_piece, 64, 32)
!288 = !DIExpression(DW_OP_bit_piece, 96, 32)
!289 = !DIExpression(DW_OP_bit_piece, 128, 32)
!290 = !DIExpression(DW_OP_bit_piece, 160, 32)
!291 = !DIExpression(DW_OP_bit_piece, 192, 32)
!292 = !DIExpression(DW_OP_bit_piece, 224, 32)
!293 = !DIExpression(DW_OP_bit_piece, 256, 32)
!294 = !DIExpression(DW_OP_bit_piece, 288, 32)
!295 = !DIExpression(DW_OP_bit_piece, 320, 32)
!296 = !DIExpression(DW_OP_bit_piece, 352, 32)
!297 = !DIExpression(DW_OP_bit_piece, 384, 32)
!298 = !DIExpression(DW_OP_bit_piece, 416, 32)
!299 = !DIExpression(DW_OP_bit_piece, 448, 32)
!300 = !DIExpression(DW_OP_bit_piece, 480, 32)
!301 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !130, file: !32, line: 58, type: !22)
!302 = !DILocation(line: 58, column: 54, scope: !130, inlinedAt: !285)
!303 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !130, file: !32, line: 58, type: !133)
!304 = !DILocation(line: 58, column: 37, scope: !130, inlinedAt: !285)
!305 = !DILocation(line: 60, column: 17, scope: !130, inlinedAt: !285)
!306 = !DILocation(line: 60, column: 23, scope: !130, inlinedAt: !285)
!307 = !DILocation(line: 60, column: 12, scope: !130, inlinedAt: !285)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !130, file: !32, line: 60, type: !170)
!309 = !DILocation(line: 61, column: 29, scope: !130, inlinedAt: !285)
!310 = !DILocation(line: 61, column: 27, scope: !130, inlinedAt: !285)
!311 = !DILocation(line: 61, column: 57, scope: !130, inlinedAt: !285)
!312 = !DILocation(line: 61, column: 63, scope: !130, inlinedAt: !285)
!313 = !DILocation(line: 61, column: 12, scope: !130, inlinedAt: !285)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !130, file: !32, line: 61, type: !170)
!315 = !DILocation(line: 64, column: 19, scope: !130, inlinedAt: !285)
!316 = !DILocation(line: 64, column: 17, scope: !130, inlinedAt: !285)
!317 = !DILocation(line: 67, column: 20, scope: !130, inlinedAt: !285)
!318 = !DILocation(line: 67, column: 12, scope: !130, inlinedAt: !285)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !130, file: !32, line: 67, type: !10)
!320 = !DILocation(line: 68, column: 15, scope: !130, inlinedAt: !285)
!321 = !DILocation(line: 71, column: 16, scope: !130, inlinedAt: !285)
!322 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 0, scope: !130, file: !32, line: 70, type: !105)
!323 = !DILocation(line: 70, column: 11, scope: !130, inlinedAt: !285)
!324 = !DILocation(line: 72, column: 41, scope: !130, inlinedAt: !285)
!325 = !DILocation(line: 72, column: 21, scope: !130, inlinedAt: !285)
!326 = !DILocation(line: 72, column: 19, scope: !130, inlinedAt: !285)
!327 = !DILocation(line: 74, column: 5, scope: !130, inlinedAt: !285)
!328 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 2, scope: !101, file: !1, line: 18, type: !105)
!329 = !DILocation(line: 18, column: 73, scope: !101, inlinedAt: !276)
!330 = !DILocation(line: 83, column: 10, scope: !111)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !111, file: !1, line: 83, type: !109)
!332 = !DIExpression()
!333 = !DILocation(line: 84, column: 20, scope: !111)
!334 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 3, scope: !101, file: !1, line: 18, type: !109)
!335 = !DILocation(line: 18, column: 86, scope: !101, inlinedAt: !276)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scene", arg: 1, scope: !101, file: !1, line: 18, type: !104)
!337 = !DILocation(line: 18, column: 57, scope: !101, inlinedAt: !276)
!338 = !DILocation(line: 20, column: 9, scope: !101, inlinedAt: !276)
!339 = !DILocation(line: 27, column: 13, scope: !101, inlinedAt: !276)
!340 = !DILocation(line: 27, column: 20, scope: !101, inlinedAt: !276)
!341 = !DILocation(line: 28, column: 10, scope: !101, inlinedAt: !276)
!342 = !DILocation(line: 28, column: 20, scope: !101, inlinedAt: !276)
!343 = !DILocation(line: 31, column: 13, scope: !101, inlinedAt: !276)
!344 = !DILocation(line: 31, column: 18, scope: !101, inlinedAt: !276)
!345 = !DILocation(line: 32, column: 13, scope: !101, inlinedAt: !276)
!346 = !DILocation(line: 32, column: 18, scope: !101, inlinedAt: !276)
!347 = !DILocation(line: 33, column: 31, scope: !101, inlinedAt: !276)
!348 = !DILocation(line: 33, column: 78, scope: !101, inlinedAt: !276)
!349 = !DILocation(line: 45, column: 23, scope: !101, inlinedAt: !276)
!350 = !DILocation(line: 45, column: 5, scope: !101, inlinedAt: !276)
!351 = !DILocation(line: 46, column: 1, scope: !101, inlinedAt: !276)
!352 = !DILocation(line: 84, column: 12, scope: !111)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !111, file: !1, line: 84, type: !10)
!354 = !DILocation(line: 87, column: 19, scope: !111)
!355 = !DILocation(line: 87, column: 43, scope: !111)
!356 = !DILocation(line: 88, column: 1, scope: !111)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !101, file: !1, line: 26, type: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 26, size: 256, align: 32, elements: !359)
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !358, file: !1, line: 26, baseType: !23, size: 96, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !358, file: !1, line: 26, baseType: !14, size: 32, align: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !358, file: !1, line: 26, baseType: !23, size: 96, align: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !358, file: !1, line: 26, baseType: !14, size: 32, align: 32, offset: 224)
!364 = !DILocation(line: 26, column: 13, scope: !101, inlinedAt: !276)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !101, file: !1, line: 33, type: !121)
!366 = !DILocation(line: 33, column: 18, scope: !101, inlinedAt: !276)
!367 = !DILocation(line: 108, column: 9, scope: !117)
!368 = !DILocation(line: 23, column: 36, scope: !31, inlinedAt: !369)
!369 = distinct !DILocation(line: 104, column: 28, scope: !117)
!370 = !DILocation(line: 35, column: 5, scope: !101, inlinedAt: !371)
!371 = distinct !DILocation(line: 129, column: 34, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !1, line: 126, column: 5)
!373 = distinct !DILexicalBlock(scope: !117, file: !1, line: 125, column: 9)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !117, file: !1, line: 96, type: !126)
!375 = !DILocation(line: 96, column: 69, scope: !117)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !117, file: !1, line: 96, type: !121)
!377 = !DILocation(line: 96, column: 44, scope: !117)
!378 = !DILocation(line: 98, column: 10, scope: !117)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !117, file: !1, line: 98, type: !46)
!380 = !DILocation(line: 99, column: 57, scope: !117)
!381 = !DILocation(line: 99, column: 10, scope: !117)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStrideInBytes", scope: !117, file: !1, line: 99, type: !46)
!383 = !DILocation(line: 100, column: 60, scope: !117)
!384 = !DILocation(line: 100, column: 77, scope: !117)
!385 = !DILocation(line: 100, column: 98, scope: !117)
!386 = !DILocation(line: 100, column: 104, scope: !117)
!387 = !DILocation(line: 100, column: 102, scope: !117)
!388 = !DILocation(line: 101, column: 6, scope: !117)
!389 = !DILocation(line: 100, column: 10, scope: !117)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseOffsetInBytes", scope: !117, file: !1, line: 100, type: !46)
!391 = !DILocation(line: 103, column: 61, scope: !117)
!392 = !DILocation(line: 103, column: 78, scope: !117)
!393 = !DILocation(line: 103, column: 10, scope: !117)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startIndex_in_VB_SRV", scope: !117, file: !1, line: 103, type: !46)
!395 = !DILocation(line: 104, column: 28, scope: !117)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 2, scope: !31, file: !32, line: 9, type: !46)
!397 = !DILocation(line: 9, column: 57, scope: !31, inlinedAt: !369)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Indices", arg: 1, scope: !31, file: !32, line: 9, type: !44)
!399 = !DILocation(line: 9, column: 44, scope: !31, inlinedAt: !369)
!400 = !DILocation(line: 20, column: 49, scope: !31, inlinedAt: !369)
!401 = !DILocation(line: 20, column: 16, scope: !31, inlinedAt: !369)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !31, file: !32, line: 20, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !31, file: !32, line: 23, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !408, templateParams: !411)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !407, file: !1, line: 23, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !407, file: !1, line: 23, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!411 = !{!43, !90}
!412 = !DILocation(line: 23, column: 17, scope: !31, inlinedAt: !369)
!413 = !DILocation(line: 26, column: 28, scope: !414, inlinedAt: !369)
!414 = distinct !DILexicalBlock(scope: !31, file: !32, line: 26, column: 9)
!415 = !DILocation(line: 26, column: 13, scope: !101, inlinedAt: !371)
!416 = !DILocation(line: 33, column: 18, scope: !101, inlinedAt: !371)
!417 = !DILocation(line: 26, column: 9, scope: !31, inlinedAt: !369)
!418 = !DILocation(line: 28, column: 40, scope: !419, inlinedAt: !369)
!419 = distinct !DILexicalBlock(scope: !414, file: !32, line: 27, column: 5)
!420 = !DILocation(line: 28, column: 19, scope: !419, inlinedAt: !369)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !31, file: !32, line: 11, type: !35)
!422 = !DILocation(line: 11, column: 11, scope: !31, inlinedAt: !369)
!423 = !DILocation(line: 29, column: 41, scope: !419, inlinedAt: !369)
!424 = !DILocation(line: 29, column: 48, scope: !419, inlinedAt: !369)
!425 = !DILocation(line: 29, column: 19, scope: !419, inlinedAt: !369)
!426 = !DILocation(line: 30, column: 40, scope: !419, inlinedAt: !369)
!427 = !DILocation(line: 30, column: 19, scope: !419, inlinedAt: !369)
!428 = !DILocation(line: 31, column: 5, scope: !419, inlinedAt: !369)
!429 = !DILocation(line: 34, column: 41, scope: !430, inlinedAt: !369)
!430 = distinct !DILexicalBlock(scope: !414, file: !32, line: 33, column: 5)
!431 = !DILocation(line: 34, column: 48, scope: !430, inlinedAt: !369)
!432 = !DILocation(line: 34, column: 19, scope: !430, inlinedAt: !369)
!433 = !DILocation(line: 35, column: 40, scope: !430, inlinedAt: !369)
!434 = !DILocation(line: 35, column: 19, scope: !430, inlinedAt: !369)
!435 = !DILocation(line: 36, column: 41, scope: !430, inlinedAt: !369)
!436 = !DILocation(line: 36, column: 48, scope: !430, inlinedAt: !369)
!437 = !DILocation(line: 36, column: 19, scope: !430, inlinedAt: !369)
!438 = !DILocation(line: 39, column: 5, scope: !31, inlinedAt: !369)
!439 = !DILocation(line: 104, column: 17, scope: !117)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices3", scope: !117, file: !1, line: 104, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!442 = !DILocation(line: 107, column: 5, scope: !117)
!443 = !DILocation(line: 108, column: 39, scope: !117)
!444 = !DILocation(line: 108, column: 54, scope: !117)
!445 = !DILocation(line: 109, column: 39, scope: !117)
!446 = !DILocation(line: 109, column: 9, scope: !117)
!447 = !DILocation(line: 109, column: 54, scope: !117)
!448 = !DILocation(line: 110, column: 39, scope: !117)
!449 = !DILocation(line: 110, column: 9, scope: !117)
!450 = !DILocation(line: 110, column: 54, scope: !117)
!451 = !DILocation(line: 114, column: 5, scope: !117)
!452 = !DILocation(line: 115, column: 39, scope: !117)
!453 = !DILocation(line: 115, column: 9, scope: !117)
!454 = !DILocation(line: 115, column: 54, scope: !117)
!455 = !DILocation(line: 116, column: 33, scope: !117)
!456 = !DILocation(line: 116, column: 3, scope: !117)
!457 = !DILocation(line: 116, column: 48, scope: !117)
!458 = !DILocation(line: 117, column: 33, scope: !117)
!459 = !DILocation(line: 117, column: 3, scope: !117)
!460 = !DILocation(line: 117, column: 48, scope: !117)
!461 = !DILocation(line: 120, column: 12, scope: !117)
!462 = !DILocation(line: 122, column: 29, scope: !117)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !91, file: !32, line: 84, type: !82)
!464 = !DILocation(line: 84, column: 98, scope: !91, inlinedAt: !465)
!465 = distinct !DILocation(line: 122, column: 29, scope: !117)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vertexAttribute", arg: 1, scope: !91, file: !32, line: 84, type: !94)
!467 = !DILocation(line: 84, column: 40, scope: !91, inlinedAt: !465)
!468 = !{i32 0, i32 96, i32 3}
