#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 7524d34d95034d5a24e05a5f4cdef450.pdb
; shader hash: 7524d34d95034d5a24e05a5f4cdef450
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.SceneConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer g_cubeCB
; {
;
;   struct g_cubeCB
;   {
;
;       struct struct.CubeConstantBuffer
;       {
;
;           float4 albedo;                            ; Offset:    0
;       
;       } g_cubeCB;                                   ; Offset:    0
;
;   
;   } g_cubeCB;                                       ; Offset:    0 Size:    16
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.Vertex
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !84)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 76, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 76, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 76, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 76, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 76, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 76, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !41, !56, !59, !62, !70, !73}
!17 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 27, type: !18, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !24)
!31 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 65, type: !32, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 56, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 56, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 56, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!13, !29}
!41 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 71, type: !42, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!34, !44, !47}
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 288, align: 32, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 3)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 68, size: 64, align: 32, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !47, file: !1, line: 68, baseType: !50, size: 64, align: 32)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 68, size: 64, align: 32, elements: !51, templateParams: !54)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 68, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !{!13, !55}
!55 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!56 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 96, type: !57, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!4, !34, !34}
!59 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 107, type: !60, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!60 = !DISubroutineType(types: !61)
!61 = !{null}
!62 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 132, type: !63, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !69}
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 59, size: 128, align: 32, elements: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !66, file: !1, line: 61, baseType: !4, size: 128, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 58, baseType: !47)
!70 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 165, type: !71, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!71 = !DISubroutineType(types: !72)
!72 = !{null, !65}
!73 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 79, type: !74, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76, !82, !82}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 39, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 39, size: 64, align: 32, elements: !78, templateParams: !81)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !77, file: !1, line: 39, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !77, file: !1, line: 39, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!81 = !{!28, !55}
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !34)
!84 = !{!85, !87, !89, !93, !95, !106, !141}
!85 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 125, type: !86, isLocal: true, isDefinition: true, variable: i32 16)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!87 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 18, type: !88, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 18, size: 32, align: 32, elements: !2)
!89 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 19, type: !90, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !91)
!91 = !{!92}
!92 = !DITemplateTypeParameter(name: "element", type: !5)
!93 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 20, type: !94, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 20, size: 32, align: 32, elements: !2)
!95 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 21, type: !96, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 21, size: 192, align: 32, elements: !2, templateParams: !97)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "element", type: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !100, line: 38, size: 192, align: 32, elements: !101)
!100 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!101 = !{!102, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !99, file: !100, line: 40, baseType: !103, size: 96, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !104, line: 15, baseType: !34)
!104 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !99, file: !100, line: 41, baseType: !103, size: 96, align: 32, offset: 96)
!106 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@USceneConstantBuffer@@@@A", scope: !0, file: !1, line: 23, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<SceneConstantBuffer>", file: !1, line: 23, size: 32, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneConstantBuffer", file: !100, line: 24, size: 1024, align: 32, elements: !111)
!111 = !{!112, !136, !138, !139, !140}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !110, file: !100, line: 26, baseType: !113, size: 512, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !104, line: 18, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !116, templateParams: !133)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !115, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!133 = !{!13, !134, !135}
!134 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!135 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !110, file: !100, line: 27, baseType: !137, size: 128, align: 32, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !104, line: 17, baseType: !4)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !110, file: !100, line: 28, baseType: !137, size: 128, align: 32, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !110, file: !100, line: 29, baseType: !137, size: 128, align: 32, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !110, file: !100, line: 30, baseType: !137, size: 128, align: 32, offset: 896)
!141 = !DIGlobalVariable(name: "g_cubeCB", linkageName: "\01?g_cubeCB@@3U?$ConstantBuffer@UCubeConstantBuffer@@@@A", scope: !0, file: !1, line: 24, type: !142, isLocal: false, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<CubeConstantBuffer>", file: !1, line: 24, size: 32, align: 32, elements: !2, templateParams: !143)
!143 = !{!144}
!144 = !DITemplateTypeParameter(name: "T", type: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "CubeConstantBuffer", file: !100, line: 33, size: 128, align: 32, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !145, file: !100, line: 35, baseType: !148, size: 128, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !104, line: 16, baseType: !4)
!149 = !{i32 2, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!152 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space1);\0D\0ARWTexture2D<float4> RenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<Vertex> Vertices : register(t2, space1);\0D\0A\0D\0AConstantBuffer<SceneConstantBuffer> g_sceneCB : register(b0, space1);\0D\0AConstantBuffer<CubeConstantBuffer> g_cubeCB : register(b1, space1);\0D\0A\0D\0A// Load three 16 bit indices from a byte addressed buffer.\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_sceneCB.projectionToWorld);\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A// Diffuse lighting calculation.\0D\0Afloat4 CalculateDiffuseLighting(float3 hitPosition, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(g_sceneCB.lightPosition.xyz - hitPosition);\0D\0A\0D\0A    // Diffuse contribution.\0D\0A    float fNDotL = max(0.0f, dot(pixelToLight, normal));\0D\0A\0D\0A    return g_cubeCB.albedo * g_sceneCB.lightDiffuseColor * fNDotL;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A    \0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A\0D\0A    // Get the base index of the triangle's first 16 bit index.\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = PrimitiveIndex() * triangleIndexStride;\0D\0A\0D\0A    // Load up 3 16 bit indices for the triangle.\0D\0A    const uint3 indices = Load3x16BitIndices(baseIndex);\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3 vertexNormals[3] =\0D\0A    {\0D\0A        Vertices[indices[0]].normal,\0D\0A        Vertices[indices[1]].normal,\0D\0A        Vertices[indices[2]].normal \0D\0A    };\0D\0A\0D\0A    // Compute the triangle's normal.\0D\0A    // This is redundant and done for illustration purposes \0D\0A    // as all the per-vertex normals are the same and match triangle's normal in this sample. \0D\0A    float3 triangleNormal = HitAttribute(vertexNormals, attr);\0D\0A\0D\0A    float4 diffuseColor = CalculateDiffuseLighting(hitPosition, triangleNormal);\0D\0A    float4 color = g_sceneCB.lightAmbientColor + diffuseColor;\0D\0A\0D\0A    payload.color = color;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.0f, 0.2f, 0.4f, 1.0f);\0D\0A    payload.color = background;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!153 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!154 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0Ausing namespace DirectX;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct SceneConstantBuffer\0D\0A{\0D\0A    XMMATRIX projectionToWorld;\0D\0A    XMVECTOR cameraPosition;\0D\0A    XMVECTOR lightPosition;\0D\0A    XMVECTOR lightAmbientColor;\0D\0A    XMVECTOR lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A    XMFLOAT3 position;\0D\0A    XMFLOAT3 normal;\0D\0A};\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!155 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!156 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!157 = !{i32 1, i32 3}
!158 = !{i32 1, i32 6}
!159 = !{!"lib", i32 6, i32 3}
!160 = !{!161, !167, !170, null}
!161 = !{!162, !164, !165}
!162 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 1, i32 0, i32 1, i32 16, i32 0, !163}
!163 = !{i32 0, i32 4}
!164 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!165 = !{i32 2, %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !166}
!166 = !{i32 1, i32 24}
!167 = !{!168}
!168 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !169}
!169 = !{i32 0, i32 9}
!170 = !{!171, !172}
!171 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!172 = !{i32 1, %g_cubeCB* @g_cubeCB, !"g_cubeCB", i32 1, i32 1, i32 1, i32 16, null}
!173 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !174, %"class.RWTexture2D<vector<float, 4> >" undef, !176, %struct.ByteAddressBuffer undef, !174, %"class.StructuredBuffer<Vertex>" undef, !178, %struct.Vertex undef, !180, %struct.SceneConstantBuffer undef, !183, %struct.CubeConstantBuffer undef, !190, %struct.BuiltInTriangleIntersectionAttributes undef, !192, %struct.RayDesc undef, !194, %struct.RayPayload undef, !199, %g_sceneCB undef, !201, %g_cubeCB undef, !203}
!174 = !{i32 4, !175}
!175 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!176 = !{i32 16, !177}
!177 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!178 = !{i32 28, !179}
!179 = !{i32 6, !"h", i32 3, i32 0}
!180 = !{i32 28, !181, !182}
!181 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!182 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!183 = !{i32 128, !184, !186, !187, !188, !189}
!184 = !{i32 6, !"projectionToWorld", i32 2, !185, i32 3, i32 0, i32 7, i32 9}
!185 = !{i32 4, i32 4, i32 2}
!186 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!187 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!188 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!189 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!190 = !{i32 16, !191}
!191 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!192 = !{i32 8, !193}
!193 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!194 = !{i32 32, !195, !196, !197, !198}
!195 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!196 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!197 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!198 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!199 = !{i32 16, !200}
!200 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!201 = !{i32 128, !202}
!202 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!203 = !{i32 16, !204}
!204 = !{i32 6, !"g_cubeCB", i32 3, i32 0}
!205 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !206, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !208, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !211}
!206 = !{!207}
!207 = !{i32 1, !2, !2}
!208 = !{!207, !209, !210}
!209 = !{i32 2, !2, !2}
!210 = !{i32 0, !2, !2}
!211 = !{!207, !209}
!212 = !{null, !"", null, !160, !213}
!213 = !{i32 0, i64 65553}
!214 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !215}
!215 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !216}
!216 = !{i32 0}
!217 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !218}
!218 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !216}
!219 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !220}
!220 = !{i32 8, i32 7, i32 5, !216}
!221 = !DILocation(line: 125, column: 5, scope: !59)
!222 = !DILocation(line: 128, column: 5, scope: !59)
!223 = !DILocation(line: 113, column: 23, scope: !59)
!224 = !DILocation(line: 113, column: 5, scope: !59)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !73, file: !1, line: 79, type: !76)
!226 = !DIExpression(DW_OP_bit_piece, 0, 32)
!227 = !DILocation(line: 79, column: 37, scope: !73, inlinedAt: !228)
!228 = distinct !DILocation(line: 113, column: 5, scope: !59)
!229 = !DIExpression(DW_OP_bit_piece, 32, 32)
!230 = !DILocation(line: 81, column: 17, scope: !73, inlinedAt: !228)
!231 = !DILocation(line: 81, column: 23, scope: !73, inlinedAt: !228)
!232 = !DILocation(line: 81, column: 12, scope: !73, inlinedAt: !228)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !73, file: !1, line: 81, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 81, baseType: !50)
!235 = !DILocation(line: 82, column: 29, scope: !73, inlinedAt: !228)
!236 = !DILocation(line: 82, column: 27, scope: !73, inlinedAt: !228)
!237 = !DILocation(line: 82, column: 57, scope: !73, inlinedAt: !228)
!238 = !DILocation(line: 82, column: 63, scope: !73, inlinedAt: !228)
!239 = !DILocation(line: 82, column: 12, scope: !73, inlinedAt: !228)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !73, file: !1, line: 82, type: !234)
!241 = !DILocation(line: 85, column: 19, scope: !73, inlinedAt: !228)
!242 = !DILocation(line: 85, column: 17, scope: !73, inlinedAt: !228)
!243 = !DILocation(line: 88, column: 59, scope: !73, inlinedAt: !228)
!244 = !DILocation(line: 88, column: 20, scope: !73, inlinedAt: !228)
!245 = !DILocation(line: 88, column: 12, scope: !73, inlinedAt: !228)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !73, file: !1, line: 88, type: !4)
!247 = !DIExpression(DW_OP_bit_piece, 64, 32)
!248 = !DIExpression(DW_OP_bit_piece, 96, 32)
!249 = !DILocation(line: 90, column: 15, scope: !73, inlinedAt: !228)
!250 = !DILocation(line: 91, column: 14, scope: !73, inlinedAt: !228)
!251 = !DILocation(line: 91, column: 12, scope: !73, inlinedAt: !228)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !73, file: !1, line: 79, type: !34)
!253 = !DILocation(line: 79, column: 55, scope: !73, inlinedAt: !228)
!254 = !DILocation(line: 92, column: 37, scope: !73, inlinedAt: !228)
!255 = !DILocation(line: 92, column: 17, scope: !73, inlinedAt: !228)
!256 = !DILocation(line: 92, column: 15, scope: !73, inlinedAt: !228)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !73, file: !1, line: 79, type: !34)
!258 = !DILocation(line: 79, column: 74, scope: !73, inlinedAt: !228)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !59, file: !1, line: 109, type: !34)
!260 = !DILocation(line: 109, column: 12, scope: !59)
!261 = !DILocation(line: 93, column: 1, scope: !73, inlinedAt: !228)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !59, file: !1, line: 110, type: !34)
!263 = !DILocation(line: 110, column: 12, scope: !59)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !59, file: !1, line: 117, type: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 117, size: 256, align: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !265, file: !1, line: 117, baseType: !35, size: 96, align: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !265, file: !1, line: 117, baseType: !8, size: 32, align: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !265, file: !1, line: 117, baseType: !35, size: 96, align: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !265, file: !1, line: 117, baseType: !8, size: 32, align: 32, offset: 224)
!271 = !DIExpression()
!272 = !DILocation(line: 117, column: 13, scope: !59)
!273 = !DILocation(line: 118, column: 9, scope: !59)
!274 = !DILocation(line: 118, column: 16, scope: !59)
!275 = !DILocation(line: 119, column: 9, scope: !59)
!276 = !DILocation(line: 119, column: 19, scope: !59)
!277 = !DILocation(line: 122, column: 9, scope: !59)
!278 = !DILocation(line: 122, column: 14, scope: !59)
!279 = !DILocation(line: 123, column: 9, scope: !59)
!280 = !DILocation(line: 123, column: 14, scope: !59)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !59, file: !1, line: 124, type: !66)
!282 = !DILocation(line: 124, column: 16, scope: !59)
!283 = !DILocation(line: 124, column: 26, scope: !59)
!284 = !DILocation(line: 128, column: 52, scope: !59)
!285 = !DILocation(line: 128, column: 18, scope: !59)
!286 = !DILocation(line: 128, column: 42, scope: !59)
!287 = !DILocation(line: 129, column: 1, scope: !59)
!288 = !DILocation(line: 148, column: 9, scope: !62)
!289 = !DILocation(line: 39, column: 36, scope: !17, inlinedAt: !290)
!290 = distinct !DILocation(line: 143, column: 27, scope: !62)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !62, file: !1, line: 132, type: !69)
!292 = !DILocation(line: 132, column: 67, scope: !62)
!293 = !DILocation(line: 134, column: 26, scope: !62)
!294 = !DILocation(line: 67, column: 12, scope: !31, inlinedAt: !295)
!295 = distinct !DILocation(line: 134, column: 26, scope: !62)
!296 = !DILocation(line: 67, column: 31, scope: !31, inlinedAt: !295)
!297 = !DILocation(line: 67, column: 47, scope: !31, inlinedAt: !295)
!298 = !DILocation(line: 67, column: 45, scope: !31, inlinedAt: !295)
!299 = !DILocation(line: 67, column: 29, scope: !31, inlinedAt: !295)
!300 = !DILocation(line: 67, column: 5, scope: !31, inlinedAt: !295)
!301 = !DILocation(line: 134, column: 12, scope: !62)
!302 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitPosition", scope: !62, file: !1, line: 134, type: !34)
!303 = !DILocation(line: 137, column: 10, scope: !62)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !62, file: !1, line: 137, type: !30)
!305 = !DILocation(line: 138, column: 10, scope: !62)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indicesPerTriangle", scope: !62, file: !1, line: 138, type: !30)
!307 = !DILocation(line: 139, column: 51, scope: !62)
!308 = !DILocation(line: 139, column: 10, scope: !62)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndexStride", scope: !62, file: !1, line: 139, type: !30)
!310 = !DILocation(line: 140, column: 22, scope: !62)
!311 = !DILocation(line: 140, column: 39, scope: !62)
!312 = !DILocation(line: 140, column: 10, scope: !62)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIndex", scope: !62, file: !1, line: 140, type: !30)
!314 = !DILocation(line: 143, column: 27, scope: !62)
!315 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !17, file: !1, line: 27, type: !30)
!316 = !DILocation(line: 27, column: 31, scope: !17, inlinedAt: !290)
!317 = !DILocation(line: 38, column: 49, scope: !17, inlinedAt: !290)
!318 = !DILocation(line: 38, column: 16, scope: !17, inlinedAt: !290)
!319 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !17, file: !1, line: 38, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!321 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !17, file: !1, line: 39, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!323 = !DILocation(line: 39, column: 17, scope: !17, inlinedAt: !290)
!324 = !DILocation(line: 42, column: 28, scope: !325, inlinedAt: !290)
!325 = distinct !DILexicalBlock(scope: !17, file: !1, line: 42, column: 9)
