#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 008dc03fb92bc109114777a3e8a77245.pdb
; shader hash: 008dc03fb92bc109114777a3e8a77245
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer l_ObjectCB_Static
; {
;
;   struct l_ObjectCB_Static
;   {
;
;       struct struct.OBJECT_CB_STATIC_Arr
;       {
;
;           struct struct.OBJECT_CB_STATIC
;           {
;
;               float4 albedo;                        ; Offset:    0
;               uint startIndex_in_IB_SRV;            ; Offset:   16
;               uint startIndex_in_VB_SRV;            ; Offset:   20
;               float reflectanceCoef;                ; Offset:   24
;               float diffuseCoef;                    ; Offset:   28
;               float specularCoef;                   ; Offset:   32

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !31, globals: !161)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 101, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingDefines.h", directory: "")
!5 = !DINamespace(name: "RayType", scope: null, file: !4, line: 100)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "Radiance", value: 0)
!8 = !DIEnumerator(name: "Shadow", value: 1)
!9 = !DIEnumerator(name: "Count", value: 2)
!10 = !{!11, !23}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 40, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 40, size: 128, align: 32, elements: !13, templateParams: !19)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !12, file: !1, line: 40, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!15 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !12, file: !1, line: 40, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !12, file: !1, line: 40, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !12, file: !1, line: 40, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!19 = !{!20, !21}
!20 = !DITemplateTypeParameter(name: "element", type: !15)
!21 = !DITemplateValueParameter(name: "element_count", type: !22, value: i32 4)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 83, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 83, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 83, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 83, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 83, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!20, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !22, value: i32 3)
!31 = !{!32, !48, !63, !67, !99, !102, !105, !109, !112, !122, !125, !128, !131, !141, !144, !151}
!32 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@UByteAddressBuffer@@I@Z", scope: !33, file: !33, line: 9, type: !34, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingFunctions.hlsli", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !45, !47}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !38, templateParams: !43)
!38 = !{!39, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, baseType: !40, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, baseType: !40, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, baseType: !40, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!44, !30}
!44 = !DITemplateTypeParameter(name: "element", type: !40)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, size: 32, align: 32, elements: !46)
!46 = !{}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !40)
!48 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !33, file: !33, line: 78, type: !49, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!11, !51, !54}
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 384, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 3)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 40, size: 64, align: 32, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !54, file: !1, line: 40, baseType: !57, size: 64, align: 32)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !58, templateParams: !61)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !57, file: !1, line: 40, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !57, file: !1, line: 40, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!61 = !{!20, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !22, value: i32 2)
!63 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !33, file: !33, line: 84, type: !64, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!23, !66, !54}
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 288, align: 32, elements: !52)
!67 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@MV?$vector@M$02@@1@Z", scope: !33, file: !33, line: 91, type: !68, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!11, !70, !15, !23, !23}
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !4, line: 34, size: 1024, align: 32, elements: !71)
!71 = !{!72, !95, !96, !97, !98}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !70, file: !4, line: 36, baseType: !73, size: 512, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 89, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 89, size: 512, align: 32, elements: !75, templateParams: !92)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !74, file: !1, line: 89, baseType: !15, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!92 = !{!20, !93, !94}
!93 = !DITemplateValueParameter(name: "row_count", type: !22, value: i32 4)
!94 = !DITemplateValueParameter(name: "col_count", type: !22, value: i32 4)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !70, file: !4, line: 37, baseType: !11, size: 128, align: 32, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !70, file: !4, line: 38, baseType: !11, size: 128, align: 32, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !70, file: !4, line: 39, baseType: !11, size: 128, align: 32, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !70, file: !4, line: 40, baseType: !11, size: 128, align: 32, offset: 896)
!99 = !DISubprogram(name: "CalculateDiffuseCoefficient", linkageName: "\01?CalculateDiffuseCoefficient@@YAMV?$vector@M$02@@00@Z", scope: !33, file: !33, line: 101, type: !100, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!15, !23, !23, !23}
!102 = !DISubprogram(name: "CalculateSpecularCoefficient", linkageName: "\01?CalculateSpecularCoefficient@@YA?AV?$vector@M$03@@V?$vector@M$02@@00M@Z", scope: !33, file: !33, line: 108, type: !103, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!11, !23, !23, !23, !15}
!105 = !DISubprogram(name: "CalculatePhongLighting", linkageName: "\01?CalculatePhongLighting@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@V?$vector@M$02@@V1@1_NMMM@Z", scope: !33, file: !33, line: 116, type: !106, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubroutineType(types: !107)
!107 = !{!11, !70, !23, !11, !23, !108, !15, !15, !15}
!108 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!109 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !33, file: !33, line: 149, type: !110, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubroutineType(types: !111)
!111 = !{!23, !23, !23, !23}
!112 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URaytracingAccelerationStructure@@UMyRay@@I@Z", scope: !33, file: !33, line: 156, type: !113, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!11, !115, !116, !120}
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 153, size: 32, align: 32, elements: !46)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRay", file: !4, line: 82, size: 192, align: 32, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !116, file: !4, line: 84, baseType: !23, size: 96, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !116, file: !4, line: 85, baseType: !23, size: 96, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !121, line: 19, baseType: !47)
!121 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!122 = !DISubprogram(name: "TraceShadowRayAndReportIfHit", linkageName: "\01?TraceShadowRayAndReportIfHit@@YA_NURaytracingAccelerationStructure@@UMyRay@@I@Z", scope: !33, file: !33, line: 185, type: !123, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!108, !115, !116, !120}
!125 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 21, type: !126, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!126 = !DISubroutineType(types: !127)
!127 = !{null}
!128 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 62, type: !129, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!23}
!131 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 68, type: !132, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !140}
!134 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRayPayload", file: !4, line: 87, size: 160, align: 32, elements: !136)
!136 = !{!137, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !135, file: !4, line: 89, baseType: !138, size: 128, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !121, line: 16, baseType: !11)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "recursionDepth", scope: !135, file: !4, line: 90, baseType: !120, size: 32, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !33, line: 6, baseType: !54)
!141 = !DISubprogram(name: "MissShader_Default", linkageName: "\01?MissShader_Default@@YAXUMyRayPayload@@@Z", scope: !1, file: !1, line: 139, type: !142, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*)* @"\01?MissShader_Default@@YAXUMyRayPayload@@@Z")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !134}
!144 = !DISubprogram(name: "MissShader_ShadowRay", linkageName: "\01?MissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", scope: !1, file: !1, line: 146, type: !145, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.ShadowRayPayload*)* @"\01?MissShader_ShadowRay@@YAXUShadowRayPayload@@@Z")
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147}
!147 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ShadowRayPayload", file: !4, line: 93, size: 32, align: 32, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !148, file: !4, line: 95, baseType: !108, size: 32, align: 32)
!151 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AUMyRay@@V?$vector@H$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !33, file: !33, line: 58, type: !152, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!152 = !DISubroutineType(types: !153)
!153 = !{!116, !154, !23, !73}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 16, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 16, size: 64, align: 32, elements: !156, templateParams: !159)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !155, file: !1, line: 16, baseType: !22, size: 32, align: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !155, file: !1, line: 16, baseType: !22, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!159 = !{!160, !62}
!160 = !DITemplateTypeParameter(name: "element", type: !22)
!161 = !{!162, !164, !168, !169, !171, !172, !173, !174, !175, !176, !180, !181, !183, !184, !188, !189, !200, !204, !225}
!162 = !DIGlobalVariable(name: "InShadowRadiance", scope: !0, file: !4, line: 109, type: !163, isLocal: true, isDefinition: true, variable: float 0x3FD6666660000000)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!164 = !DIGlobalVariable(name: "GeometryStride", scope: !165, file: !4, line: 121, type: !167, isLocal: true, isDefinition: true, variable: i32 2)
!165 = !DINamespace(name: "HitGroup", scope: !166, file: !4, line: 115)
!166 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 112)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!168 = !DIGlobalVariable(name: "InstanceMask", scope: !166, file: !4, line: 114, type: !167, isLocal: true, isDefinition: true, variable: i32 -1)
!169 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 174, type: !170, isLocal: true, isDefinition: true, variable: i32 16)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!171 = !DIGlobalVariable(name: "RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH", scope: !0, file: !1, line: 207, type: !170, isLocal: true, isDefinition: true, variable: i32 4)
!172 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 208, type: !170, isLocal: true, isDefinition: true, variable: i32 1)
!173 = !DIGlobalVariable(name: "RAY_FLAG_SKIP_CLOSEST_HIT_SHADER", scope: !0, file: !1, line: 209, type: !170, isLocal: true, isDefinition: true, variable: i32 8)
!174 = !DIGlobalVariable(name: "InShadowRadiance", scope: !0, file: !4, line: 109, type: !163, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !166, file: !4, line: 114, type: !167, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !165, file: !4, line: 116, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, align: 32, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 2)
!180 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !165, file: !4, line: 121, type: !167, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !182, file: !4, line: 124, type: !177, isLocal: true, isDefinition: true)
!182 = !DINamespace(name: "MissShader", scope: !166, file: !4, line: 123)
!183 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !115, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!184 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !185, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !46, templateParams: !186)
!186 = !{!187}
!187 = !DITemplateTypeParameter(name: "element", type: !12)
!188 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !45, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!189 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !190, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !46, templateParams: !191)
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "element", type: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !4, line: 74, size: 384, align: 32, elements: !194)
!194 = !{!195, !196, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !193, file: !4, line: 76, baseType: !23, size: 96, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !193, file: !4, line: 77, baseType: !23, size: 96, align: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !193, file: !4, line: 78, baseType: !11, size: 128, align: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !193, file: !4, line: 79, baseType: !199, size: 64, align: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !57)
!200 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 12, type: !201, isLocal: false, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 12, size: 32, align: 32, elements: !46, templateParams: !202)
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "T", type: !70)
!204 = !DIGlobalVariable(name: "l_ObjectCB_Static", linkageName: "\01?l_ObjectCB_Static@@3U?$ConstantBuffer@UOBJECT_CB_STATIC_Arr@@@@A", scope: !0, file: !1, line: 15, type: !205, isLocal: false, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_STATIC_Arr>", file: !1, line: 15, size: 32, align: 32, elements: !46, templateParams: !206)
!206 = !{!207}
!207 = !DITemplateTypeParameter(name: "T", type: !208)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC_Arr", file: !4, line: 59, size: 1536, align: 32, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_static", scope: !208, file: !4, line: 61, baseType: !211, size: 1536, align: 32)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 1536, align: 32, elements: !223)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC", file: !4, line: 43, size: 384, align: 32, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !212, file: !4, line: 45, baseType: !138, size: 128, align: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_IB_SRV", scope: !212, file: !4, line: 47, baseType: !120, size: 32, align: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_VB_SRV", scope: !212, file: !4, line: 48, baseType: !120, size: 32, align: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reflectanceCoef", scope: !212, file: !4, line: 49, baseType: !15, size: 32, align: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseCoef", scope: !212, file: !4, line: 50, baseType: !15, size: 32, align: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "specularCoef", scope: !212, file: !4, line: 52, baseType: !15, size: 32, align: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "specularPower", scope: !212, file: !4, line: 53, baseType: !15, size: 32, align: 32, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stepScale", scope: !212, file: !4, line: 54, baseType: !15, size: 32, align: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !212, file: !4, line: 57, baseType: !15, size: 32, align: 32, offset: 352)
!223 = !{!224}
!224 = !DISubrange(count: 4)
!225 = !DIGlobalVariable(name: "l_ObjectCB_Dynamic", linkageName: "\01?l_ObjectCB_Dynamic@@3U?$ConstantBuffer@UOBJECT_CB_DYNAMIC_Arr@@@@A", scope: !0, file: !1, line: 16, type: !226, isLocal: false, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_DYNAMIC_Arr>", file: !1, line: 16, size: 32, align: 32, elements: !46, templateParams: !227)
!227 = !{!228}
!228 = !DITemplateTypeParameter(name: "T", type: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_DYNAMIC_Arr", file: !4, line: 69, size: 2048, align: 32, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_dynamic", scope: !229, file: !4, line: 71, baseType: !232, size: 2048, align: 32)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 2048, align: 32, elements: !223)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_DYNAMIC", file: !4, line: 64, size: 512, align: 32, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "InvTranspose", scope: !233, file: !4, line: 66, baseType: !73, size: 512, align: 32)
!236 = !{i32 2, !"Dwarf Version", i32 4}
!237 = !{i32 2, !"Debug Info Version", i32 3}
!238 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!239 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingFunctions.hlsli\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// Local RootSig\0D\0AConstantBuffer<OBJECT_CB_STATIC_Arr> l_ObjectCB_Static : register(b1, space1);\0D\0AConstantBuffer<OBJECT_CB_DYNAMIC_Arr> l_ObjectCB_Dynamic : register(b2, space1);\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    //    float3 rayDir;\0D\0A    //    float3 origin;\0D\0A    \0D\0A    //// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    //    GenerateCameraRay(g_sceneCB, DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    //// Trace the ray.\0D\0A    //// Set the ray's extents.\0D\0A    //    RayDesc rayDesc;\0D\0A    //    rayDesc.Origin = origin;\0D\0A    //    rayDesc.Direction = rayDir;\0D\0A    //// Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    //// TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    //    rayDesc.TMin = 0.001;\0D\0A    //    rayDesc.TMax = 10000.0;\0D\0A    //    MyRayPayload payload = { float4(0, 0, 0, 0), 2 };\0D\0A    ////TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    //    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, rayDesc, payload);\0D\0A\0D\0A    ////// Cast a ray into the scene and retrieve a shaded color.\0D\0A    ////UINT currentRecursionDepth = 0;\0D\0A    ////float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    //// Write the raytraced color to the output texture.\0D\0A    //    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A\0D\0A\0D\0A    //------------------------\0D\0A\09// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    MyRay ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewProjectionInv);\0D\0A \0D\0A    // Cast a ray into the scene and retrieve a shaded color.\0D\0A    UINT currentRecursionDepth = 0;\0D\0A    float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout MyRayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint instanceIndex = InstanceIndex();\0D\0A    OBJECT_CB_STATIC cur_object_cb_static = l_ObjectCB_Static.object_cb_static[instanceIndex];\0D\0A#pragma region \EC\B6\A9\EB\8F\8C\ED\95\9C \EC\82\BC\EA\B0\81\ED\98\95 \EC\B6\94\EC\A0\81\ED\95\98\EC\97\AC \EB\B2\84\ED\85\8D\EC\8A\A4 \EC\A0\95\EB\B3\B4 \EA\B0\80\EC\A0\B8\EC\98\A4\EA\B8\B0\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStrideInBytes = indexSizeInBytes * 3;\0D\0A    uint iBaseOffsetInBytes = (cur_object_cb_static.startIndex_in_IB_SRV / 3 + PrimitiveIndex())\0D\0A     * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A        \0D\0A    uint startIndex_in_VB_SRV = cur_object_cb_static.startIndex_in_VB_SRV;\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(Indices, iBaseOffsetInBytes);\0D\0A    \0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[1]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[2]].color\0D\0A    };\0D\0A    float4 barycentricColor = Apply_Barycentric_Float4(triangleColorArr, attr);\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[1]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[2]].normal\0D\0A    };\0D\0A    float3 barycentricNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = barycentricNormal;\0D\0A\0D\0A    triangleNormal = mul(triangleNormal, l_ObjectCB_Dynamic.object_cb_dynamic[instanceIndex].InvTranspose).xyz;\0D\0A    triangleNormal = normalize(triangleNormal);\0D\0A#pragma endregion \EC\B6\A9\EB\8F\8C\ED\95\9C \EC\82\BC\EA\B0\81\ED\98\95 \EC\B6\94\EC\A0\81\ED\95\98\EC\97\AC \EB\B2\84\ED\85\8D\EC\8A\A4 \EC\A0\95\EB\B3\B4 \EA\B0\80\EC\A0\B8\EC\98\A4\EA\B8\B0\0D\0A\0D\0A    float3 hitWorldPosition = HitWorldPosition();\0D\0A    MyRay shadowRay = { hitWorldPosition, normalize(g_sceneCB.lightPosition.xyz - hitWorldPosition) };\0D\0A    bool shadowRayHit = TraceShadowRayAndReportIfHit(Scene_TLAS, shadowRay, payload.recursionDepth);\0D\0A        \0D\0A\0D\0A    float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A    if (cur_object_cb_static.reflectanceCoef > 0.001f)\0D\0A    {\0D\0A\09\09// Trace a reflection ray.\0D\0A        MyRay reflectionRay = { hitWorldPosition, reflect(WorldRayDirection(), triangleNormal) };\0D\0A        float4 reflectionColor = TraceRadianceRay(Scene_TLAS, reflectionRay, payload.recursionDepth);\0D\0A\0D\0A        // \EA\B8\88\EC\86\8D\EA\B0\99\EC\9D\80 \EB\AC\BC\EC\B2\B4 \EB\B0\98\EC\82\AC\0D\0A        float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), triangleNormal, barycentricColor);\0D\0A        reflectedColor = cur_object_cb_static.reflectanceCoef * float4(fresnelR, 1) * reflectionColor;\0D\0A    }\0D\0A\0D\0A\0D\0A    float4 phongColor = CalculatePhongLighting(g_sceneCB, hitWorldPosition, barycentricColor, triangleNormal, shadowRayHit);\0D\0A    float4 diffuseColor = CalculateDiffuseLighting(g_sceneCB, cur_object_cb_static.albedo, hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    //payload.color = l_ObjectCB_Static.object_cb_static[InstanceIndex()].albedo; // for debug albedo\0D\0A\0D\0A\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr);\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * phongColor;\0D\0A    payload.color += reflectedColor;\0D\0A\0D\0A   \0D\0A\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MissShader_Default(inout MyRayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A[shader(\22miss\22)]\0D\0Avoid MissShader_ShadowRay(inout ShadowRayPayload rayPayload)\0D\0A{\0D\0A    rayPayload.hit = false;\0D\0A\0D\0A}\0D\0A#endif // RAYTRACING_HLSL"}
!240 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!241 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingDefines.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_DEFINES\0D\0A#define RAYTRACING_DEFINES\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3\0D\0A#define NUM_OBJECTS 4 // TODO \EA\B0\9C\EC\88\98 TEMP\0D\0A//#define MAX_RAY_RECURSION_DEPTH 3    // ~ primary rays + reflections + shadow rays from reflected geometry.\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0A#pragma region Structs\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_STATIC\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A\0D\0A    UINT startIndex_in_IB_SRV; // Index Buffer ShaderResourceView\EC\9D\98 \EC\8B\9C\EC\9E\91 \EC\9D\B8\EB\8D\B1\EC\8A\A4\0D\0A    UINT startIndex_in_VB_SRV;\0D\0A    float reflectanceCoef;\0D\0A    float diffuseCoef;\0D\0A\0D\0A    float specularCoef;\0D\0A    float specularPower;\0D\0A    float stepScale;                      // Step scale for ray marching of signed distance primitives. \0D\0A    // - Some object transformations don't preserve the distances and \0D\0A    //   thus require shorter steps.\0D\0A    float padding;\0D\0A};\0D\0Astruct OBJECT_CB_STATIC_Arr\0D\0A{\0D\0A    OBJECT_CB_STATIC object_cb_static[NUM_OBJECTS];\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_DYNAMIC\0D\0A{\0D\0A    float4x4 InvTranspose;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_DYNAMIC_Arr\0D\0A{\0D\0A    OBJECT_CB_DYNAMIC object_cb_dynamic[NUM_OBJECTS];\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A\0D\0Astruct MyRay\0D\0A{\0D\0A    float3 origin;\0D\0A    float3 direction;\0D\0A};\0D\0Astruct MyRayPayload\0D\0A{\0D\0A    XMFLOAT4 color;\0D\0A    UINT   recursionDepth;\0D\0A};\0D\0A\0D\0Astruct ShadowRayPayload\0D\0A{\0D\0A    bool hit;\0D\0A};\0D\0A#pragma endregion Structs\0D\0A\0D\0A// Ray types traced\0D\0Anamespace RayType {\0D\0A    enum Enum {\0D\0A        Radiance = 0,   // ~ Primary, reflected camera/view rays calculating color for each hit.\0D\0A        Shadow,         // ~ Shadow/visibility rays, only testing for occlusion\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0A#pragma region Constants\0D\0Astatic const float InShadowRadiance = 0.35f;\0D\0A#pragma endregion Constants\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            1  // Shadow ray\0D\0A        };\0D\0A        static const UINT GeometryStride = RayType::Count;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            1  // Shadow ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A#endif // RAYTRACING_DEFINES"}
!242 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingFunctions.hlsli", !"#ifndef RAYTRACING_FUNCTIONS\0D\0A#define RAYTRACING_FUNCTIONS\0D\0A\0D\0A\0D\0A#include \22RaytracingDefines.h\22\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(ByteAddressBuffer Indices,uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(DXR_Scene_CB sceneCB, uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray\0D\0A    float4 world = mul(float4(screenPos, 0, 1), sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline MyRay GenerateCameraRay(int2 index, in float3 cameraPosition, in float4x4 viewProjectionInv)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A\0D\0A    MyRay ray;\0D\0A    ray.origin = cameraPosition;\0D\0A    ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(DXR_Scene_CB sceneCB, float albedo, float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return sceneCB.lightDiffuseColor * fNDotL * albedo;\0D\0A}\0D\0A\0D\0A// Diffuse lighting calculation.\0D\0Afloat CalculateDiffuseCoefficient(in float3 hitPosition, in float3 incidentLightRay, in float3 normal)\0D\0A{\0D\0A    float fNDotL = saturate(dot(-incidentLightRay, normal));\0D\0A    return fNDotL;\0D\0A}\0D\0A\0D\0A// Phong lighting specular component\0D\0Afloat4 CalculateSpecularCoefficient(in float3 hitPosition, in float3 incidentLightRay, in float3 normal, in float specularPower)\0D\0A{\0D\0A    float3 reflectedLightRay = normalize(reflect(incidentLightRay, normal));\0D\0A    return pow(saturate(dot(reflectedLightRay, normalize(-WorldRayDirection()))), specularPower);\0D\0A}\0D\0A\0D\0A\0D\0A// Phong lighting model = ambient + diffuse + specular components.\0D\0Afloat4 CalculatePhongLighting(DXR_Scene_CB sceneCB, float3 hitWorldPos, in float4 albedo, in float3 normal, in bool isInShadow, in float diffuseCoef = 1.0, in float specularCoef = 1.0, in float specularPower = 50)\0D\0A{\0D\0A    float3 lightPosition = sceneCB.lightPosition.xyz;\0D\0A\09float shadowFactor = isInShadow ? InShadowRadiance : 1.0;\0D\0A    float3 incidentLightRay = normalize(hitWorldPos - lightPosition);\0D\0A\0D\0A\09// Diffuse component.\0D\0A    float4 lightDiffuseColor = sceneCB.lightDiffuseColor;\0D\0A    float Kd = CalculateDiffuseCoefficient(hitWorldPos, incidentLightRay, normal);\0D\0A    float4 diffuseColor = shadowFactor * diffuseCoef * Kd * lightDiffuseColor * albedo;\0D\0A\0D\0A\09// Specular component.\0D\0A    float4 specularColor = float4(0, 0, 0, 0);\0D\0A    if (!isInShadow)\0D\0A    {\0D\0A        float4 lightSpecularColor = float4(1, 1, 1, 1);\0D\0A            float4 Ks = CalculateSpecularCoefficient(hitWorldPos, incidentLightRay, normal, specularPower);\0D\0A        specularColor = specularCoef * Ks * lightSpecularColor;\0D\0A    }\0D\0A\0D\0A\09// Ambient component.\0D\0A\09// Fake AO: Darken faces with normal facing downwards/away from the sky a little bit.\0D\0A    float4 ambientColor = sceneCB.lightAmbientColor;\0D\0A    float4 ambientColorMin = sceneCB.lightAmbientColor - 0.1;\0D\0A    float4 ambientColorMax = sceneCB.lightAmbientColor;\0D\0A    float a = 1 - saturate(dot(normal, float3(0, -1, 0)));\0D\0A    ambientColor = albedo * lerp(ambientColorMin, ambientColorMax, a);\0D\0A\0D\0A    return ambientColor + diffuseColor + specularColor;\0D\0A}\0D\0A\0D\0A\0D\0A// Fresnel reflectance - schlick approximation.\0D\0Afloat3 FresnelReflectanceSchlick(in float3 I, in float3 N, in float3 f0)\0D\0A{\0D\0A    float cosi = saturate(dot(-I, N));\0D\0A    return f0 + (1 - f0) * pow(1 - cosi, 5);\0D\0A}\0D\0A\0D\0A// Trace a radiance ray into the scene and returns a shaded color.\0D\0Afloat4 TraceRadianceRay(RaytracingAccelerationStructure scene, in MyRay ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return float4(0, 0, 0, 0);\0D\0A    }\0D\0A\09//----------------------\0D\0A\09// Set the ray's extents.\0D\0A\09    RayDesc rayDesc;\0D\0A\09    rayDesc.Origin = ray.origin;\0D\0A\09    rayDesc.Direction = ray.direction;\0D\0A\09// Set TMin to a zero value to avoid aliasing artifacts along contact areas.\0D\0A\09// Note: make sure to enable face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0.001;\0D\0A    rayDesc.TMax = 10000;\0D\0A    MyRayPayload rayPayload = { float4(0, 0, 0, 0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A    TraceRay(scene,\0D\0A\09\09RAY_FLAG_CULL_BACK_FACING_TRIANGLES | 0,\0D\0A\09\09TraceRayParameters::InstanceMask,\0D\0A\09\09TraceRayParameters::HitGroup::Offset[RayType::Radiance],\0D\0A\09\09TraceRayParameters::HitGroup::GeometryStride,\0D\0A\09\09TraceRayParameters::MissShader::Offset[RayType::Radiance],\0D\0A\09\09rayDesc,\0D\0A\09\09rayPayload);\0D\0A\0D\0A    return rayPayload.color;\0D\0A}\0D\0A// Trace a shadow ray and return true if it hits any geometry.\0D\0Abool TraceShadowRayAndReportIfHit(RaytracingAccelerationStructure scene, in MyRay ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return false;\0D\0A    }\0D\0A\0D\0A\09// Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A    rayDesc.Direction = ray.direction;\0D\0A\09// Set TMin to a zero value to avoid aliasing artifcats along contact areas.\0D\0A\09// Note: make sure to enable back-face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0.001f;\0D\0A    rayDesc.TMax = 10000;\0D\0A\0D\0A\09// Initialize shadow ray payload.\0D\0A\09// Set the initial value to true since closest and any hit shaders are skipped. \0D\0A\09// Shadow miss shader, if called, will set it to false.\0D\0A    ShadowRayPayload shadowPayload = { true };\0D\0A    TraceRay(scene,\0D\0A\09    RAY_FLAG_CULL_BACK_FACING_TRIANGLES\0D\0A\09    | RAY_FLAG_ACCEPT_FIRST_HIT_AND_END_SEARCH\0D\0A\09    | RAY_FLAG_FORCE_OPAQUE // ~skip any hit shaders\0D\0A\09    | RAY_FLAG_SKIP_CLOSEST_HIT_SHADER, // ~skip closest hit shaders,\0D\0A\09    TraceRayParameters::InstanceMask,\0D\0A\09    TraceRayParameters::HitGroup::Offset[RayType::Shadow],\0D\0A\09    TraceRayParameters::HitGroup::GeometryStride,\0D\0A\09    TraceRayParameters::MissShader::Offset[RayType::Shadow],\0D\0A\09    rayDesc,\0D\0A        shadowPayload);\0D\0A\0D\0A    return shadowPayload.hit;\0D\0A}\0D\0A\0D\0A#endif\0D\0A\0D\0A// About TraceRay\0D\0A// void TraceRay(RaytracingAccelerationStructure AccelerationStructure,\0D\0A//          uint RayFlags,\0D\0A//          uint InstanceInclusionMask,\0D\0A//          uint RayContributionToHitGroupIndex,\0D\0A//          uint MultiplierForGeometryContributionToHitGroupIndex, //*\0D\0A//          uint MissShaderIndex,\0D\0A//          RayDesc Ray,\0D\0A//          inout payload_t Payload);\0D\0A\0D\0A// MultiplierForGeometryContributionToHitGroupIndex\0D\0A// An unsigned integer specifying the stride to multiply by GeometryContributionToHitGroupIndex,\0D\0A// which is just the 0 based index the geometry was supplied by the app into its bottom-level acceleration structure.\0D\0A// Only the bottom 16 bits of this multiplier value are used."}
!243 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!244 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!245 = !{i32 1, i32 3}
!246 = !{i32 1, i32 6}
!247 = !{!"lib", i32 6, i32 3}
!248 = !{!249, !255, !258, null}
!249 = !{!250, !252, !253}
!250 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !251}
!251 = !{i32 0, i32 4}
!252 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!253 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !254}
!254 = !{i32 1, i32 48}
!255 = !{!256}
!256 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !257}
!257 = !{i32 0, i32 9}
!258 = !{!259, !260, !261}
!259 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!260 = !{i32 1, %l_ObjectCB_Static* @l_ObjectCB_Static, !"l_ObjectCB_Static", i32 1, i32 1, i32 1, i32 192, null}
!261 = !{i32 2, %l_ObjectCB_Dynamic* @l_ObjectCB_Dynamic, !"l_ObjectCB_Dynamic", i32 1, i32 2, i32 1, i32 256, null}
!262 = !{i32 0, %struct.ByteAddressBuffer undef, !263, %struct.BuiltInTriangleIntersectionAttributes undef, !265, %struct.DXR_Scene_CB undef, !267, %struct.RaytracingAccelerationStructure undef, !263, %struct.MyRay undef, !274, %struct.RayDesc undef, !277, %struct.MyRayPayload undef, !282, %struct.ShadowRayPayload undef, !285, %"class.RWTexture2D<vector<float, 4> >" undef, !287, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !289, %struct.VertexPositionNormalColorTexture undef, !291, %struct.OBJECT_CB_STATIC_Arr undef, !296, %struct.OBJECT_CB_STATIC undef, !298, %struct.OBJECT_CB_DYNAMIC_Arr undef, !308, %struct.OBJECT_CB_DYNAMIC undef, !310, %g_sceneCB undef, !312, %l_ObjectCB_Static undef, !314, %l_ObjectCB_Dynamic undef, !316}
!263 = !{i32 4, !264}
!264 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!265 = !{i32 8, !266}
!266 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!267 = !{i32 128, !268, !270, !271, !272, !273}
!268 = !{i32 6, !"viewProjectionInv", i32 2, !269, i32 3, i32 0, i32 7, i32 9}
!269 = !{i32 4, i32 4, i32 2}
!270 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!271 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!272 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!273 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!274 = !{i32 28, !275, !276}
!275 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!276 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!277 = !{i32 32, !278, !279, !280, !281}
!278 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!279 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!280 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!281 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!282 = !{i32 20, !283, !284}
!283 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!284 = !{i32 6, !"recursionDepth", i32 3, i32 16, i32 7, i32 5}
!285 = !{i32 4, !286}
!286 = !{i32 6, !"hit", i32 3, i32 0, i32 7, i32 1}
!287 = !{i32 16, !288}
!288 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!289 = !{i32 56, !290}
!290 = !{i32 6, !"h", i32 3, i32 0}
!291 = !{i32 56, !292, !293, !294, !295}
!292 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!293 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!294 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!295 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!296 = !{i32 192, !297}
!297 = !{i32 6, !"object_cb_static", i32 3, i32 0}
!298 = !{i32 48, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !{i32 6, !"albedo", i32 3, i32 0, i32 7, i32 9}
!300 = !{i32 6, !"startIndex_in_IB_SRV", i32 3, i32 16, i32 7, i32 5}
!301 = !{i32 6, !"startIndex_in_VB_SRV", i32 3, i32 20, i32 7, i32 5}
!302 = !{i32 6, !"reflectanceCoef", i32 3, i32 24, i32 7, i32 9}
!303 = !{i32 6, !"diffuseCoef", i32 3, i32 28, i32 7, i32 9}
!304 = !{i32 6, !"specularCoef", i32 3, i32 32, i32 7, i32 9}
!305 = !{i32 6, !"specularPower", i32 3, i32 36, i32 7, i32 9}
!306 = !{i32 6, !"stepScale", i32 3, i32 40, i32 7, i32 9}
!307 = !{i32 6, !"padding", i32 3, i32 44, i32 7, i32 9}
!308 = !{i32 256, !309}
!309 = !{i32 6, !"object_cb_dynamic", i32 3, i32 0}
!310 = !{i32 64, !311}
!311 = !{i32 6, !"InvTranspose", i32 2, !269, i32 3, i32 0, i32 7, i32 9}
!312 = !{i32 128, !313}
!313 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!314 = !{i32 192, !315}
!315 = !{i32 6, !"l_ObjectCB_Static", i32 3, i32 0}
!316 = !{i32 256, !317}
!317 = !{i32 6, !"l_ObjectCB_Dynamic", i32 3, i32 0}
!318 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !319, void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !321, void (%struct.MyRayPayload*)* @"\01?MissShader_Default@@YAXUMyRayPayload@@@Z", !324, void (%struct.ShadowRayPayload*)* @"\01?MissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", !324}
!319 = !{!320}
!320 = !{i32 1, !46, !46}
!321 = !{!320, !322, !323}
!322 = !{i32 2, !46, !46}
!323 = !{i32 0, !46, !46}
!324 = !{!320, !322}
!325 = !{null, !"", null, !248, !326}
!326 = !{i32 0, i64 65553}
!327 = !{void (%struct.MyRayPayload*)* @"\01?MissShader_Default@@YAXUMyRayPayload@@@Z", !"\01?MissShader_Default@@YAXUMyRayPayload@@@Z", null, null, !328}
!328 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !329}
!329 = !{i32 0}
!330 = !{void (%struct.ShadowRayPayload*)* @"\01?MissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", !"\01?MissShader_ShadowRay@@YAXUShadowRayPayload@@@Z", null, null, !331}
!331 = !{i32 8, i32 11, i32 6, i32 4, i32 5, !329}
!332 = !{void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !333}
!333 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !329}
!334 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !335}
!335 = !{i32 8, i32 7, i32 5, !329}
!336 = !DILocation(line: 173, column: 5, scope: !112, inlinedAt: !337)
!337 = distinct !DILocation(line: 56, column: 20, scope: !125)
!338 = !DILocation(line: 59, column: 5, scope: !125)
!339 = !DILocation(line: 52, column: 99, scope: !125)
!340 = !DILocation(line: 52, column: 59, scope: !125)
!341 = !DILocation(line: 52, column: 35, scope: !125)
!342 = !DILocation(line: 52, column: 17, scope: !125)
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewProjectionInv", arg: 3, scope: !151, file: !33, line: 58, type: !73)
!344 = !DIExpression(DW_OP_bit_piece, 0, 32)
!345 = !DILocation(line: 58, column: 82, scope: !151, inlinedAt: !346)
!346 = distinct !DILocation(line: 52, column: 17, scope: !125)
!347 = !DIExpression(DW_OP_bit_piece, 32, 32)
!348 = !DIExpression(DW_OP_bit_piece, 64, 32)
!349 = !DIExpression(DW_OP_bit_piece, 96, 32)
!350 = !DIExpression(DW_OP_bit_piece, 128, 32)
!351 = !DIExpression(DW_OP_bit_piece, 160, 32)
!352 = !DIExpression(DW_OP_bit_piece, 192, 32)
!353 = !DIExpression(DW_OP_bit_piece, 224, 32)
!354 = !DIExpression(DW_OP_bit_piece, 256, 32)
!355 = !DIExpression(DW_OP_bit_piece, 288, 32)
!356 = !DIExpression(DW_OP_bit_piece, 320, 32)
!357 = !DIExpression(DW_OP_bit_piece, 352, 32)
!358 = !DIExpression(DW_OP_bit_piece, 384, 32)
!359 = !DIExpression(DW_OP_bit_piece, 416, 32)
!360 = !DIExpression(DW_OP_bit_piece, 448, 32)
!361 = !DIExpression(DW_OP_bit_piece, 480, 32)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !151, file: !33, line: 58, type: !23)
!363 = !DILocation(line: 58, column: 54, scope: !151, inlinedAt: !346)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !151, file: !33, line: 58, type: !154)
!365 = !DILocation(line: 58, column: 37, scope: !151, inlinedAt: !346)
!366 = !DILocation(line: 60, column: 17, scope: !151, inlinedAt: !346)
!367 = !DILocation(line: 60, column: 23, scope: !151, inlinedAt: !346)
!368 = !DILocation(line: 60, column: 12, scope: !151, inlinedAt: !346)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !151, file: !33, line: 60, type: !199)
!370 = !DILocation(line: 61, column: 29, scope: !151, inlinedAt: !346)
!371 = !DILocation(line: 61, column: 27, scope: !151, inlinedAt: !346)
!372 = !DILocation(line: 61, column: 57, scope: !151, inlinedAt: !346)
!373 = !DILocation(line: 61, column: 63, scope: !151, inlinedAt: !346)
!374 = !DILocation(line: 61, column: 12, scope: !151, inlinedAt: !346)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !151, file: !33, line: 61, type: !199)
!376 = !DILocation(line: 64, column: 19, scope: !151, inlinedAt: !346)
!377 = !DILocation(line: 64, column: 17, scope: !151, inlinedAt: !346)
!378 = !DILocation(line: 67, column: 20, scope: !151, inlinedAt: !346)
!379 = !DILocation(line: 67, column: 12, scope: !151, inlinedAt: !346)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !151, file: !33, line: 67, type: !11)
!381 = !DILocation(line: 68, column: 15, scope: !151, inlinedAt: !346)
!382 = !DILocation(line: 71, column: 16, scope: !151, inlinedAt: !346)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 0, scope: !151, file: !33, line: 70, type: !116)
!384 = !DILocation(line: 70, column: 11, scope: !151, inlinedAt: !346)
!385 = !DILocation(line: 72, column: 41, scope: !151, inlinedAt: !346)
!386 = !DILocation(line: 72, column: 21, scope: !151, inlinedAt: !346)
!387 = !DILocation(line: 72, column: 19, scope: !151, inlinedAt: !346)
!388 = !DILocation(line: 74, column: 5, scope: !151, inlinedAt: !346)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 2, scope: !112, file: !33, line: 156, type: !116)
!390 = !DILocation(line: 156, column: 73, scope: !112, inlinedAt: !337)
!391 = !DILocation(line: 55, column: 10, scope: !125)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !125, file: !1, line: 55, type: !120)
!393 = !DIExpression()
!394 = !DILocation(line: 56, column: 20, scope: !125)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 3, scope: !112, file: !33, line: 156, type: !120)
!396 = !DILocation(line: 156, column: 86, scope: !112, inlinedAt: !337)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scene", arg: 1, scope: !112, file: !33, line: 156, type: !115)
!398 = !DILocation(line: 156, column: 57, scope: !112, inlinedAt: !337)
!399 = !DILocation(line: 158, column: 9, scope: !112, inlinedAt: !337)
!400 = !DILocation(line: 165, column: 14, scope: !112, inlinedAt: !337)
!401 = !DILocation(line: 165, column: 21, scope: !112, inlinedAt: !337)
!402 = !DILocation(line: 166, column: 14, scope: !112, inlinedAt: !337)
!403 = !DILocation(line: 166, column: 24, scope: !112, inlinedAt: !337)
!404 = !DILocation(line: 169, column: 13, scope: !112, inlinedAt: !337)
!405 = !DILocation(line: 169, column: 18, scope: !112, inlinedAt: !337)
!406 = !DILocation(line: 170, column: 13, scope: !112, inlinedAt: !337)
!407 = !DILocation(line: 170, column: 18, scope: !112, inlinedAt: !337)
!408 = !DILocation(line: 171, column: 31, scope: !112, inlinedAt: !337)
!409 = !DILocation(line: 171, column: 78, scope: !112, inlinedAt: !337)
!410 = !DILocation(line: 182, column: 23, scope: !112, inlinedAt: !337)
!411 = !DILocation(line: 182, column: 5, scope: !112, inlinedAt: !337)
!412 = !DILocation(line: 183, column: 1, scope: !112, inlinedAt: !337)
!413 = !DILocation(line: 56, column: 12, scope: !125)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !125, file: !1, line: 56, type: !11)
!415 = !DILocation(line: 59, column: 19, scope: !125)
!416 = !DILocation(line: 59, column: 43, scope: !125)
!417 = !DILocation(line: 60, column: 1, scope: !125)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !112, file: !33, line: 164, type: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 164, size: 256, align: 32, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !419, file: !1, line: 164, baseType: !24, size: 96, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !419, file: !1, line: 164, baseType: !15, size: 32, align: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !419, file: !1, line: 164, baseType: !24, size: 96, align: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !419, file: !1, line: 164, baseType: !15, size: 32, align: 32, offset: 224)
!425 = !DILocation(line: 164, column: 14, scope: !112, inlinedAt: !337)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !112, file: !33, line: 171, type: !135)
!427 = !DILocation(line: 171, column: 18, scope: !112, inlinedAt: !337)
!428 = !DILocation(line: 84, column: 9, scope: !131)
!429 = !DILocation(line: 23, column: 36, scope: !32, inlinedAt: !430)
!430 = distinct !DILocation(line: 80, column: 28, scope: !131)
!431 = !DILocation(line: 173, column: 5, scope: !112, inlinedAt: !432)
!432 = distinct !DILocation(line: 114, column: 34, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 111, column: 5)
!434 = distinct !DILexicalBlock(scope: !131, file: !1, line: 110, column: 9)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !131, file: !1, line: 68, type: !140)
!436 = !DILocation(line: 68, column: 69, scope: !131)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !131, file: !1, line: 68, type: !135)
!438 = !DILocation(line: 68, column: 44, scope: !131)
!439 = !DILocation(line: 70, column: 26, scope: !131)
!440 = !DILocation(line: 70, column: 10, scope: !131)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instanceIndex", scope: !131, file: !1, line: 70, type: !47)
!442 = !DILocation(line: 71, column: 45, scope: !131)
!443 = !DILocation(line: 73, column: 10, scope: !131)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !131, file: !1, line: 73, type: !47)
!445 = !DILocation(line: 74, column: 57, scope: !131)
!446 = !DILocation(line: 74, column: 10, scope: !131)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStrideInBytes", scope: !131, file: !1, line: 74, type: !47)
!448 = !DILocation(line: 75, column: 53, scope: !131)
!449 = !DILocation(line: 75, column: 74, scope: !131)
!450 = !DILocation(line: 75, column: 80, scope: !131)
!451 = !DILocation(line: 75, column: 78, scope: !131)
!452 = !DILocation(line: 76, column: 6, scope: !131)
!453 = !DILocation(line: 75, column: 10, scope: !131)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseOffsetInBytes", scope: !131, file: !1, line: 75, type: !47)
!455 = !DILocation(line: 78, column: 54, scope: !131)
!456 = !DILocation(line: 78, column: 10, scope: !131)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startIndex_in_VB_SRV", scope: !131, file: !1, line: 78, type: !47)
!458 = !DILocation(line: 80, column: 28, scope: !131)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 2, scope: !32, file: !33, line: 9, type: !47)
!460 = !DILocation(line: 9, column: 57, scope: !32, inlinedAt: !430)
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Indices", arg: 1, scope: !32, file: !33, line: 9, type: !45)
!462 = !DILocation(line: 9, column: 44, scope: !32, inlinedAt: !430)
!463 = !DILocation(line: 20, column: 49, scope: !32, inlinedAt: !430)
!464 = !DILocation(line: 20, column: 16, scope: !32, inlinedAt: !430)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !32, file: !33, line: 20, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !32, file: !33, line: 23, type: !468)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !471, templateParams: !474)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !470, file: !1, line: 23, baseType: !40, size: 32, align: 32, flags: DIFlagPublic)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !470, file: !1, line: 23, baseType: !40, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!474 = !{!44, !62}
!475 = !DILocation(line: 23, column: 17, scope: !32, inlinedAt: !430)
!476 = !DILocation(line: 26, column: 28, scope: !477, inlinedAt: !430)
!477 = distinct !DILexicalBlock(scope: !32, file: !33, line: 26, column: 9)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !122, file: !33, line: 193, type: !419)
!479 = !DILocation(line: 193, column: 13, scope: !122, inlinedAt: !480)
!480 = distinct !DILocation(line: 106, column: 25, scope: !131)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadowPayload", scope: !122, file: !33, line: 204, type: !148)
!482 = !DILocation(line: 204, column: 22, scope: !122, inlinedAt: !480)
!483 = !DILocation(line: 164, column: 14, scope: !112, inlinedAt: !432)
!484 = !DILocation(line: 171, column: 18, scope: !112, inlinedAt: !432)
!485 = !DILocation(line: 26, column: 9, scope: !32, inlinedAt: !430)
!486 = !DILocation(line: 28, column: 40, scope: !487, inlinedAt: !430)
!487 = distinct !DILexicalBlock(scope: !477, file: !33, line: 27, column: 5)
!488 = !DILocation(line: 28, column: 19, scope: !487, inlinedAt: !430)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !32, file: !33, line: 11, type: !36)
!490 = !DILocation(line: 11, column: 11, scope: !32, inlinedAt: !430)
!491 = !DILocation(line: 29, column: 41, scope: !487, inlinedAt: !430)
!492 = !DILocation(line: 29, column: 48, scope: !487, inlinedAt: !430)
!493 = !DILocation(line: 29, column: 19, scope: !487, inlinedAt: !430)
!494 = !DILocation(line: 30, column: 40, scope: !487, inlinedAt: !430)
!495 = !DILocation(line: 30, column: 19, scope: !487, inlinedAt: !430)
!496 = !DILocation(line: 31, column: 5, scope: !487, inlinedAt: !430)
!497 = !DILocation(line: 34, column: 41, scope: !498, inlinedAt: !430)
!498 = distinct !DILexicalBlock(scope: !477, file: !33, line: 33, column: 5)
!499 = !DILocation(line: 34, column: 48, scope: !498, inlinedAt: !430)
!500 = !DILocation(line: 34, column: 19, scope: !498, inlinedAt: !430)
!501 = !DILocation(line: 35, column: 40, scope: !498, inlinedAt: !430)
!502 = !DILocation(line: 35, column: 19, scope: !498, inlinedAt: !430)
!503 = !DILocation(line: 36, column: 41, scope: !498, inlinedAt: !430)
!504 = !DILocation(line: 36, column: 48, scope: !498, inlinedAt: !430)
!505 = !DILocation(line: 36, column: 19, scope: !498, inlinedAt: !430)
!506 = !DILocation(line: 39, column: 5, scope: !32, inlinedAt: !430)
!507 = !DILocation(line: 80, column: 17, scope: !131)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices3", scope: !131, file: !1, line: 80, type: !509)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!510 = !DILocation(line: 83, column: 5, scope: !131)
!511 = !DILocation(line: 84, column: 39, scope: !131)
!512 = !DILocation(line: 84, column: 54, scope: !131)
!513 = !DILocation(line: 85, column: 39, scope: !131)
!514 = !DILocation(line: 85, column: 9, scope: !131)
!515 = !DILocation(line: 85, column: 54, scope: !131)
!516 = !DILocation(line: 86, column: 39, scope: !131)
!517 = !DILocation(line: 86, column: 9, scope: !131)
!518 = !DILocation(line: 86, column: 54, scope: !131)
!519 = !DILocation(line: 88, column: 31, scope: !131)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !48, file: !33, line: 78, type: !54)
!521 = !DILocation(line: 78, column: 98, scope: !48, inlinedAt: !522)
!522 = distinct !DILocation(line: 88, column: 31, scope: !131)
!523 = !DILocation(line: 80, column: 12, scope: !48, inlinedAt: !522)
!524 = !DILocation(line: 81, column: 14, scope: !48, inlinedAt: !522)
!525 = !DILocation(line: 81, column: 9, scope: !48, inlinedAt: !522)
!526 = !DILocation(line: 81, column: 32, scope: !48, inlinedAt: !522)
!527 = !DILocation(line: 81, column: 53, scope: !48, inlinedAt: !522)
!528 = !DILocation(line: 81, column: 51, scope: !48, inlinedAt: !522)
