#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 9e95860e1f9cba649e8ea83b4555029d.pdb
; shader hash: 9e95860e1f9cba649e8ea83b4555029d
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer l_ObjectCB
; {
;
;   struct l_ObjectCB
;   {
;
;       struct struct.OBJECT_CB_STATIC_Arr
;       {
;
;           struct struct.OBJECT_CB_STATIC
;           {
;
;               uint startIndex_in_IB_SRV;            ; Offset:    0
;               uint startIndex_in_VB_SRV;            ; Offset:    4
;               float2 padding;                       ; Offset:    8
;               float4 albedo;                        ; Offset:   16
;           
;           } object_cb_static[2];;                   ; Offset:    0
;
;       
;       } l_ObjectCB;                                 ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !85)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 49, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 49, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !46, !57, !60, !63, !71, !74}
!17 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 18, type: !18, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !24)
!31 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 67, type: !32, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!4, !34, !37}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 3)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 49, size: 64, align: 32, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !37, file: !1, line: 49, baseType: !40, size: 64, align: 32)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 49, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!46 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 73, type: !47, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !56, !37}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 72, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 72, size: 96, align: 32, elements: !51, templateParams: !55)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 72, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 72, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !1, line: 72, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !{!13, !29}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 288, align: 32, elements: !35)
!57 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 80, type: !58, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!4, !49, !49}
!60 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 97, type: !61, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 123, type: !64, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !70}
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 90, size: 128, align: 32, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !67, file: !1, line: 92, baseType: !4, size: 128, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 89, baseType: !37)
!71 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 163, type: !72, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!72 = !DISubroutineType(types: !73)
!73 = !{null, !66}
!74 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 51, type: !75, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !83, !83}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 32, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 32, size: 64, align: 32, elements: !79, templateParams: !82)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !1, line: 32, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !1, line: 32, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !{!28, !45}
!83 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !49)
!85 = !{!86, !88, !92, !94, !106, !139}
!86 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !87, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 8, size: 32, align: 32, elements: !2)
!88 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !89, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !2, templateParams: !90)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "element", type: !5)
!92 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !93, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 10, size: 32, align: 32, elements: !2)
!94 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !95, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "element", type: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !99, line: 44, size: 384, align: 32, elements: !100)
!99 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !98, file: !99, line: 46, baseType: !49, size: 96, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !98, file: !99, line: 47, baseType: !49, size: 96, align: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !98, file: !99, line: 48, baseType: !4, size: 128, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !98, file: !99, line: 49, baseType: !105, size: 64, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !40)
!106 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 12, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 12, size: 32, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !99, line: 23, size: 1024, align: 32, elements: !111)
!111 = !{!112, !135, !136, !137, !138}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !110, file: !99, line: 25, baseType: !113, size: 512, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 12, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 12, size: 512, align: 32, elements: !115, templateParams: !132)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !114, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!132 = !{!13, !133, !134}
!133 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!134 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !110, file: !99, line: 26, baseType: !4, size: 128, align: 32, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !110, file: !99, line: 27, baseType: !4, size: 128, align: 32, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !110, file: !99, line: 28, baseType: !4, size: 128, align: 32, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !110, file: !99, line: 29, baseType: !4, size: 128, align: 32, offset: 896)
!139 = !DIGlobalVariable(name: "l_ObjectCB", linkageName: "\01?l_ObjectCB@@3U?$ConstantBuffer@UOBJECT_CB_STATIC_Arr@@@@A", scope: !0, file: !1, line: 15, type: !140, isLocal: false, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_STATIC_Arr>", file: !1, line: 15, size: 32, align: 32, elements: !2, templateParams: !141)
!141 = !{!142}
!142 = !DITemplateTypeParameter(name: "T", type: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC_Arr", file: !99, line: 39, size: 512, align: 32, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_static", scope: !143, file: !99, line: 41, baseType: !146, size: 512, align: 32)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, align: 32, elements: !156)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC", file: !99, line: 32, size: 256, align: 32, elements: !148)
!148 = !{!149, !152, !153, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_IB_SRV", scope: !147, file: !99, line: 34, baseType: !150, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !151, line: 19, baseType: !30)
!151 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_VB_SRV", scope: !147, file: !99, line: 35, baseType: !150, size: 32, align: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !147, file: !99, line: 36, baseType: !105, size: 64, align: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !147, file: !99, line: 37, baseType: !155, size: 128, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !151, line: 16, baseType: !4)
!156 = !{!157}
!157 = !DISubrange(count: 2)
!158 = !{i32 2, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!161 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// Local RootSig\0D\0AConstantBuffer<OBJECT_CB_STATIC_Arr> l_ObjectCB : register(b1, space1);\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray\0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(g_sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return g_sceneCB.lightDiffuseColor * fNDotL; // TODO : LocalRootSig\EC\9D\98 \EC\98\A4\EB\B8\8C\EC\A0\9D\ED\8A\B8 \EC\95\8C\EB\B2\A0\EB\8F\84 \EC\A0\81\EC\9A\A9\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A    \0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    //TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStrideInBytes = indexSizeInBytes * 3;\0D\0A    uint iBaseOffsetInBytes = (l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_IB_SRV / 3 + PrimitiveIndex())\0D\0A     * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A    //uint iBaseOffsetInBytes = (12)\0D\0A    // * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A    \0D\0A    uint startIndex_in_VB_SRV = l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_VB_SRV; //0 or 24\0D\0A    const uint3 indices3 = Load3x16BitIndices(iBaseOffsetInBytes);\0D\0A    \0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[1]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[2]].color\0D\0A    };\0D\0A\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[1]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[2]].normal\0D\0A    };\0D\0A\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A\0D\0A    \0D\0A    float4 diffuseColor = CalculateDiffuseLighting(hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    //payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr);\0D\0A\0D\0A    //payload.color = l_ObjectCB.object_cb_static[InstanceIndex()].albedo; // for debug albedo\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!162 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!163 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_STATIC\0D\0A{\0D\0A    UINT startIndex_in_IB_SRV; // Index Buffer ShaderResourceView\EC\9D\98 \EC\8B\9C\EC\9E\91 \EC\9D\B8\EB\8D\B1\EC\8A\A4\0D\0A    UINT startIndex_in_VB_SRV;\0D\0A    float2 padding;\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0Astruct OBJECT_CB_STATIC_Arr\0D\0A{\0D\0A    OBJECT_CB_STATIC object_cb_static[2]; // TODO \EA\B0\9C\EC\88\98 TEMP\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A//typedef Vertex VertexPositionNormalColorTexture;\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!164 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!165 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!166 = !{i32 1, i32 3}
!167 = !{i32 1, i32 6}
!168 = !{!"lib", i32 6, i32 3}
!169 = !{!170, !176, !179, null}
!170 = !{!171, !173, !174}
!171 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !172}
!172 = !{i32 0, i32 4}
!173 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!174 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !175}
!175 = !{i32 1, i32 48}
!176 = !{!177}
!177 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !178}
!178 = !{i32 0, i32 9}
!179 = !{!180, !181}
!180 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!181 = !{i32 1, %l_ObjectCB* @l_ObjectCB, !"l_ObjectCB", i32 1, i32 1, i32 1, i32 64, null}
!182 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !183, %"class.RWTexture2D<vector<float, 4> >" undef, !185, %struct.ByteAddressBuffer undef, !183, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !187, %struct.VertexPositionNormalColorTexture undef, !189, %struct.DXR_Scene_CB undef, !194, %struct.OBJECT_CB_STATIC_Arr undef, !201, %struct.OBJECT_CB_STATIC undef, !203, %struct.BuiltInTriangleIntersectionAttributes undef, !208, %struct.RayDesc undef, !210, %struct.RayPayload undef, !215, %g_sceneCB undef, !217, %l_ObjectCB undef, !219}
!183 = !{i32 4, !184}
!184 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!185 = !{i32 16, !186}
!186 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!187 = !{i32 56, !188}
!188 = !{i32 6, !"h", i32 3, i32 0}
!189 = !{i32 56, !190, !191, !192, !193}
!190 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!191 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!192 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!193 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!194 = !{i32 128, !195, !197, !198, !199, !200}
!195 = !{i32 6, !"viewProjectionInv", i32 2, !196, i32 3, i32 0, i32 7, i32 9}
!196 = !{i32 4, i32 4, i32 2}
!197 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!198 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!199 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!200 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!201 = !{i32 64, !202}
!202 = !{i32 6, !"object_cb_static", i32 3, i32 0}
!203 = !{i32 32, !204, !205, !206, !207}
!204 = !{i32 6, !"startIndex_in_IB_SRV", i32 3, i32 0, i32 7, i32 5}
!205 = !{i32 6, !"startIndex_in_VB_SRV", i32 3, i32 4, i32 7, i32 5}
!206 = !{i32 6, !"padding", i32 3, i32 8, i32 7, i32 9}
!207 = !{i32 6, !"albedo", i32 3, i32 16, i32 7, i32 9}
!208 = !{i32 8, !209}
!209 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!210 = !{i32 32, !211, !212, !213, !214}
!211 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!212 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!213 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!214 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!215 = !{i32 16, !216}
!216 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!217 = !{i32 128, !218}
!218 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!219 = !{i32 64, !220}
!220 = !{i32 6, !"l_ObjectCB", i32 3, i32 0}
!221 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !222, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !224, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !227}
!222 = !{!223}
!223 = !{i32 1, !2, !2}
!224 = !{!223, !225, !226}
!225 = !{i32 2, !2, !2}
!226 = !{i32 0, !2, !2}
!227 = !{!223, !225}
!228 = !{null, !"", null, !169, !229}
!229 = !{i32 0, i64 65553}
!230 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !231}
!231 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !232}
!232 = !{i32 0}
!233 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !234}
!234 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !232}
!235 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !236}
!236 = !{i32 8, i32 7, i32 5, !232}
!237 = !DILocation(line: 116, column: 5, scope: !60)
!238 = !DILocation(line: 119, column: 5, scope: !60)
!239 = !DILocation(line: 103, column: 23, scope: !60)
!240 = !DILocation(line: 103, column: 5, scope: !60)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !74, file: !1, line: 51, type: !77)
!242 = !DIExpression(DW_OP_bit_piece, 0, 32)
!243 = !DILocation(line: 51, column: 37, scope: !74, inlinedAt: !244)
!244 = distinct !DILocation(line: 103, column: 5, scope: !60)
!245 = !DIExpression(DW_OP_bit_piece, 32, 32)
!246 = !DILocation(line: 53, column: 17, scope: !74, inlinedAt: !244)
!247 = !DILocation(line: 53, column: 23, scope: !74, inlinedAt: !244)
!248 = !DILocation(line: 53, column: 12, scope: !74, inlinedAt: !244)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !74, file: !1, line: 53, type: !105)
!250 = !DILocation(line: 54, column: 29, scope: !74, inlinedAt: !244)
!251 = !DILocation(line: 54, column: 27, scope: !74, inlinedAt: !244)
!252 = !DILocation(line: 54, column: 57, scope: !74, inlinedAt: !244)
!253 = !DILocation(line: 54, column: 63, scope: !74, inlinedAt: !244)
!254 = !DILocation(line: 54, column: 12, scope: !74, inlinedAt: !244)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !74, file: !1, line: 54, type: !105)
!256 = !DILocation(line: 57, column: 19, scope: !74, inlinedAt: !244)
!257 = !DILocation(line: 57, column: 17, scope: !74, inlinedAt: !244)
!258 = !DILocation(line: 60, column: 59, scope: !74, inlinedAt: !244)
!259 = !DILocation(line: 60, column: 20, scope: !74, inlinedAt: !244)
!260 = !DILocation(line: 60, column: 12, scope: !74, inlinedAt: !244)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !74, file: !1, line: 60, type: !4)
!262 = !DIExpression(DW_OP_bit_piece, 64, 32)
!263 = !DIExpression(DW_OP_bit_piece, 96, 32)
!264 = !DILocation(line: 61, column: 15, scope: !74, inlinedAt: !244)
!265 = !DILocation(line: 62, column: 14, scope: !74, inlinedAt: !244)
!266 = !DILocation(line: 62, column: 12, scope: !74, inlinedAt: !244)
!267 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !74, file: !1, line: 51, type: !49)
!268 = !DILocation(line: 51, column: 55, scope: !74, inlinedAt: !244)
!269 = !DILocation(line: 63, column: 37, scope: !74, inlinedAt: !244)
!270 = !DILocation(line: 63, column: 17, scope: !74, inlinedAt: !244)
!271 = !DILocation(line: 63, column: 15, scope: !74, inlinedAt: !244)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !74, file: !1, line: 51, type: !49)
!273 = !DILocation(line: 51, column: 74, scope: !74, inlinedAt: !244)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !60, file: !1, line: 99, type: !49)
!275 = !DILocation(line: 99, column: 12, scope: !60)
!276 = !DILocation(line: 64, column: 1, scope: !74, inlinedAt: !244)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !60, file: !1, line: 100, type: !49)
!278 = !DILocation(line: 100, column: 12, scope: !60)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !60, file: !1, line: 107, type: !280)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 107, size: 256, align: 32, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !280, file: !1, line: 107, baseType: !50, size: 96, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !280, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !280, file: !1, line: 107, baseType: !50, size: 96, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !280, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 224)
!286 = !DIExpression()
!287 = !DILocation(line: 107, column: 13, scope: !60)
!288 = !DILocation(line: 108, column: 9, scope: !60)
!289 = !DILocation(line: 108, column: 16, scope: !60)
!290 = !DILocation(line: 109, column: 9, scope: !60)
!291 = !DILocation(line: 109, column: 19, scope: !60)
!292 = !DILocation(line: 112, column: 9, scope: !60)
!293 = !DILocation(line: 112, column: 14, scope: !60)
!294 = !DILocation(line: 113, column: 9, scope: !60)
!295 = !DILocation(line: 113, column: 14, scope: !60)
!296 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !60, file: !1, line: 114, type: !67)
!297 = !DILocation(line: 114, column: 16, scope: !60)
!298 = !DILocation(line: 114, column: 26, scope: !60)
!299 = !DILocation(line: 119, column: 53, scope: !60)
!300 = !DILocation(line: 119, column: 19, scope: !60)
!301 = !DILocation(line: 119, column: 43, scope: !60)
!302 = !DILocation(line: 120, column: 1, scope: !60)
!303 = !DILocation(line: 137, column: 9, scope: !63)
!304 = !DILocation(line: 32, column: 36, scope: !17, inlinedAt: !305)
!305 = distinct !DILocation(line: 133, column: 28, scope: !63)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !63, file: !1, line: 123, type: !70)
!307 = !DILocation(line: 123, column: 67, scope: !63)
!308 = !DILocation(line: 125, column: 10, scope: !63)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !63, file: !1, line: 125, type: !30)
!310 = !DILocation(line: 126, column: 57, scope: !63)
!311 = !DILocation(line: 126, column: 10, scope: !63)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStrideInBytes", scope: !63, file: !1, line: 126, type: !30)
!313 = !DILocation(line: 127, column: 60, scope: !63)
!314 = !DILocation(line: 127, column: 77, scope: !63)
!315 = !DILocation(line: 127, column: 98, scope: !63)
!316 = !DILocation(line: 127, column: 104, scope: !63)
!317 = !DILocation(line: 127, column: 102, scope: !63)
!318 = !DILocation(line: 128, column: 6, scope: !63)
!319 = !DILocation(line: 127, column: 10, scope: !63)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseOffsetInBytes", scope: !63, file: !1, line: 127, type: !30)
!321 = !DILocation(line: 132, column: 61, scope: !63)
!322 = !DILocation(line: 132, column: 78, scope: !63)
!323 = !DILocation(line: 132, column: 10, scope: !63)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startIndex_in_VB_SRV", scope: !63, file: !1, line: 132, type: !30)
!325 = !DILocation(line: 133, column: 28, scope: !63)
!326 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !17, file: !1, line: 18, type: !30)
!327 = !DILocation(line: 18, column: 31, scope: !17, inlinedAt: !305)
!328 = !DILocation(line: 29, column: 49, scope: !17, inlinedAt: !305)
!329 = !DILocation(line: 29, column: 16, scope: !17, inlinedAt: !305)
!330 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !17, file: !1, line: 29, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !17, file: !1, line: 32, type: !333)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!334 = !DILocation(line: 32, column: 17, scope: !17, inlinedAt: !305)
!335 = !DILocation(line: 35, column: 28, scope: !336, inlinedAt: !305)
!336 = distinct !DILexicalBlock(scope: !17, file: !1, line: 35, column: 9)
!337 = !DILocation(line: 35, column: 9, scope: !17, inlinedAt: !305)
!338 = !DILocation(line: 37, column: 40, scope: !339, inlinedAt: !305)
!339 = distinct !DILexicalBlock(scope: !336, file: !1, line: 36, column: 5)
!340 = !DILocation(line: 37, column: 19, scope: !339, inlinedAt: !305)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !17, file: !1, line: 20, type: !20)
