#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 2fa81b0a723047494b043025883f806b.pdb
; shader hash: 2fa81b0a723047494b043025883f806b
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RayGenConstantBuffer
;       {
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:    0
;               float top;                            ; Offset:    4
;               float right;                          ; Offset:    8
;               float bottom;                         ; Offset:   12
;           
;           } viewport;                               ; Offset:    0
;
;           struct struct.Viewport
;           {
;
;               float left;                           ; Offset:   16
;               float top;                            ; Offset:   20
;               float right;                          ; Offset:   24
;               float bottom;                         ; Offset:   28
;           
;           } stencil;                                ; Offset:   16
;
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    32
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !60)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 39, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 39, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 56, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 56, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 56, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !43, !46, !57}
!32 = !DISubprogram(name: "IsInsideViewport", linkageName: "\01?IsInsideViewport@@YA_NV?$vector@M$01@@UViewport@@@Z", scope: !1, file: !1, line: 27, type: !33, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !4, !36}
!35 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Viewport", file: !37, line: 15, size: 128, align: 32, elements: !38)
!37 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !36, file: !37, line: 17, baseType: !8, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !36, file: !37, line: 18, baseType: !8, size: 32, align: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !36, file: !37, line: 19, baseType: !8, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !36, file: !37, line: 20, baseType: !8, size: 32, align: 32, offset: 96)
!43 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 34, type: !44, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!44 = !DISubroutineType(types: !45)
!45 = !{null}
!46 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 70, type: !47, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49, !53}
!49 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 22, size: 128, align: 32, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !50, file: !1, line: 24, baseType: !22, size: 128, align: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 21, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 67, size: 64, align: 32, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !54, file: !1, line: 67, baseType: !5, size: 64, align: 32)
!57 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 77, type: !58, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !49}
!60 = !{!61, !64, !66, !70}
!61 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 57, type: !62, isLocal: true, isDefinition: true, variable: i32 16)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!64 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 17, type: !65, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 17, size: 32, align: 32, elements: !2)
!66 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !67, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 18, size: 128, align: 32, elements: !2, templateParams: !68)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "element", type: !23)
!70 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@@3U?$ConstantBuffer@URayGenConstantBuffer@@@@A", scope: !0, file: !1, line: 19, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<RayGenConstantBuffer>", file: !1, line: 19, size: 32, align: 32, elements: !2, templateParams: !72)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayGenConstantBuffer", file: !37, line: 23, size: 256, align: 32, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "viewport", scope: !74, file: !37, line: 25, baseType: !36, size: 128, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !74, file: !37, line: 26, baseType: !36, size: 128, align: 32, offset: 128)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!81 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RayGenConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Abool IsInsideViewport(float2 p, Viewport viewport)\0D\0A{\0D\0A    return (p.x >= viewport.left && p.x <= viewport.right)\0D\0A        && (p.y >= viewport.top && p.y <= viewport.bottom);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2)DispatchRaysIndex() / (float2)DispatchRaysDimensions();\0D\0A\0D\0A    // Orthographic projection since we're raytracing in screen space.\0D\0A    float3 rayDir = float3(0, 0, 1);\0D\0A    float3 origin = float3(\0D\0A        lerp(g_rayGenCB.viewport.left, g_rayGenCB.viewport.right, lerpValues.x),\0D\0A        lerp(g_rayGenCB.viewport.top, g_rayGenCB.viewport.bottom, lerpValues.y),\0D\0A        0.0f);\0D\0A\0D\0A    if (IsInsideViewport(origin.xy, g_rayGenCB.stencil))\0D\0A    {\0D\0A        // Trace the ray.\0D\0A        // Set the ray's extents.\0D\0A        RayDesc ray;\0D\0A        ray.Origin = origin;\0D\0A        ray.Direction = rayDir;\0D\0A        // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A        // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A        ray.TMin = 0.001;\0D\0A        ray.TMax = 10000.0;\0D\0A        RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A        TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A        // Write the raytraced color to the output texture.\0D\0A        RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        // Render interpolated DispatchRaysIndex outside the stencil window\0D\0A        RenderTarget[DispatchRaysIndex().xy] = float4(lerpValues, 0, 1);\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    payload.color = float4(barycentrics, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4(0, 0, 0, 1);\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!82 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0Astruct Viewport\0D\0A{\0D\0A    float left;\0D\0A    float top;\0D\0A    float right;\0D\0A    float bottom;\0D\0A};\0D\0A\0D\0Astruct RayGenConstantBuffer\0D\0A{\0D\0A    Viewport viewport;\0D\0A    Viewport stencil;\0D\0A};\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!83 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!84 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!85 = !{i32 1, i32 3}
!86 = !{i32 1, i32 6}
!87 = !{!"lib", i32 6, i32 3}
!88 = !{!89, !92, !95, null}
!89 = !{!90}
!90 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !91}
!91 = !{i32 0, i32 4}
!92 = !{!93}
!93 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !94}
!94 = !{i32 0, i32 9}
!95 = !{!96}
!96 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 32, null}
!97 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !98, %"class.RWTexture2D<vector<float, 4> >" undef, !100, %struct.RayGenConstantBuffer undef, !102, %struct.Viewport undef, !105, %struct.RayDesc undef, !110, %struct.RayPayload undef, !115, %struct.BuiltInTriangleIntersectionAttributes undef, !117, %g_rayGenCB undef, !119}
!98 = !{i32 4, !99}
!99 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!100 = !{i32 16, !101}
!101 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!102 = !{i32 32, !103, !104}
!103 = !{i32 6, !"viewport", i32 3, i32 0}
!104 = !{i32 6, !"stencil", i32 3, i32 16}
!105 = !{i32 16, !106, !107, !108, !109}
!106 = !{i32 6, !"left", i32 3, i32 0, i32 7, i32 9}
!107 = !{i32 6, !"top", i32 3, i32 4, i32 7, i32 9}
!108 = !{i32 6, !"right", i32 3, i32 8, i32 7, i32 9}
!109 = !{i32 6, !"bottom", i32 3, i32 12, i32 7, i32 9}
!110 = !{i32 32, !111, !112, !113, !114}
!111 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!112 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!113 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!114 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!115 = !{i32 16, !116}
!116 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!117 = !{i32 8, !118}
!118 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!119 = !{i32 32, !120}
!120 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!121 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !122, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !124, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !127}
!122 = !{!123}
!123 = !{i32 1, !2, !2}
!124 = !{!123, !125, !126}
!125 = !{i32 2, !2, !2}
!126 = !{i32 0, !2, !2}
!127 = !{!123, !125}
!128 = !{null, !"", null, !88, !129}
!129 = !{i32 0, i64 65537}
!130 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !131}
!131 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !132}
!132 = !{i32 0}
!133 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !134}
!134 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !132}
!135 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !136}
!136 = !{i32 8, i32 7, i32 5, !132}
!137 = !DILocation(line: 57, column: 9, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 46, column: 5)
!139 = distinct !DILexicalBlock(scope: !43, file: !1, line: 45, column: 9)
!140 = !DILocation(line: 60, column: 9, scope: !138)
!141 = !DILocation(line: 36, column: 33, scope: !43)
!142 = !DILocation(line: 36, column: 63, scope: !43)
!143 = !DILocation(line: 36, column: 53, scope: !43)
!144 = !DILocation(line: 36, column: 12, scope: !43)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !43, file: !1, line: 36, type: !4)
!146 = !DIExpression(DW_OP_bit_piece, 0, 32)
!147 = !DIExpression(DW_OP_bit_piece, 32, 32)
!148 = !DILocation(line: 39, column: 12, scope: !43)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !43, file: !1, line: 39, type: !14)
!150 = !DIExpression()
!151 = !DILocation(line: 41, column: 60, scope: !43)
!152 = !DILocation(line: 41, column: 34, scope: !43)
!153 = !DILocation(line: 41, column: 9, scope: !43)
!154 = !DILocation(line: 42, column: 59, scope: !43)
!155 = !DILocation(line: 42, column: 34, scope: !43)
!156 = !DILocation(line: 42, column: 9, scope: !43)
!157 = !DILocation(line: 40, column: 12, scope: !43)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !43, file: !1, line: 40, type: !14)
!159 = !DIExpression(DW_OP_bit_piece, 64, 32)
!160 = !DILocation(line: 45, column: 9, scope: !139)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !32, file: !1, line: 27, type: !4)
!162 = !DILocation(line: 27, column: 30, scope: !32, inlinedAt: !163)
!163 = distinct !DILocation(line: 45, column: 9, scope: !139)
!164 = !DILocation(line: 29, column: 29, scope: !32, inlinedAt: !163)
!165 = !DILocation(line: 29, column: 17, scope: !32, inlinedAt: !163)
!166 = !DILocation(line: 29, column: 53, scope: !32, inlinedAt: !163)
!167 = !DILocation(line: 29, column: 41, scope: !32, inlinedAt: !163)
!168 = !DILocation(line: 29, column: 34, scope: !32, inlinedAt: !163)
!169 = !DILocation(line: 30, column: 29, scope: !32, inlinedAt: !163)
!170 = !DILocation(line: 30, column: 17, scope: !32, inlinedAt: !163)
!171 = !DILocation(line: 30, column: 52, scope: !32, inlinedAt: !163)
!172 = !DILocation(line: 30, column: 40, scope: !32, inlinedAt: !163)
!173 = !DILocation(line: 30, column: 33, scope: !32, inlinedAt: !163)
!174 = !DILocation(line: 30, column: 9, scope: !32, inlinedAt: !163)
!175 = !DILocation(line: 29, column: 5, scope: !32, inlinedAt: !163)
!176 = !DILocation(line: 45, column: 9, scope: !43)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !138, file: !1, line: 49, type: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 49, size: 256, align: 32, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !178, file: !1, line: 49, baseType: !15, size: 96, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !178, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !178, file: !1, line: 49, baseType: !15, size: 96, align: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !178, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 224)
!184 = !DILocation(line: 49, column: 17, scope: !138)
!185 = !DILocation(line: 50, column: 13, scope: !138)
!186 = !DILocation(line: 50, column: 20, scope: !138)
!187 = !DILocation(line: 51, column: 13, scope: !138)
!188 = !DILocation(line: 51, column: 23, scope: !138)
!189 = !DILocation(line: 54, column: 13, scope: !138)
!190 = !DILocation(line: 54, column: 18, scope: !138)
!191 = !DILocation(line: 55, column: 13, scope: !138)
!192 = !DILocation(line: 55, column: 18, scope: !138)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !138, file: !1, line: 56, type: !50)
!194 = !DILocation(line: 56, column: 20, scope: !138)
!195 = !DILocation(line: 56, column: 30, scope: !138)
!196 = !DILocation(line: 60, column: 56, scope: !138)
!197 = !DILocation(line: 60, column: 22, scope: !138)
!198 = !DILocation(line: 60, column: 46, scope: !138)
!199 = !DILocation(line: 61, column: 5, scope: !138)
!200 = !DILocation(line: 65, column: 22, scope: !201)
!201 = distinct !DILexicalBlock(scope: !139, file: !1, line: 63, column: 5)
!202 = !DILocation(line: 65, column: 9, scope: !201)
!203 = !DILocation(line: 65, column: 46, scope: !201)
!204 = !DILocation(line: 67, column: 1, scope: !43)
!205 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !46, file: !1, line: 70, type: !53)
!206 = !DILocation(line: 70, column: 67, scope: !46)
!207 = !DILocation(line: 72, column: 43, scope: !46)
!208 = !DILocation(line: 72, column: 38, scope: !46)
!209 = !DILocation(line: 72, column: 36, scope: !46)
!210 = !DILocation(line: 72, column: 65, scope: !46)
!211 = !DILocation(line: 72, column: 60, scope: !46)
!212 = !DILocation(line: 72, column: 58, scope: !46)
!213 = !DILocation(line: 72, column: 86, scope: !46)
!214 = !DILocation(line: 72, column: 81, scope: !46)
!215 = !DILocation(line: 72, column: 107, scope: !46)
!216 = !DILocation(line: 72, column: 102, scope: !46)
!217 = !DILocation(line: 72, column: 12, scope: !46)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !46, file: !1, line: 72, type: !14)
!219 = !DILocation(line: 73, column: 28, scope: !46)
!220 = !DILocation(line: 73, column: 19, scope: !46)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !46, file: !1, line: 70, type: !50)
!222 = !DILocation(line: 70, column: 42, scope: !46)
!223 = !DIExpression(DW_OP_bit_piece, 96, 32)
!224 = !DILocation(line: 74, column: 1, scope: !46)
!225 = !DILocation(line: 79, column: 19, scope: !57)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !57, file: !1, line: 77, type: !50)
!227 = !DILocation(line: 77, column: 36, scope: !57)
!228 = !DILocation(line: 80, column: 1, scope: !57)

#endif

const unsigned char g_pRaytracing[] = {
  0x44, 0x58, 0x42, 0x43, 0xd7, 0x21, 0xc3, 0xc6, 0x2f, 0x30, 0xa9, 0x20,
  0xfc, 0xa7, 0x93, 0x50, 0x22, 0xf0, 0x86, 0x39, 0x01, 0x00, 0x00, 0x00,
  0x80, 0x4b, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x6c, 0x02, 0x00, 0x00, 0x30, 0x30, 0x00, 0x00,
  0x98, 0x3c, 0x00, 0x00, 0xcc, 0x3c, 0x00, 0x00, 0xe8, 0x3c, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0x18, 0x02, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xfc, 0x00, 0x00, 0x00, 0x6c, 0x01, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xdc, 0x00, 0x00, 0x00, 0x00, 0x67, 0x5f, 0x72,
  0x61, 0x79, 0x47, 0x65, 0x6e, 0x43, 0x42, 0x00, 0x53, 0x63, 0x65, 0x6e,
  0x65, 0x00, 0x52, 0x65, 0x6e, 0x64, 0x65, 0x72, 0x54, 0x61, 0x72, 0x67,
  0x65, 0x74, 0x00, 0x01, 0x3f, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65,
  0x6e, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58,
  0x58, 0x5a, 0x00, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65, 0x6e, 0x53,
