#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: ccb90eddb5b3e1b94ff6da7a7707d91b.pdb
; shader hash: ccb90eddb5b3e1b94ff6da7a7707d91b
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer l_ObjectCB
; {
;
;   struct l_ObjectCB
;   {
;
;       struct struct.OBJECT_CB_STATIC_Arr
;       {
;
;           struct struct.OBJECT_CB_STATIC
;           {
;
;               uint startIndex_in_IB_SRV;            ; Offset:    0
;               uint startIndex_in_VB_SRV;            ; Offset:    4
;               float2 padding;                       ; Offset:    8
;               float4 albedo;                        ; Offset:   16
;           
;           } object_cb_static[2];;                   ; Offset:    0
;
;       
;       } l_ObjectCB;                                 ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !22, globals: !138)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 73, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingDefines.h", directory: "")
!5 = !DINamespace(name: "RayType", scope: null, file: !4, line: 72)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "Radiance", value: 0)
!8 = !DIEnumerator(name: "Count", value: 1)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 40, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 40, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !{!23, !40, !84, !95, !98, !108, !111, !114, !124, !127}
!23 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@UByteAddressBuffer@@I@Z", scope: !24, file: !24, line: 9, type: !25, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!24 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingFunctions.hlsli", directory: "")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !37, !39}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !29, templateParams: !34)
!29 = !{!30, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, baseType: !31, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!35, !36}
!35 = !DITemplateTypeParameter(name: "element", type: !31)
!36 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 3)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, size: 32, align: 32, elements: !38)
!38 = !{}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !31)
!40 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !24, file: !24, line: 78, type: !41, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubroutineType(types: !42)
!42 = !{!10, !43, !72, !75}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !4, line: 31, size: 1024, align: 32, elements: !44)
!44 = !{!45, !68, !69, !70, !71}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !43, file: !4, line: 33, baseType: !46, size: 512, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 40, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 40, size: 512, align: 32, elements: !48, templateParams: !65)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !47, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!65 = !{!19, !66, !67}
!66 = !DITemplateValueParameter(name: "row_count", type: !21, value: i32 4)
!67 = !DITemplateValueParameter(name: "col_count", type: !21, value: i32 4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !43, file: !4, line: 34, baseType: !10, size: 128, align: 32, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !43, file: !4, line: 35, baseType: !10, size: 128, align: 32, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !43, file: !4, line: 36, baseType: !10, size: 128, align: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !43, file: !4, line: 37, baseType: !10, size: 128, align: 32, offset: 896)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, align: 32, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 40, size: 64, align: 32, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !75, file: !1, line: 40, baseType: !78, size: 64, align: 32)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !79, templateParams: !82)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !{!19, !83}
!83 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 2)
!84 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !24, file: !24, line: 84, type: !85, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !94, !75}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 83, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 83, size: 96, align: 32, elements: !89, templateParams: !93)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !88, file: !1, line: 83, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !88, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !88, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!93 = !{!19, !36}
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 288, align: 32, elements: !73)
!95 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@V?$vector@M$02@@1@Z", scope: !24, file: !24, line: 91, type: !96, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DISubroutineType(types: !97)
!97 = !{!10, !43, !87, !87}
!98 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URaytracingAccelerationStructure@@UMyRay@@I@Z", scope: !1, file: !1, line: 18, type: !99, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DISubroutineType(types: !100)
!100 = !{!10, !101, !102, !106}
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 98, size: 32, align: 32, elements: !38)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRay", file: !4, line: 60, size: 192, align: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !102, file: !4, line: 62, baseType: !87, size: 96, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !102, file: !4, line: 63, baseType: !87, size: 96, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !107, line: 19, baseType: !39)
!107 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!108 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 47, type: !109, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!109 = !DISubroutineType(types: !110)
!110 = !{null}
!111 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 76, type: !112, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!87}
!114 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 82, type: !115, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !123}
!117 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRayPayload", file: !4, line: 65, size: 160, align: 32, elements: !119)
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !118, file: !4, line: 67, baseType: !121, size: 128, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !107, line: 16, baseType: !10)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "recursionDepth", scope: !118, file: !4, line: 68, baseType: !106, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !24, line: 6, baseType: !75)
!124 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXUMyRayPayload@@@Z", scope: !1, file: !1, line: 134, type: !125, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z")
!125 = !DISubroutineType(types: !126)
!126 = !{null, !117}
!127 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXUDXR_Scene_CB@@V?$vector@I$01@@AIAV?$vector@M$02@@2@Z", scope: !24, file: !24, line: 42, type: !128, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !43, !130, !136, !136}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !132, templateParams: !135)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !131, file: !1, line: 23, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !131, file: !1, line: 23, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!135 = !{!35, !83}
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !87)
!138 = !{!139, !143, !144, !146, !147, !151, !152, !154, !155, !159, !160, !171, !175}
!139 = !DIGlobalVariable(name: "GeometryStride", scope: !140, file: !4, line: 89, type: !142, isLocal: true, isDefinition: true, variable: i32 1)
!140 = !DINamespace(name: "HitGroup", scope: !141, file: !4, line: 83)
!141 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 80)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!143 = !DIGlobalVariable(name: "InstanceMask", scope: !141, file: !4, line: 82, type: !142, isLocal: true, isDefinition: true, variable: i32 -1)
!144 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 35, type: !145, isLocal: true, isDefinition: true, variable: i32 16)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!146 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !141, file: !4, line: 82, type: !142, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !140, file: !4, line: 84, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !140, file: !4, line: 89, type: !142, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !153, file: !4, line: 92, type: !148, isLocal: true, isDefinition: true)
!153 = !DINamespace(name: "MissShader", scope: !141, file: !4, line: 91)
!154 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !101, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!155 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !156, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !38, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "element", type: !11)
!159 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !37, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!160 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !161, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !38, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "element", type: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !4, line: 52, size: 384, align: 32, elements: !165)
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !164, file: !4, line: 54, baseType: !87, size: 96, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !164, file: !4, line: 55, baseType: !87, size: 96, align: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !164, file: !4, line: 56, baseType: !10, size: 128, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !164, file: !4, line: 57, baseType: !170, size: 64, align: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !78)
!171 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 12, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 12, size: 32, align: 32, elements: !38, templateParams: !173)
!173 = !{!174}
!174 = !DITemplateTypeParameter(name: "T", type: !43)
!175 = !DIGlobalVariable(name: "l_ObjectCB", linkageName: "\01?l_ObjectCB@@3U?$ConstantBuffer@UOBJECT_CB_STATIC_Arr@@@@A", scope: !0, file: !1, line: 15, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_STATIC_Arr>", file: !1, line: 15, size: 32, align: 32, elements: !38, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "T", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC_Arr", file: !4, line: 47, size: 512, align: 32, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_static", scope: !179, file: !4, line: 49, baseType: !182, size: 512, align: 32)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 512, align: 32, elements: !189)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC", file: !4, line: 40, size: 256, align: 32, elements: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_IB_SRV", scope: !183, file: !4, line: 42, baseType: !106, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_VB_SRV", scope: !183, file: !4, line: 43, baseType: !106, size: 32, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !183, file: !4, line: 44, baseType: !170, size: 64, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !183, file: !4, line: 45, baseType: !121, size: 128, align: 32, offset: 128)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!194 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingFunctions.hlsli\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// Local RootSig\0D\0AConstantBuffer<OBJECT_CB_STATIC_Arr> l_ObjectCB : register(b1, space1);\0D\0A\0D\0A// Trace a radiance ray into the scene and returns a shaded color.\0D\0A    float4 TraceRadianceRay(RaytracingAccelerationStructure scene, in MyRay ray, in UINT currentRayRecursionDepth)\0D\0A    {\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return float4(0, 0, 0, 0);\0D\0A    }\0D\0A\0D\0A// Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A    rayDesc.Direction = ray.direction;\0D\0A// Set TMin to a zero value to avoid aliasing artifacts along contact areas.\0D\0A// Note: make sure to enable face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0;\0D\0A    rayDesc.TMax = 10000;\0D\0A    MyRayPayload rayPayload = { float4(0, 0, 0, 0), currentRayRecursionDepth + 1 };\0D\0A    TraceRay(scene,\0D\0A    RAY_FLAG_CULL_BACK_FACING_TRIANGLES,\0D\0A    TraceRayParameters::InstanceMask,\0D\0A    TraceRayParameters::HitGroup::Offset[RayType::Radiance],\0D\0A    TraceRayParameters::HitGroup::GeometryStride,\0D\0A    TraceRayParameters::MissShader::Offset[RayType::Radiance],\0D\0A    rayDesc, \0D\0A    rayPayload);\0D\0A\0D\0A    return rayPayload.color;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A    \0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(g_sceneCB, DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = origin;\0D\0A    rayDesc.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    rayDesc.TMin = 0.001;\0D\0A    rayDesc.TMax = 10000.0;\0D\0A    MyRayPayload payload = { float4(0, 0, 0, 0), 2 };\0D\0A    //TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, rayDesc, payload);\0D\0A\0D\0A    //// Cast a ray into the scene and retrieve a shaded color.\0D\0A    //UINT currentRecursionDepth = 0;\0D\0A    //float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout MyRayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStrideInBytes = indexSizeInBytes * 3;\0D\0A    uint iBaseOffsetInBytes = (l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_IB_SRV / 3 + PrimitiveIndex())\0D\0A     * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A    \0D\0A    uint startIndex_in_VB_SRV = l_ObjectCB.object_cb_static[InstanceIndex()].startIndex_in_VB_SRV; //0 or 24\0D\0A    const uint3 indices3 = Load3x16BitIndices(Indices, iBaseOffsetInBytes);\0D\0A    \0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[1]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[2]].color\0D\0A    };\0D\0A\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[1]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[2]].normal\0D\0A    };\0D\0A\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A\0D\0A    \0D\0A    float4 diffuseColor = CalculateDiffuseLighting(g_sceneCB, hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    //payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A    payload.color = l_ObjectCB.object_cb_static[InstanceIndex()].albedo; // for debug albedo\0D\0A    payload.color = Apply_Barycentric_Float4(g_sceneCB, triangleColorArr, attr);\0D\0A\0D\0A  //  if (true)\0D\0A  //  {\0D\0A\09\09\0D\0A  //      float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A\09\09//        // Trace a reflection ray.\0D\0A  //      MyRay reflectionRay = { HitWorldPosition(), reflect(WorldRayDirection(), triangleNormal) };\0D\0A  //      float4 reflectionColor = TraceRadianceRay(reflectionRay, rayPayload.recursionDepth);\0D\0A\0D\0A  //      float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), triangleNormal, l_materialCB.albedo.xyz);\0D\0A  //      reflectedColor = l_materialCB.reflectanceCoef * float4(fresnelR, 1) *\0D\0A\09\09//reflectionColor;\0D\0A  //  }\0D\0A\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout MyRayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!195 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!196 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingDefines.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_DEFINES\0D\0A#define RAYTRACING_DEFINES\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 3    // ~ primary rays + reflections + shadow rays from reflected geometry.\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_STATIC\0D\0A{\0D\0A    UINT startIndex_in_IB_SRV; // Index Buffer ShaderResourceView\EC\9D\98 \EC\8B\9C\EC\9E\91 \EC\9D\B8\EB\8D\B1\EC\8A\A4\0D\0A    UINT startIndex_in_VB_SRV;\0D\0A    float2 padding;\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0Astruct OBJECT_CB_STATIC_Arr\0D\0A{\0D\0A    OBJECT_CB_STATIC object_cb_static[2]; // TODO \EA\B0\9C\EC\88\98 TEMP\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A\0D\0Astruct MyRay\0D\0A{\0D\0A    float3 origin;\0D\0A    float3 direction;\0D\0A};\0D\0Astruct MyRayPayload\0D\0A{\0D\0A    XMFLOAT4 color;\0D\0A    UINT   recursionDepth;\0D\0A};\0D\0A\0D\0A// Ray types traced\0D\0Anamespace RayType {\0D\0A    enum Enum {\0D\0A        Radiance = 0,   // ~ Primary, reflected camera/view rays calculating color for each hit.\0D\0A        //Shadow,         // ~ Shadow/visibility rays, only testing for occlusion\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A        static const UINT GeometryStride = RayType::Count;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A#endif // RAYTRACING_DEFINES"}
!197 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingFunctions.hlsli", !"#ifndef RAYTRACING_FUNCTIONS\0D\0A#define RAYTRACING_FUNCTIONS\0D\0A\0D\0A\0D\0A#include \22RaytracingDefines.h\22\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(ByteAddressBuffer Indices,uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(DXR_Scene_CB sceneCB, uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray\0D\0A    float4 world = mul(float4(screenPos, 0, 1), sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline MyRay GenerateCameraRay(int2 index, in float3 cameraPosition, in float4x4 projectionToWorld)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), projectionToWorld);\0D\0A    world.xyz /= world.w;\0D\0A\0D\0A    MyRay ray;\0D\0A    ray.origin = cameraPosition;\0D\0A    ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(DXR_Scene_CB sceneCB, float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(DXR_Scene_CB sceneCB, float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return sceneCB.lightDiffuseColor * fNDotL; // TODO : LocalRootSig\EC\9D\98 \EC\98\A4\EB\B8\8C\EC\A0\9D\ED\8A\B8 \EC\95\8C\EB\B2\A0\EB\8F\84 \EC\A0\81\EC\9A\A9\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A#endif\0D\0A"}
!198 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!199 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!200 = !{i32 1, i32 3}
!201 = !{i32 1, i32 6}
!202 = !{!"lib", i32 6, i32 3}
!203 = !{!204, !210, !213, null}
!204 = !{!205, !207, !208}
!205 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !206}
!206 = !{i32 0, i32 4}
!207 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!208 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !209}
!209 = !{i32 1, i32 48}
!210 = !{!211}
!211 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !212}
!212 = !{i32 0, i32 9}
!213 = !{!214, !215}
!214 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!215 = !{i32 1, %l_ObjectCB* @l_ObjectCB, !"l_ObjectCB", i32 1, i32 1, i32 1, i32 64, null}
!216 = !{i32 0, %struct.ByteAddressBuffer undef, !217, %struct.DXR_Scene_CB undef, !219, %struct.BuiltInTriangleIntersectionAttributes undef, !226, %struct.RaytracingAccelerationStructure undef, !217, %"class.RWTexture2D<vector<float, 4> >" undef, !228, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !230, %struct.VertexPositionNormalColorTexture undef, !232, %struct.OBJECT_CB_STATIC_Arr undef, !237, %struct.OBJECT_CB_STATIC undef, !239, %struct.MyRay undef, !244, %struct.RayDesc undef, !247, %struct.MyRayPayload undef, !252, %g_sceneCB undef, !255, %l_ObjectCB undef, !257}
!217 = !{i32 4, !218}
!218 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!219 = !{i32 128, !220, !222, !223, !224, !225}
!220 = !{i32 6, !"viewProjectionInv", i32 2, !221, i32 3, i32 0, i32 7, i32 9}
!221 = !{i32 4, i32 4, i32 2}
!222 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!223 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!224 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!225 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!226 = !{i32 8, !227}
!227 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!228 = !{i32 16, !229}
!229 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!230 = !{i32 56, !231}
!231 = !{i32 6, !"h", i32 3, i32 0}
!232 = !{i32 56, !233, !234, !235, !236}
!233 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!234 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!235 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!236 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!237 = !{i32 64, !238}
!238 = !{i32 6, !"object_cb_static", i32 3, i32 0}
!239 = !{i32 32, !240, !241, !242, !243}
!240 = !{i32 6, !"startIndex_in_IB_SRV", i32 3, i32 0, i32 7, i32 5}
!241 = !{i32 6, !"startIndex_in_VB_SRV", i32 3, i32 4, i32 7, i32 5}
!242 = !{i32 6, !"padding", i32 3, i32 8, i32 7, i32 9}
!243 = !{i32 6, !"albedo", i32 3, i32 16, i32 7, i32 9}
!244 = !{i32 28, !245, !246}
!245 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!246 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!247 = !{i32 32, !248, !249, !250, !251}
!248 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!249 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!250 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!251 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!252 = !{i32 20, !253, !254}
!253 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!254 = !{i32 6, !"recursionDepth", i32 3, i32 16, i32 7, i32 5}
!255 = !{i32 128, !256}
!256 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!257 = !{i32 64, !258}
!258 = !{i32 6, !"l_ObjectCB", i32 3, i32 0}
!259 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !260, void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !262, void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !265}
!260 = !{!261}
!261 = !{i32 1, !38, !38}
!262 = !{!261, !263, !264}
!263 = !{i32 2, !38, !38}
!264 = !{i32 0, !38, !38}
!265 = !{!261, !263}
!266 = !{null, !"", null, !203, !267}
!267 = !{i32 0, i64 65553}
!268 = !{void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !269}
!269 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !270}
!270 = !{i32 0}
!271 = !{void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !"\01?MyMissShader@@YAXUMyRayPayload@@@Z", null, null, !272}
!272 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !270}
!273 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !274}
!274 = !{i32 8, i32 7, i32 5, !270}
!275 = !DILocation(line: 66, column: 5, scope: !108)
!276 = !DILocation(line: 73, column: 5, scope: !108)
!277 = !DILocation(line: 53, column: 23, scope: !108)
!278 = !DILocation(line: 53, column: 5, scope: !108)
!279 = !DILocation(line: 53, column: 34, scope: !108)
!280 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !127, file: !24, line: 42, type: !130)
!281 = !DIExpression(DW_OP_bit_piece, 0, 32)
!282 = !DILocation(line: 42, column: 59, scope: !127, inlinedAt: !283)
!283 = distinct !DILocation(line: 53, column: 5, scope: !108)
!284 = !DIExpression(DW_OP_bit_piece, 32, 32)
!285 = !DILocation(line: 44, column: 17, scope: !127, inlinedAt: !283)
!286 = !DILocation(line: 44, column: 23, scope: !127, inlinedAt: !283)
!287 = !DILocation(line: 44, column: 12, scope: !127, inlinedAt: !283)
!288 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !127, file: !24, line: 44, type: !170)
!289 = !DILocation(line: 45, column: 29, scope: !127, inlinedAt: !283)
!290 = !DILocation(line: 45, column: 27, scope: !127, inlinedAt: !283)
!291 = !DILocation(line: 45, column: 57, scope: !127, inlinedAt: !283)
!292 = !DILocation(line: 45, column: 63, scope: !127, inlinedAt: !283)
!293 = !DILocation(line: 45, column: 12, scope: !127, inlinedAt: !283)
!294 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !127, file: !24, line: 45, type: !170)
!295 = !DILocation(line: 48, column: 19, scope: !127, inlinedAt: !283)
!296 = !DILocation(line: 48, column: 17, scope: !127, inlinedAt: !283)
!297 = !DILocation(line: 51, column: 57, scope: !127, inlinedAt: !283)
!298 = !DILocation(line: 51, column: 20, scope: !127, inlinedAt: !283)
!299 = !DILocation(line: 51, column: 12, scope: !127, inlinedAt: !283)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !127, file: !24, line: 51, type: !10)
!301 = !DIExpression(DW_OP_bit_piece, 64, 32)
!302 = !DIExpression(DW_OP_bit_piece, 96, 32)
!303 = !DILocation(line: 52, column: 15, scope: !127, inlinedAt: !283)
!304 = !DILocation(line: 53, column: 14, scope: !127, inlinedAt: !283)
!305 = !DILocation(line: 53, column: 12, scope: !127, inlinedAt: !283)
!306 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 3, scope: !127, file: !24, line: 42, type: !87)
!307 = !DILocation(line: 42, column: 77, scope: !127, inlinedAt: !283)
!308 = !DILocation(line: 54, column: 37, scope: !127, inlinedAt: !283)
!309 = !DILocation(line: 54, column: 17, scope: !127, inlinedAt: !283)
!310 = !DILocation(line: 54, column: 15, scope: !127, inlinedAt: !283)
!311 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 4, scope: !127, file: !24, line: 42, type: !87)
!312 = !DILocation(line: 42, column: 96, scope: !127, inlinedAt: !283)
!313 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !108, file: !1, line: 49, type: !87)
!314 = !DILocation(line: 49, column: 12, scope: !108)
!315 = !DILocation(line: 55, column: 1, scope: !127, inlinedAt: !283)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !108, file: !1, line: 50, type: !87)
!317 = !DILocation(line: 50, column: 12, scope: !108)
!318 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !108, file: !1, line: 57, type: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 26, size: 256, align: 32, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !319, file: !1, line: 26, baseType: !88, size: 96, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !319, file: !1, line: 26, baseType: !14, size: 32, align: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !319, file: !1, line: 26, baseType: !88, size: 96, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !319, file: !1, line: 26, baseType: !14, size: 32, align: 32, offset: 224)
!325 = !DIExpression()
!326 = !DILocation(line: 57, column: 13, scope: !108)
!327 = !DILocation(line: 58, column: 13, scope: !108)
!328 = !DILocation(line: 58, column: 20, scope: !108)
!329 = !DILocation(line: 59, column: 13, scope: !108)
!330 = !DILocation(line: 59, column: 23, scope: !108)
!331 = !DILocation(line: 62, column: 13, scope: !108)
!332 = !DILocation(line: 62, column: 18, scope: !108)
!333 = !DILocation(line: 63, column: 13, scope: !108)
!334 = !DILocation(line: 63, column: 18, scope: !108)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !108, file: !1, line: 64, type: !118)
!336 = !DILocation(line: 64, column: 18, scope: !108)
!337 = !DILocation(line: 64, column: 28, scope: !108)
!338 = !DILocation(line: 73, column: 53, scope: !108)
!339 = !DILocation(line: 73, column: 19, scope: !108)
!340 = !DILocation(line: 73, column: 43, scope: !108)
!341 = !DILocation(line: 74, column: 1, scope: !108)
!342 = !DILocation(line: 94, column: 9, scope: !114)
!343 = !DILocation(line: 23, column: 36, scope: !23, inlinedAt: !344)
!344 = distinct !DILocation(line: 90, column: 28, scope: !114)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !114, file: !1, line: 82, type: !118)
!346 = !DIExpression(DW_OP_bit_piece, 128, 32)
!347 = !DILocation(line: 82, column: 44, scope: !114)
!348 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !114, file: !1, line: 82, type: !123)
!349 = !DILocation(line: 82, column: 69, scope: !114)
!350 = !DILocation(line: 84, column: 10, scope: !114)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !114, file: !1, line: 84, type: !39)
!352 = !DILocation(line: 85, column: 57, scope: !114)
!353 = !DILocation(line: 85, column: 10, scope: !114)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStrideInBytes", scope: !114, file: !1, line: 85, type: !39)
!355 = !DILocation(line: 86, column: 60, scope: !114)
!356 = !DILocation(line: 86, column: 77, scope: !114)
!357 = !DILocation(line: 86, column: 98, scope: !114)
!358 = !DILocation(line: 86, column: 104, scope: !114)
!359 = !DILocation(line: 86, column: 102, scope: !114)
!360 = !DILocation(line: 87, column: 6, scope: !114)
!361 = !DILocation(line: 86, column: 10, scope: !114)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseOffsetInBytes", scope: !114, file: !1, line: 86, type: !39)
!363 = !DILocation(line: 89, column: 61, scope: !114)
!364 = !DILocation(line: 89, column: 78, scope: !114)
!365 = !DILocation(line: 89, column: 10, scope: !114)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startIndex_in_VB_SRV", scope: !114, file: !1, line: 89, type: !39)
!367 = !DILocation(line: 90, column: 28, scope: !114)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 2, scope: !23, file: !24, line: 9, type: !39)
!369 = !DILocation(line: 9, column: 57, scope: !23, inlinedAt: !344)
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Indices", arg: 1, scope: !23, file: !24, line: 9, type: !37)
!371 = !DILocation(line: 9, column: 44, scope: !23, inlinedAt: !344)
!372 = !DILocation(line: 20, column: 49, scope: !23, inlinedAt: !344)
!373 = !DILocation(line: 20, column: 16, scope: !23, inlinedAt: !344)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !23, file: !24, line: 20, type: !375)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !23, file: !24, line: 23, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!378 = !DILocation(line: 23, column: 17, scope: !23, inlinedAt: !344)
!379 = !DILocation(line: 26, column: 28, scope: !380, inlinedAt: !344)
!380 = distinct !DILexicalBlock(scope: !23, file: !24, line: 26, column: 9)
