#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 22a2178f9d0ae1bd33899c2561d1f721.pdb
; shader hash: 22a2178f9d0ae1bd33899c2561d1f721
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.VertexPositionNormalColorTexture
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float4 color;                                 ; Offset:   24
;       float2 uv;                                    ; Offset:   40
;   
;   } $Element;                                       ; Offset:    0 Size:    48
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !85)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 47, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 47, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !46, !57, !60, !63, !71, !74}
!17 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 16, type: !18, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !24)
!31 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 65, type: !32, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!4, !34, !37}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 3)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 47, size: 64, align: 32, elements: !38)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !37, file: !1, line: 47, baseType: !40, size: 64, align: 32)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 47, size: 64, align: 32, elements: !41, templateParams: !44)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !{!13, !45}
!45 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!46 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 71, type: !47, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !56, !37}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 70, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 70, size: 96, align: 32, elements: !51, templateParams: !55)
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 70, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !{!13, !29}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 288, align: 32, elements: !35)
!57 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 78, type: !58, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!4, !49, !49}
!60 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 95, type: !61, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 121, type: !64, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !70}
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 88, size: 128, align: 32, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !67, file: !1, line: 90, baseType: !4, size: 128, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 87, baseType: !37)
!71 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 154, type: !72, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!72 = !DISubroutineType(types: !73)
!73 = !{null, !66}
!74 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 49, type: !75, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !83, !83}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !79, templateParams: !82)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !1, line: 30, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !1, line: 30, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !{!28, !45}
!83 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !49)
!85 = !{!86, !88, !92, !94, !106}
!86 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !87, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 8, size: 32, align: 32, elements: !2)
!88 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !89, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !2, templateParams: !90)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "element", type: !5)
!92 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !93, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 10, size: 32, align: 32, elements: !2)
!94 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !95, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "element", type: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !99, line: 37, size: 384, align: 32, elements: !100)
!99 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !98, file: !99, line: 39, baseType: !49, size: 96, align: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !98, file: !99, line: 40, baseType: !49, size: 96, align: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !98, file: !99, line: 41, baseType: !4, size: 128, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !98, file: !99, line: 42, baseType: !105, size: 64, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !40)
!106 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 13, type: !107, isLocal: false, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !99, line: 23, size: 1024, align: 32, elements: !111)
!111 = !{!112, !135, !136, !137, !138}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !110, file: !99, line: 25, baseType: !113, size: 512, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 13, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 13, size: 512, align: 32, elements: !115, templateParams: !132)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !114, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!132 = !{!13, !133, !134}
!133 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!134 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !110, file: !99, line: 26, baseType: !4, size: 128, align: 32, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !110, file: !99, line: 27, baseType: !4, size: 128, align: 32, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !110, file: !99, line: 28, baseType: !4, size: 128, align: 32, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !110, file: !99, line: 29, baseType: !4, size: 128, align: 32, offset: 896)
!139 = !{i32 2, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!142 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0A\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), g_sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(g_sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return g_sceneCB.lightDiffuseColor * fNDotL; // TODO : LocalRootSig\EC\9D\98 \EC\98\A4\EB\B8\8C\EC\A0\9D\ED\8A\B8 \EC\95\8C\EB\B2\A0\EB\8F\84 \EC\A0\81\EC\9A\A9\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A    \0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    //TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStride = indexSizeInBytes * 3;\0D\0A    uint iBaseIndex = PrimitiveIndex() * iTriangleIndexStride; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(iBaseIndex);\0D\0A\0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[indices3[0]].color,\0D\0A        Vertices[indices3[1]].color,\0D\0A        Vertices[indices3[2]].color\0D\0A    };\0D\0A\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[indices3[0]].normal,\0D\0A\09\09Vertices[indices3[1]].normal,\0D\0A\09\09Vertices[indices3[2]].normal\0D\0A    };\0D\0A\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A\0D\0A    \0D\0A    float4 diffuseColor = CalculateDiffuseLighting(hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!143 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!144 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A//typedef Vertex VertexPositionNormalColorTexture;\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!145 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!146 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!147 = !{i32 1, i32 3}
!148 = !{i32 1, i32 6}
!149 = !{!"lib", i32 6, i32 3}
!150 = !{!151, !157, !160, null}
!151 = !{!152, !154, !155}
!152 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !153}
!153 = !{i32 0, i32 4}
!154 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!155 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !156}
!156 = !{i32 1, i32 48}
!157 = !{!158}
!158 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !159}
!159 = !{i32 0, i32 9}
!160 = !{!161}
!161 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!162 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !163, %"class.RWTexture2D<vector<float, 4> >" undef, !165, %struct.ByteAddressBuffer undef, !163, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !167, %struct.VertexPositionNormalColorTexture undef, !169, %struct.DXR_Scene_CB undef, !174, %struct.BuiltInTriangleIntersectionAttributes undef, !181, %struct.RayDesc undef, !183, %struct.RayPayload undef, !188, %g_sceneCB undef, !190}
!163 = !{i32 4, !164}
!164 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!165 = !{i32 16, !166}
!166 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!167 = !{i32 56, !168}
!168 = !{i32 6, !"h", i32 3, i32 0}
!169 = !{i32 56, !170, !171, !172, !173}
!170 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!171 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!172 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!173 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!174 = !{i32 128, !175, !177, !178, !179, !180}
!175 = !{i32 6, !"viewProjectionInv", i32 2, !176, i32 3, i32 0, i32 7, i32 9}
!176 = !{i32 4, i32 4, i32 2}
!177 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!178 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!179 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!180 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!181 = !{i32 8, !182}
!182 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!183 = !{i32 32, !184, !185, !186, !187}
!184 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!185 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!186 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!187 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!188 = !{i32 16, !189}
!189 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!190 = !{i32 128, !191}
!191 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!192 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !193, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !195, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !198}
!193 = !{!194}
!194 = !{i32 1, !2, !2}
!195 = !{!194, !196, !197}
!196 = !{i32 2, !2, !2}
!197 = !{i32 0, !2, !2}
!198 = !{!194, !196}
!199 = !{null, !"", null, !150, !200}
!200 = !{i32 0, i64 65553}
!201 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !202}
!202 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !203}
!203 = !{i32 0}
!204 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !205}
!205 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !203}
!206 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !207}
!207 = !{i32 8, i32 7, i32 5, !203}
!208 = !DILocation(line: 114, column: 5, scope: !60)
!209 = !DILocation(line: 117, column: 5, scope: !60)
!210 = !DILocation(line: 101, column: 23, scope: !60)
!211 = !DILocation(line: 101, column: 5, scope: !60)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !74, file: !1, line: 49, type: !77)
!213 = !DIExpression(DW_OP_bit_piece, 0, 32)
!214 = !DILocation(line: 49, column: 37, scope: !74, inlinedAt: !215)
!215 = distinct !DILocation(line: 101, column: 5, scope: !60)
!216 = !DIExpression(DW_OP_bit_piece, 32, 32)
!217 = !DILocation(line: 51, column: 17, scope: !74, inlinedAt: !215)
!218 = !DILocation(line: 51, column: 23, scope: !74, inlinedAt: !215)
!219 = !DILocation(line: 51, column: 12, scope: !74, inlinedAt: !215)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !74, file: !1, line: 51, type: !105)
!221 = !DILocation(line: 52, column: 29, scope: !74, inlinedAt: !215)
!222 = !DILocation(line: 52, column: 27, scope: !74, inlinedAt: !215)
!223 = !DILocation(line: 52, column: 57, scope: !74, inlinedAt: !215)
!224 = !DILocation(line: 52, column: 63, scope: !74, inlinedAt: !215)
!225 = !DILocation(line: 52, column: 12, scope: !74, inlinedAt: !215)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !74, file: !1, line: 52, type: !105)
!227 = !DILocation(line: 55, column: 19, scope: !74, inlinedAt: !215)
!228 = !DILocation(line: 55, column: 17, scope: !74, inlinedAt: !215)
!229 = !DILocation(line: 58, column: 59, scope: !74, inlinedAt: !215)
!230 = !DILocation(line: 58, column: 20, scope: !74, inlinedAt: !215)
!231 = !DILocation(line: 58, column: 12, scope: !74, inlinedAt: !215)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !74, file: !1, line: 58, type: !4)
!233 = !DIExpression(DW_OP_bit_piece, 64, 32)
!234 = !DIExpression(DW_OP_bit_piece, 96, 32)
!235 = !DILocation(line: 59, column: 15, scope: !74, inlinedAt: !215)
!236 = !DILocation(line: 60, column: 14, scope: !74, inlinedAt: !215)
!237 = !DILocation(line: 60, column: 12, scope: !74, inlinedAt: !215)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !74, file: !1, line: 49, type: !49)
!239 = !DILocation(line: 49, column: 55, scope: !74, inlinedAt: !215)
!240 = !DILocation(line: 61, column: 37, scope: !74, inlinedAt: !215)
!241 = !DILocation(line: 61, column: 17, scope: !74, inlinedAt: !215)
!242 = !DILocation(line: 61, column: 15, scope: !74, inlinedAt: !215)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !74, file: !1, line: 49, type: !49)
!244 = !DILocation(line: 49, column: 74, scope: !74, inlinedAt: !215)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !60, file: !1, line: 97, type: !49)
!246 = !DILocation(line: 97, column: 12, scope: !60)
!247 = !DILocation(line: 62, column: 1, scope: !74, inlinedAt: !215)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !60, file: !1, line: 98, type: !49)
!249 = !DILocation(line: 98, column: 12, scope: !60)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !60, file: !1, line: 105, type: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 105, size: 256, align: 32, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !251, file: !1, line: 105, baseType: !50, size: 96, align: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !251, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !251, file: !1, line: 105, baseType: !50, size: 96, align: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !251, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 224)
!257 = !DIExpression()
!258 = !DILocation(line: 105, column: 13, scope: !60)
!259 = !DILocation(line: 106, column: 9, scope: !60)
!260 = !DILocation(line: 106, column: 16, scope: !60)
!261 = !DILocation(line: 107, column: 9, scope: !60)
!262 = !DILocation(line: 107, column: 19, scope: !60)
!263 = !DILocation(line: 110, column: 9, scope: !60)
!264 = !DILocation(line: 110, column: 14, scope: !60)
!265 = !DILocation(line: 111, column: 9, scope: !60)
!266 = !DILocation(line: 111, column: 14, scope: !60)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !60, file: !1, line: 112, type: !67)
!268 = !DILocation(line: 112, column: 16, scope: !60)
!269 = !DILocation(line: 112, column: 26, scope: !60)
!270 = !DILocation(line: 117, column: 53, scope: !60)
!271 = !DILocation(line: 117, column: 19, scope: !60)
!272 = !DILocation(line: 117, column: 43, scope: !60)
!273 = !DILocation(line: 118, column: 1, scope: !60)
!274 = !DILocation(line: 131, column: 9, scope: !63)
!275 = !DILocation(line: 30, column: 36, scope: !17, inlinedAt: !276)
!276 = distinct !DILocation(line: 127, column: 28, scope: !63)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !63, file: !1, line: 121, type: !70)
!278 = !DILocation(line: 121, column: 67, scope: !63)
!279 = !DILocation(line: 123, column: 10, scope: !63)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !63, file: !1, line: 123, type: !30)
!281 = !DILocation(line: 124, column: 50, scope: !63)
!282 = !DILocation(line: 124, column: 10, scope: !63)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStride", scope: !63, file: !1, line: 124, type: !30)
!284 = !DILocation(line: 125, column: 23, scope: !63)
!285 = !DILocation(line: 125, column: 40, scope: !63)
!286 = !DILocation(line: 125, column: 10, scope: !63)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseIndex", scope: !63, file: !1, line: 125, type: !30)
!288 = !DILocation(line: 127, column: 28, scope: !63)
!289 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !17, file: !1, line: 16, type: !30)
!290 = !DILocation(line: 16, column: 31, scope: !17, inlinedAt: !276)
!291 = !DILocation(line: 27, column: 49, scope: !17, inlinedAt: !276)
!292 = !DILocation(line: 27, column: 16, scope: !17, inlinedAt: !276)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !17, file: !1, line: 27, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !17, file: !1, line: 30, type: !296)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!297 = !DILocation(line: 30, column: 17, scope: !17, inlinedAt: !276)
!298 = !DILocation(line: 33, column: 28, scope: !299, inlinedAt: !276)
!299 = distinct !DILexicalBlock(scope: !17, file: !1, line: 33, column: 9)
!300 = !DILocation(line: 33, column: 9, scope: !17, inlinedAt: !276)
!301 = !DILocation(line: 35, column: 40, scope: !302, inlinedAt: !276)
!302 = distinct !DILexicalBlock(scope: !299, file: !1, line: 34, column: 5)
!303 = !DILocation(line: 35, column: 19, scope: !302, inlinedAt: !276)
!304 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !17, file: !1, line: 18, type: !20)
!305 = !DILocation(line: 18, column: 11, scope: !17, inlinedAt: !276)
!306 = !DILocation(line: 36, column: 41, scope: !302, inlinedAt: !276)
!307 = !DILocation(line: 36, column: 48, scope: !302, inlinedAt: !276)
!308 = !DILocation(line: 36, column: 19, scope: !302, inlinedAt: !276)
!309 = !DILocation(line: 37, column: 40, scope: !302, inlinedAt: !276)
!310 = !DILocation(line: 37, column: 19, scope: !302, inlinedAt: !276)
!311 = !DILocation(line: 38, column: 5, scope: !302, inlinedAt: !276)
