#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 4d95e55640ed74be557ed595db427731.pdb
; shader hash: 4d95e55640ed74be557ed595db427731
;
; Buffer Definitions:
;
; Resource bind info for Vertices
; {
;
;   struct struct.VertexPositionNormalColorTexture
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float4 color;                                 ; Offset:   24
;       float2 uv;                                    ; Offset:   40
;   
;   } $Element;                                       ; Offset:    0 Size:    48
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; Scene_TLAS                        texture     i32         ras      T0      t0,space1     1
; Indices                           texture    byte         r/o      T1      t1,space1     1
; Vertices                          texture  struct         r/o      T2      t2,space1     1
; gRenderTarget                         UAV     f32          2d      U0      u0,space1     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !68)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 67, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 47, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 70, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 70, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 47, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 47, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 47, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !45, !54, !57, !65}
!32 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 16, type: !33, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !44}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !21}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !39)
!45 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 50, type: !46, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!22, !48, !51}
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, align: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 3)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 47, size: 64, align: 32, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !51, file: !1, line: 47, baseType: !5, size: 64, align: 32)
!54 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 65, type: !55, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 94, type: !58, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !64}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 58, size: 128, align: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !61, file: !1, line: 60, baseType: !22, size: 128, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 57, baseType: !51)
!65 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 120, type: !66, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !60}
!68 = !{!69, !71, !75, !77, !88}
!69 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !70, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 8, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !72, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !23)
!75 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !76, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 10, size: 32, align: 32, elements: !2)
!77 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !78, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !2, templateParams: !79)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "element", type: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !82, line: 34, size: 384, align: 32, elements: !83)
!82 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !81, file: !82, line: 36, baseType: !14, size: 96, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !81, file: !82, line: 37, baseType: !14, size: 96, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !81, file: !82, line: 38, baseType: !22, size: 128, align: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !81, file: !82, line: 39, baseType: !4, size: 64, align: 32, offset: 320)
!88 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@USceneConstantBuffer@@@@A", scope: !0, file: !1, line: 13, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<SceneConstantBuffer>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !90)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneConstantBuffer", file: !82, line: 23, size: 640, align: 32, elements: !93)
!93 = !{!94, !119}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !92, file: !82, line: 25, baseType: !95, size: 512, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !96, line: 18, baseType: !97)
!96 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 13, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 13, size: 512, align: 32, elements: !99, templateParams: !116)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !98, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!116 = !{!11, !117, !118}
!117 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!118 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !92, file: !82, line: 26, baseType: !120, size: 128, align: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !96, line: 17, baseType: !22)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!124 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0A\0D\0AConstantBuffer<SceneConstantBuffer> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2) DispatchRaysIndex() / (float2) DispatchRaysDimensions();\0D\0A\0D\0A    // Orthographic projection since we're raytracing in screen space.\0D\0A    float3 rayDir = float3(0, 0, 1);\0D\0A    float3 origin = float3(\0D\0A        lerp(-1, 1, lerpValues.x),\0D\0A        lerp(-1, 1, lerpValues.y),\0D\0A        0.0f);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = float3(0, 0, 1);\0D\0A\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float4 color = float4(0, 0, 0, 0);\0D\0A\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStride = indexSizeInBytes * 3;\0D\0A    uint iBaseIndex = PrimitiveIndex() * iTriangleIndexStride; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(iBaseIndex);\0D\0A\0D\0A    float4 triangleColors[3] =\0D\0A    {\0D\0A        Vertices[indices3[0]].color,\0D\0A        Vertices[indices3[1]].color,\0D\0A        Vertices[indices3[2]].color\0D\0A    };\0D\0A\0D\0A    \0D\0A\0D\0A\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColors, attr);\0D\0A    //payload.color = Vertices[0].color;\0D\0A    //payload.color = float4(0, 0, 0, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!125 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!126 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct SceneConstantBuffer\0D\0A{\0D\0A    XMMATRIX projectionToWorld;\0D\0A    XMVECTOR cameraPosition;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A//typedef Vertex VertexPositionNormalColorTexture;\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!127 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!128 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!129 = !{i32 1, i32 3}
!130 = !{i32 1, i32 6}
!131 = !{!"lib", i32 6, i32 3}
!132 = !{!133, !139, null, null}
!133 = !{!134, !136, !137}
!134 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !135}
!135 = !{i32 0, i32 4}
!136 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!137 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !138}
!138 = !{i32 1, i32 48}
!139 = !{!140}
!140 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !141}
!141 = !{i32 0, i32 9}
!142 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !143, %"class.RWTexture2D<vector<float, 4> >" undef, !145, %struct.ByteAddressBuffer undef, !143, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !147, %struct.VertexPositionNormalColorTexture undef, !149, %struct.SceneConstantBuffer undef, !154, %struct.BuiltInTriangleIntersectionAttributes undef, !158, %struct.RayDesc undef, !160, %struct.RayPayload undef, !165}
!143 = !{i32 4, !144}
!144 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!145 = !{i32 16, !146}
!146 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!147 = !{i32 56, !148}
!148 = !{i32 6, !"h", i32 3, i32 0}
!149 = !{i32 56, !150, !151, !152, !153}
!150 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!151 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!152 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!153 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!154 = !{i32 80, !155, !157}
!155 = !{i32 6, !"projectionToWorld", i32 2, !156, i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 4, i32 4, i32 2}
!157 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!158 = !{i32 8, !159}
!159 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!160 = !{i32 32, !161, !162, !163, !164}
!161 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!162 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!163 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!164 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!165 = !{i32 16, !166}
!166 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!167 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !168, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !170, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !173}
!168 = !{!169}
!169 = !{i32 1, !2, !2}
!170 = !{!169, !171, !172}
!171 = !{i32 2, !2, !2}
!172 = !{i32 0, !2, !2}
!173 = !{!169, !171}
!174 = !{null, !"", null, !132, !175}
!175 = !{i32 0, i64 65553}
!176 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !177}
!177 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !178}
!178 = !{i32 0}
!179 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !180}
!180 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !178}
!181 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !182}
!182 = !{i32 8, i32 7, i32 5, !178}
!183 = !DILocation(line: 87, column: 5, scope: !54)
!184 = !DILocation(line: 90, column: 5, scope: !54)
!185 = !DILocation(line: 67, column: 34, scope: !54)
!186 = !DILocation(line: 67, column: 65, scope: !54)
!187 = !DILocation(line: 67, column: 54, scope: !54)
!188 = !DILocation(line: 67, column: 12, scope: !54)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !54, file: !1, line: 67, type: !4)
!190 = !DIExpression(DW_OP_bit_piece, 0, 32)
!191 = !DIExpression(DW_OP_bit_piece, 32, 32)
!192 = !DILocation(line: 70, column: 12, scope: !54)
!193 = !DILocation(line: 72, column: 9, scope: !54)
!194 = !DILocation(line: 73, column: 9, scope: !54)
!195 = !DILocation(line: 71, column: 12, scope: !54)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !54, file: !1, line: 71, type: !14)
!197 = !DIExpression(DW_OP_bit_piece, 64, 32)
!198 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !54, file: !1, line: 78, type: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 78, size: 256, align: 32, elements: !200)
!200 = !{!201, !202, !203, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !199, file: !1, line: 78, baseType: !15, size: 96, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !199, file: !1, line: 78, baseType: !8, size: 32, align: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !199, file: !1, line: 78, baseType: !15, size: 96, align: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !199, file: !1, line: 78, baseType: !8, size: 32, align: 32, offset: 224)
!205 = !DIExpression()
!206 = !DILocation(line: 78, column: 13, scope: !54)
!207 = !DILocation(line: 79, column: 9, scope: !54)
!208 = !DILocation(line: 79, column: 16, scope: !54)
!209 = !DILocation(line: 80, column: 9, scope: !54)
!210 = !DILocation(line: 80, column: 19, scope: !54)
!211 = !DILocation(line: 84, column: 9, scope: !54)
!212 = !DILocation(line: 84, column: 14, scope: !54)
!213 = !DILocation(line: 85, column: 9, scope: !54)
!214 = !DILocation(line: 85, column: 14, scope: !54)
!215 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !54, file: !1, line: 86, type: !61)
!216 = !DILocation(line: 86, column: 16, scope: !54)
!217 = !DILocation(line: 86, column: 26, scope: !54)
!218 = !DILocation(line: 90, column: 53, scope: !54)
!219 = !DILocation(line: 90, column: 19, scope: !54)
!220 = !DILocation(line: 90, column: 43, scope: !54)
!221 = !DILocation(line: 91, column: 1, scope: !54)
!222 = !DILocation(line: 106, column: 9, scope: !57)
!223 = !DILocation(line: 30, column: 36, scope: !32, inlinedAt: !224)
!224 = distinct !DILocation(line: 102, column: 28, scope: !57)
!225 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !57, file: !1, line: 94, type: !64)
!226 = !DILocation(line: 94, column: 67, scope: !57)
!227 = !DILocation(line: 96, column: 12, scope: !57)
!228 = !DILocation(line: 98, column: 10, scope: !57)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !57, file: !1, line: 98, type: !44)
!230 = !DILocation(line: 99, column: 50, scope: !57)
!231 = !DILocation(line: 99, column: 10, scope: !57)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStride", scope: !57, file: !1, line: 99, type: !44)
!233 = !DILocation(line: 100, column: 23, scope: !57)
!234 = !DILocation(line: 100, column: 40, scope: !57)
!235 = !DILocation(line: 100, column: 10, scope: !57)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseIndex", scope: !57, file: !1, line: 100, type: !44)
!237 = !DILocation(line: 102, column: 28, scope: !57)
!238 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !32, file: !1, line: 16, type: !44)
!239 = !DILocation(line: 16, column: 31, scope: !32, inlinedAt: !224)
!240 = !DILocation(line: 27, column: 49, scope: !32, inlinedAt: !224)
!241 = !DILocation(line: 27, column: 16, scope: !32, inlinedAt: !224)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !32, file: !1, line: 27, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !32, file: !1, line: 30, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !248, templateParams: !251)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !247, file: !1, line: 30, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !247, file: !1, line: 30, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!251 = !{!43, !12}
!252 = !DILocation(line: 30, column: 17, scope: !32, inlinedAt: !224)
!253 = !DILocation(line: 33, column: 28, scope: !254, inlinedAt: !224)
!254 = distinct !DILexicalBlock(scope: !32, file: !1, line: 33, column: 9)
!255 = !DILocation(line: 33, column: 9, scope: !32, inlinedAt: !224)
!256 = !DILocation(line: 35, column: 40, scope: !257, inlinedAt: !224)
!257 = distinct !DILexicalBlock(scope: !254, file: !1, line: 34, column: 5)
!258 = !DILocation(line: 35, column: 19, scope: !257, inlinedAt: !224)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !32, file: !1, line: 18, type: !35)
!260 = !DILocation(line: 18, column: 11, scope: !32, inlinedAt: !224)
!261 = !DILocation(line: 36, column: 41, scope: !257, inlinedAt: !224)
!262 = !DILocation(line: 36, column: 48, scope: !257, inlinedAt: !224)
!263 = !DILocation(line: 36, column: 19, scope: !257, inlinedAt: !224)
!264 = !DILocation(line: 37, column: 40, scope: !257, inlinedAt: !224)
!265 = !DILocation(line: 37, column: 19, scope: !257, inlinedAt: !224)
!266 = !DILocation(line: 38, column: 5, scope: !257, inlinedAt: !224)
!267 = !DILocation(line: 41, column: 41, scope: !268, inlinedAt: !224)
!268 = distinct !DILexicalBlock(scope: !254, file: !1, line: 40, column: 5)
!269 = !DILocation(line: 41, column: 48, scope: !268, inlinedAt: !224)
!270 = !DILocation(line: 41, column: 19, scope: !268, inlinedAt: !224)
!271 = !DILocation(line: 42, column: 40, scope: !268, inlinedAt: !224)
!272 = !DILocation(line: 42, column: 19, scope: !268, inlinedAt: !224)
!273 = !DILocation(line: 43, column: 41, scope: !268, inlinedAt: !224)
!274 = !DILocation(line: 43, column: 48, scope: !268, inlinedAt: !224)
!275 = !DILocation(line: 43, column: 19, scope: !268, inlinedAt: !224)
!276 = !DILocation(line: 46, column: 5, scope: !32, inlinedAt: !224)
!277 = !DILocation(line: 102, column: 17, scope: !57)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices3", scope: !57, file: !1, line: 102, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!280 = !DILocation(line: 105, column: 5, scope: !57)
!281 = !DILocation(line: 106, column: 31, scope: !57)
!282 = !DILocation(line: 107, column: 9, scope: !57)
!283 = !DILocation(line: 107, column: 31, scope: !57)
!284 = !DILocation(line: 108, column: 9, scope: !57)
!285 = !DILocation(line: 108, column: 31, scope: !57)
!286 = !DILocation(line: 114, column: 21, scope: !57)
!287 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !45, file: !1, line: 50, type: !51)
!288 = !DILocation(line: 50, column: 98, scope: !45, inlinedAt: !289)
!289 = distinct !DILocation(line: 114, column: 21, scope: !57)
!290 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vertexAttribute", arg: 1, scope: !45, file: !1, line: 50, type: !48)
!291 = !DILocation(line: 50, column: 40, scope: !45, inlinedAt: !289)
!292 = !{i32 0, i32 128, i32 3}
!293 = !{i32 32, i32 128, i32 3}
!294 = !{i32 64, i32 128, i32 3}
!295 = !DIExpression(DW_OP_bit_piece, 96, 32)
!296 = !{i32 96, i32 128, i32 3}
!297 = !DILocation(line: 52, column: 12, scope: !45, inlinedAt: !289)
!298 = !DILocation(line: 53, column: 14, scope: !45, inlinedAt: !289)
!299 = !DILocation(line: 53, column: 9, scope: !45, inlinedAt: !289)
!300 = !DILocation(line: 53, column: 32, scope: !45, inlinedAt: !289)
!301 = !DILocation(line: 53, column: 53, scope: !45, inlinedAt: !289)
!302 = !DILocation(line: 53, column: 51, scope: !45, inlinedAt: !289)
!303 = !DILocation(line: 53, column: 29, scope: !45, inlinedAt: !289)
!304 = !DILocation(line: 52, column: 31, scope: !45, inlinedAt: !289)
!305 = !DILocation(line: 54, column: 14, scope: !45, inlinedAt: !289)
!306 = !DILocation(line: 54, column: 9, scope: !45, inlinedAt: !289)
!307 = !DILocation(line: 54, column: 32, scope: !45, inlinedAt: !289)
