#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: e671a353c3a04b7edc868eaf99166107.pdb
; shader hash: e671a353c3a04b7edc868eaf99166107
;
; Buffer Definitions:
;
; Resource bind info for Vertices
; {
;
;   struct struct.VertexPositionNormalColorTexture
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float4 color;                                 ; Offset:   24
;       float2 uv;                                    ; Offset:   40
;   
;   } $Element;                                       ; Offset:    0 Size:    48
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; Scene_TLAS                        texture     i32         ras      T0      t0,space1     1
; Vertices                          texture  struct         r/o      T1      t2,space1     1
; gRenderTarget                         UAV     f32          2d      U0      u0,space1     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !68)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 64, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 44, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 67, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 67, size: 96, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !18, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !{!11, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 44, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 44, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32, !45, !54, !57, !65}
!32 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 13, type: !33, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !44}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !21}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !39)
!45 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 47, type: !46, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!22, !48, !51}
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 384, align: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 3)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 44, size: 64, align: 32, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !51, file: !1, line: 44, baseType: !5, size: 64, align: 32)
!54 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 62, type: !55, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 94, type: !58, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !64}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 55, size: 128, align: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !61, file: !1, line: 57, baseType: !22, size: 128, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 54, baseType: !51)
!65 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 120, type: !66, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !60}
!68 = !{!69, !71, !75}
!69 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 7, type: !70, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 7, size: 32, align: 32, elements: !2)
!71 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 8, type: !72, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 8, size: 128, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !23)
!75 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 10, type: !76, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 10, size: 384, align: 32, elements: !2, templateParams: !77)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "element", type: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !80, line: 37, size: 384, align: 32, elements: !81)
!80 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingHlslCompat.h", directory: "")
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !79, file: !80, line: 39, baseType: !14, size: 96, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !79, file: !80, line: 40, baseType: !14, size: 96, align: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !79, file: !80, line: 41, baseType: !22, size: 128, align: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !79, file: !80, line: 42, baseType: !4, size: 64, align: 32, offset: 320)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!89 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0A//ByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    //// ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    //// Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    //// aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    //// we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    //// based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    ////  Aligned:     { 0 1 | 2 - }\0D\0A    ////  Not aligned: { - 0 | 1 2 }\0D\0A    //const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    //// \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    //// int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    //const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset); \0D\0A \0D\0A    //// Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    //if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    //{\0D\0A    //    indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A    //    indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A    //    indices.z = four16BitIndices.y & 0xffff;\0D\0A    //}\0D\0A    //else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    //{\0D\0A    //    indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A    //    indices.y = four16BitIndices.y & 0xffff;\0D\0A    //    indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    //}\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float2 lerpValues = (float2) DispatchRaysIndex() / (float2) DispatchRaysDimensions();\0D\0A\0D\0A    // Orthographic projection since we're raytracing in screen space.\0D\0A    float3 rayDir = float3(0, 0, 1);\0D\0A    float3 origin = float3(\0D\0A        lerp(-1, 1, lerpValues.x),\0D\0A        lerp(-1, 1, lerpValues.y),\0D\0A        0.0f);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = float3(0, 0, 1);\0D\0A\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10000.0;\0D\0A    RayPayload payload = { float4(0, 0, 0, 0) };\0D\0A    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(0);\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = Vertices[0].color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float4 color = float4(0, 0, 0, 0);\0D\0A\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStride = indexSizeInBytes * 3;\0D\0A    uint iBaseIndex = PrimitiveIndex() * iTriangleIndexStride; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0A\0D\0A    const uint3 indices3 = Load3x16BitIndices(iBaseIndex);\0D\0A\0D\0A    float4 triangleColors[3] =\0D\0A    {\0D\0A        Vertices[indices3[0]].color,\0D\0A        Vertices[indices3[1]].color,\0D\0A        Vertices[indices3[2]].color,\0D\0A    };\0D\0A\0D\0A    \0D\0A\0D\0A\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColors, attr);\0D\0A    payload.color = Vertices[0].color;\0D\0A    //payload.color = float4(0, 0, 0, 0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!90 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!91 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct SceneConstantBuffer\0D\0A{\0D\0A    XMMATRIX projectionToWorld;\0D\0A    XMVECTOR cameraPosition;\0D\0A    XMVECTOR lightPosition;\0D\0A    XMVECTOR lightAmbientColor;\0D\0A    XMVECTOR lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct CubeConstantBuffer\0D\0A{\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!92 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!93 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!94 = !{i32 1, i32 3}
!95 = !{i32 1, i32 6}
!96 = !{!"lib", i32 6, i32 3}
!97 = !{!98, !103, null, null}
!98 = !{!99, !101}
!99 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !100}
!100 = !{i32 0, i32 4}
!101 = !{i32 1, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !102}
!102 = !{i32 1, i32 48}
!103 = !{!104}
!104 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !105}
!105 = !{i32 0, i32 9}
!106 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !107, %"class.RWTexture2D<vector<float, 4> >" undef, !109, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !111, %struct.VertexPositionNormalColorTexture undef, !113, %struct.BuiltInTriangleIntersectionAttributes undef, !118, %struct.RayDesc undef, !120, %struct.RayPayload undef, !125}
!107 = !{i32 4, !108}
!108 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!109 = !{i32 16, !110}
!110 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!111 = !{i32 56, !112}
!112 = !{i32 6, !"h", i32 3, i32 0}
!113 = !{i32 56, !114, !115, !116, !117}
!114 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!115 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!116 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!117 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!118 = !{i32 8, !119}
!119 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!120 = !{i32 32, !121, !122, !123, !124}
!121 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!122 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!123 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!124 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!125 = !{i32 16, !126}
!126 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!127 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !128, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !130, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !133}
!128 = !{!129}
!129 = !{i32 1, !2, !2}
!130 = !{!129, !131, !132}
!131 = !{i32 2, !2, !2}
!132 = !{i32 0, !2, !2}
!133 = !{!129, !131}
!134 = !{null, !"", null, !97, !135}
!135 = !{i32 0, i64 65553}
!136 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !137}
!137 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !138}
!138 = !{i32 0}
!139 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !140}
!140 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !138}
!141 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !142}
!142 = !{i32 8, i32 7, i32 5, !138}
!143 = !DILocation(line: 90, column: 45, scope: !54)
!144 = !DILocation(line: 84, column: 5, scope: !54)
!145 = !DILocation(line: 87, column: 5, scope: !54)
!146 = !DILocation(line: 64, column: 34, scope: !54)
!147 = !DILocation(line: 64, column: 65, scope: !54)
!148 = !DILocation(line: 64, column: 54, scope: !54)
!149 = !DILocation(line: 64, column: 12, scope: !54)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lerpValues", scope: !54, file: !1, line: 64, type: !4)
!151 = !DIExpression(DW_OP_bit_piece, 0, 32)
!152 = !DIExpression(DW_OP_bit_piece, 32, 32)
!153 = !DILocation(line: 67, column: 12, scope: !54)
!154 = !DILocation(line: 69, column: 9, scope: !54)
!155 = !DILocation(line: 70, column: 9, scope: !54)
!156 = !DILocation(line: 68, column: 12, scope: !54)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !54, file: !1, line: 68, type: !14)
!158 = !DIExpression(DW_OP_bit_piece, 64, 32)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !54, file: !1, line: 75, type: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 75, size: 256, align: 32, elements: !161)
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !160, file: !1, line: 75, baseType: !15, size: 96, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !160, file: !1, line: 75, baseType: !8, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !160, file: !1, line: 75, baseType: !15, size: 96, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !160, file: !1, line: 75, baseType: !8, size: 32, align: 32, offset: 224)
!166 = !DIExpression()
!167 = !DILocation(line: 75, column: 13, scope: !54)
!168 = !DILocation(line: 76, column: 9, scope: !54)
!169 = !DILocation(line: 76, column: 16, scope: !54)
!170 = !DILocation(line: 77, column: 9, scope: !54)
!171 = !DILocation(line: 77, column: 19, scope: !54)
!172 = !DILocation(line: 81, column: 9, scope: !54)
!173 = !DILocation(line: 81, column: 14, scope: !54)
!174 = !DILocation(line: 82, column: 9, scope: !54)
!175 = !DILocation(line: 82, column: 14, scope: !54)
!176 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !54, file: !1, line: 83, type: !61)
!177 = !DILocation(line: 83, column: 16, scope: !54)
!178 = !DILocation(line: 83, column: 26, scope: !54)
!179 = !DILocation(line: 87, column: 53, scope: !54)
!180 = !DILocation(line: 87, column: 19, scope: !54)
!181 = !DILocation(line: 87, column: 43, scope: !54)
!182 = !DILocation(line: 89, column: 28, scope: !54)
!183 = !DILocation(line: 43, column: 5, scope: !32, inlinedAt: !184)
!184 = distinct !DILocation(line: 89, column: 28, scope: !54)
!185 = !DILocation(line: 89, column: 17, scope: !54)
!186 = !DILocation(line: 90, column: 57, scope: !54)
!187 = !DILocation(line: 90, column: 19, scope: !54)
!188 = !DILocation(line: 90, column: 5, scope: !54)
!189 = !DILocation(line: 90, column: 43, scope: !54)
!190 = !DILocation(line: 91, column: 1, scope: !54)
!191 = !DILocation(line: 106, column: 9, scope: !57)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !57, file: !1, line: 94, type: !64)
!193 = !DILocation(line: 94, column: 67, scope: !57)
!194 = !DILocation(line: 96, column: 12, scope: !57)
!195 = !DILocation(line: 98, column: 10, scope: !57)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !57, file: !1, line: 98, type: !44)
!197 = !DILocation(line: 99, column: 10, scope: !57)
!198 = !DILocation(line: 100, column: 10, scope: !57)
!199 = !DILocation(line: 102, column: 28, scope: !57)
!200 = !DILocation(line: 43, column: 5, scope: !32, inlinedAt: !201)
!201 = distinct !DILocation(line: 102, column: 28, scope: !57)
!202 = !DILocation(line: 102, column: 17, scope: !57)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices3", scope: !57, file: !1, line: 102, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!205 = !DILocation(line: 105, column: 5, scope: !57)
!206 = !DILocation(line: 106, column: 31, scope: !57)
!207 = !DILocation(line: 107, column: 9, scope: !57)
!208 = !DILocation(line: 107, column: 31, scope: !57)
!209 = !DILocation(line: 108, column: 9, scope: !57)
!210 = !DILocation(line: 108, column: 31, scope: !57)
!211 = !DILocation(line: 114, column: 21, scope: !57)
!212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !45, file: !1, line: 47, type: !51)
!213 = !DILocation(line: 47, column: 98, scope: !45, inlinedAt: !214)
!214 = distinct !DILocation(line: 114, column: 21, scope: !57)
!215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vertexAttribute", arg: 1, scope: !45, file: !1, line: 47, type: !48)
!216 = !DILocation(line: 47, column: 40, scope: !45, inlinedAt: !214)
!217 = !{i32 0, i32 128, i32 3}
!218 = !{i32 32, i32 128, i32 3}
!219 = !{i32 64, i32 128, i32 3}
!220 = !DIExpression(DW_OP_bit_piece, 96, 32)
!221 = !{i32 96, i32 128, i32 3}
!222 = !DILocation(line: 49, column: 5, scope: !45, inlinedAt: !214)
!223 = !DILocation(line: 114, column: 19, scope: !57)
!224 = !DILocation(line: 115, column: 21, scope: !57)
!225 = !DILocation(line: 115, column: 33, scope: !57)
!226 = !DILocation(line: 115, column: 19, scope: !57)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !57, file: !1, line: 94, type: !61)
!228 = !DILocation(line: 94, column: 42, scope: !57)
!229 = !DILocation(line: 117, column: 1, scope: !57)
