#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: b7aab82989a0ad86c533109a9a508eb8.pdb
; shader hash: b7aab82989a0ad86c533109a9a508eb8
;
; Buffer Definitions:
;
; cbuffer g_sceneCB
; {
;
;   struct g_sceneCB
;   {
;
;       struct struct.DXR_Scene_CB
;       {
;
;           column_major float4x4 viewProjectionInv;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 lightPosition;                     ; Offset:   80
;           float4 lightAmbientColor;                 ; Offset:   96
;           float4 lightDiffuseColor;                 ; Offset:  112
;       
;       } g_sceneCB;                                  ; Offset:    0
;
;   
;   } g_sceneCB;                                      ; Offset:    0 Size:   128
;
; }
;
; cbuffer l_ObjectCB_Static
; {
;
;   struct l_ObjectCB_Static
;   {
;
;       struct struct.OBJECT_CB_STATIC_Arr
;       {
;
;           struct struct.OBJECT_CB_STATIC
;           {
;
;               uint startIndex_in_IB_SRV;            ; Offset:    0
;               uint startIndex_in_VB_SRV;            ; Offset:    4
;               float2 padding;                       ; Offset:    8
;               float4 albedo;                        ; Offset:   16
;           
;           } object_cb_static[3];;                   ; Offset:    0
;
;       
;       } l_ObjectCB_Static;                          ; Offset:    0
;
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !30, globals: !140)
!1 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Enum", scope: !5, file: !4, line: 85, size: 32, align: 32, elements: !6)
!4 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingDefines.h", directory: "")
!5 = !DINamespace(name: "RayType", scope: null, file: !4, line: 84)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "Radiance", value: 0)
!8 = !DIEnumerator(name: "Count", value: 1)
!9 = !{!10, !22}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 40, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 40, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 83, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 83, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 83, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!19, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 3)
!30 = !{!31, !47, !62, !66, !98, !101, !111, !114, !117, !127, !130}
!31 = !DISubprogram(name: "Load3x16BitIndices", linkageName: "\01?Load3x16BitIndices@@YA?AV?$vector@I$02@@UByteAddressBuffer@@I@Z", scope: !32, file: !32, line: 9, type: !33, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/RaytracingFunctions.hlsli", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !44, !46}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !29}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, size: 32, align: 32, elements: !45)
!45 = !{}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !39)
!47 = !DISubprogram(name: "Apply_Barycentric_Float4", linkageName: "\01?Apply_Barycentric_Float4@@YA?AV?$vector@M$03@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !32, file: !32, line: 78, type: !48, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!10, !50, !53}
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 384, align: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 3)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 40, size: 64, align: 32, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !53, file: !1, line: 40, baseType: !56, size: 64, align: 32)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !57, templateParams: !60)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, line: 40, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, line: 40, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !{!19, !61}
!61 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 2)
!62 = !DISubprogram(name: "Apply_Barycentric_Float3", linkageName: "\01?Apply_Barycentric_Float3@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !32, file: !32, line: 84, type: !63, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!22, !65, !53}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 288, align: 32, elements: !51)
!66 = !DISubprogram(name: "CalculateDiffuseLighting", linkageName: "\01?CalculateDiffuseLighting@@YA?AV?$vector@M$03@@UDXR_Scene_CB@@V?$vector@M$02@@1@Z", scope: !32, file: !32, line: 91, type: !67, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!10, !69, !22, !22}
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "DXR_Scene_CB", file: !4, line: 33, size: 1024, align: 32, elements: !70)
!70 = !{!71, !94, !95, !96, !97}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjectionInv", scope: !69, file: !4, line: 35, baseType: !72, size: 512, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 89, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 89, size: 512, align: 32, elements: !74, templateParams: !91)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !73, file: !1, line: 89, baseType: !14, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!91 = !{!19, !92, !93}
!92 = !DITemplateValueParameter(name: "row_count", type: !21, value: i32 4)
!93 = !DITemplateValueParameter(name: "col_count", type: !21, value: i32 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !69, file: !4, line: 36, baseType: !10, size: 128, align: 32, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "lightPosition", scope: !69, file: !4, line: 37, baseType: !10, size: 128, align: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lightAmbientColor", scope: !69, file: !4, line: 38, baseType: !10, size: 128, align: 32, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lightDiffuseColor", scope: !69, file: !4, line: 39, baseType: !10, size: 128, align: 32, offset: 896)
!98 = !DISubprogram(name: "FresnelReflectanceSchlick", linkageName: "\01?FresnelReflectanceSchlick@@YA?AV?$vector@M$02@@V1@00@Z", scope: !32, file: !32, line: 101, type: !99, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DISubroutineType(types: !100)
!100 = !{!22, !22, !22, !22}
!101 = !DISubprogram(name: "TraceRadianceRay", linkageName: "\01?TraceRadianceRay@@YA?AV?$vector@M$03@@URaytracingAccelerationStructure@@UMyRay@@I@Z", scope: !1, file: !1, line: 19, type: !102, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!102 = !DISubroutineType(types: !103)
!103 = !{!10, !104, !105, !109}
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 105, size: 32, align: 32, elements: !45)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRay", file: !4, line: 72, size: 192, align: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !105, file: !4, line: 74, baseType: !22, size: 96, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !105, file: !4, line: 75, baseType: !22, size: 96, align: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT", file: !110, line: 19, baseType: !46)
!110 = !DIFile(filename: "..\5CBin\5CShader\5CStaticCompiled/HlslCompat.h", directory: "")
!111 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 50, type: !112, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 91, type: !115, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DISubroutineType(types: !116)
!116 = !{!22}
!117 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 97, type: !118, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120, !126}
!120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyRayPayload", file: !4, line: 77, size: 160, align: 32, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !121, file: !4, line: 79, baseType: !124, size: 128, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !110, line: 16, baseType: !10)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "recursionDepth", scope: !121, file: !4, line: 80, baseType: !109, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !32, line: 6, baseType: !53)
!127 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXUMyRayPayload@@@Z", scope: !1, file: !1, line: 155, type: !128, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z")
!128 = !DISubroutineType(types: !129)
!129 = !{null, !120}
!130 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YA?AUMyRay@@V?$vector@H$01@@V?$vector@M$02@@V?$matrix@M$03$03@@@Z", scope: !32, file: !32, line: 58, type: !131, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!131 = !DISubroutineType(types: !132)
!132 = !{!105, !133, !22, !72}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 16, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 16, size: 64, align: 32, elements: !135, templateParams: !138)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !134, file: !1, line: 16, baseType: !21, size: 32, align: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !134, file: !1, line: 16, baseType: !21, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!138 = !{!139, !61}
!139 = !DITemplateTypeParameter(name: "element", type: !21)
!140 = !{!141, !145, !146, !148, !149, !153, !154, !156, !157, !161, !162, !173, !177, !191}
!141 = !DIGlobalVariable(name: "GeometryStride", scope: !142, file: !4, line: 101, type: !144, isLocal: true, isDefinition: true, variable: i32 1)
!142 = !DINamespace(name: "HitGroup", scope: !143, file: !4, line: 95)
!143 = !DINamespace(name: "TraceRayParameters", scope: null, file: !4, line: 92)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!145 = !DIGlobalVariable(name: "InstanceMask", scope: !143, file: !4, line: 94, type: !144, isLocal: true, isDefinition: true, variable: i32 -1)
!146 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 37, type: !147, isLocal: true, isDefinition: true, variable: i32 16)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!148 = !DIGlobalVariable(name: "InstanceMask", linkageName: "\01?InstanceMask@TraceRayParameters@@3IB", scope: !143, file: !4, line: 94, type: !144, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@HitGroup@TraceRayParameters@@3QBIB", scope: !142, file: !4, line: 96, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 32, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIGlobalVariable(name: "GeometryStride", linkageName: "\01?GeometryStride@HitGroup@TraceRayParameters@@3IB", scope: !142, file: !4, line: 101, type: !144, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariable(name: "Offset", linkageName: "\01?Offset@MissShader@TraceRayParameters@@3QBIB", scope: !155, file: !4, line: 104, type: !150, isLocal: true, isDefinition: true)
!155 = !DINamespace(name: "MissShader", scope: !143, file: !4, line: 103)
!156 = !DIGlobalVariable(name: "Scene_TLAS", linkageName: "\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !104, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A")
!157 = !DIGlobalVariable(name: "gRenderTarget", linkageName: "\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !158, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !45, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !11)
!161 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 10, type: !44, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!162 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", scope: !0, file: !1, line: 11, type: !163, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A")
!163 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexPositionNormalColorTexture>", file: !1, line: 11, size: 384, align: 32, elements: !45, templateParams: !164)
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "element", type: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalColorTexture", file: !4, line: 64, size: 384, align: 32, elements: !167)
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !166, file: !4, line: 66, baseType: !22, size: 96, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !166, file: !4, line: 67, baseType: !22, size: 96, align: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !166, file: !4, line: 68, baseType: !10, size: 128, align: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !166, file: !4, line: 69, baseType: !172, size: 64, align: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !56)
!173 = !DIGlobalVariable(name: "g_sceneCB", linkageName: "\01?g_sceneCB@@3U?$ConstantBuffer@UDXR_Scene_CB@@@@A", scope: !0, file: !1, line: 12, type: !174, isLocal: false, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DXR_Scene_CB>", file: !1, line: 12, size: 32, align: 32, elements: !45, templateParams: !175)
!175 = !{!176}
!176 = !DITemplateTypeParameter(name: "T", type: !69)
!177 = !DIGlobalVariable(name: "l_ObjectCB_Static", linkageName: "\01?l_ObjectCB_Static@@3U?$ConstantBuffer@UOBJECT_CB_STATIC_Arr@@@@A", scope: !0, file: !1, line: 15, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_STATIC_Arr>", file: !1, line: 15, size: 32, align: 32, elements: !45, templateParams: !179)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC_Arr", file: !4, line: 49, size: 768, align: 32, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_static", scope: !181, file: !4, line: 51, baseType: !184, size: 768, align: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 768, align: 32, elements: !51)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_STATIC", file: !4, line: 42, size: 256, align: 32, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_IB_SRV", scope: !185, file: !4, line: 44, baseType: !109, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "startIndex_in_VB_SRV", scope: !185, file: !4, line: 45, baseType: !109, size: 32, align: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !185, file: !4, line: 46, baseType: !172, size: 64, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !185, file: !4, line: 47, baseType: !124, size: 128, align: 32, offset: 128)
!191 = !DIGlobalVariable(name: "l_ObjectCB_Dynamic", linkageName: "\01?l_ObjectCB_Dynamic@@3U?$ConstantBuffer@UOBJECT_CB_DYNAMIC_Arr@@@@A", scope: !0, file: !1, line: 16, type: !192, isLocal: false, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<OBJECT_CB_DYNAMIC_Arr>", file: !1, line: 16, size: 32, align: 32, elements: !45, templateParams: !193)
!193 = !{!194}
!194 = !DITemplateTypeParameter(name: "T", type: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_DYNAMIC_Arr", file: !4, line: 59, size: 1536, align: 32, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "object_cb_dynamic", scope: !195, file: !4, line: 61, baseType: !198, size: 1536, align: 32)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 1536, align: 32, elements: !51)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "OBJECT_CB_DYNAMIC", file: !4, line: 54, size: 512, align: 32, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "InvTranspose", scope: !199, file: !4, line: 56, baseType: !72, size: 512, align: 32)
!202 = !{i32 2, !"Dwarf Version", i32 4}
!203 = !{i32 2, !"Debug Info Version", i32 3}
!204 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!205 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingFunctions.hlsli\22\0D\0A\0D\0A// Global RootSig\0D\0ARaytracingAccelerationStructure Scene_TLAS : register(t0, space1);\0D\0ARWTexture2D<float4> gRenderTarget : register(u0, space1);\0D\0AByteAddressBuffer Indices : register(t1, space1);\0D\0AStructuredBuffer<VertexPositionNormalColorTexture> Vertices : register(t2, space1);\0D\0AConstantBuffer<DXR_Scene_CB> g_sceneCB : register(b0, space1);\0D\0A\0D\0A// Local RootSig\0D\0AConstantBuffer<OBJECT_CB_STATIC_Arr> l_ObjectCB_Static : register(b1, space1);\0D\0AConstantBuffer<OBJECT_CB_DYNAMIC_Arr> l_ObjectCB_Dynamic : register(b2, space1);\0D\0A\0D\0A// Trace a radiance ray into the scene and returns a shaded color.\0D\0Afloat4 TraceRadianceRay(RaytracingAccelerationStructure scene, in MyRay ray, in UINT currentRayRecursionDepth)\0D\0A{\0D\0A    if (currentRayRecursionDepth >= MAX_RAY_RECURSION_DEPTH)\0D\0A    {\0D\0A        return float4(0, 0, 0, 0);\0D\0A    }\0D\0A//----------------------\0D\0A\09// Set the ray's extents.\0D\0A    RayDesc rayDesc;\0D\0A    rayDesc.Origin = ray.origin;\0D\0A\09rayDesc.Direction = ray.direction;\0D\0A\09// Set TMin to a zero value to avoid aliasing artifacts along contact areas.\0D\0A\09// Note: make sure to enable face culling so as to avoid surface face fighting.\0D\0A    rayDesc.TMin = 0.001;\0D\0A    rayDesc.TMax = 10000;\0D\0A    MyRayPayload rayPayload = { float4(0, 0, 0, 0), currentRayRecursionDepth + 1 };\0D\0A\0D\0A    TraceRay(scene,\0D\0A    RAY_FLAG_CULL_BACK_FACING_TRIANGLES,\0D\0A    //0,\0D\0A    TraceRayParameters::InstanceMask,\0D\0A    TraceRayParameters::HitGroup::Offset[RayType::Radiance],\0D\0A    TraceRayParameters::HitGroup::GeometryStride,\0D\0A    TraceRayParameters::MissShader::Offset[RayType::Radiance],\0D\0A    rayDesc,\0D\0A    rayPayload);\0D\0A\0D\0A    return rayPayload.color;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    //    float3 rayDir;\0D\0A    //    float3 origin;\0D\0A    \0D\0A    //// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    //    GenerateCameraRay(g_sceneCB, DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    //// Trace the ray.\0D\0A    //// Set the ray's extents.\0D\0A    //    RayDesc rayDesc;\0D\0A    //    rayDesc.Origin = origin;\0D\0A    //    rayDesc.Direction = rayDir;\0D\0A    //// Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    //// TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    //    rayDesc.TMin = 0.001;\0D\0A    //    rayDesc.TMax = 10000.0;\0D\0A    //    MyRayPayload payload = { float4(0, 0, 0, 0), 2 };\0D\0A    ////TraceRay(Scene_TLAS, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A    //    TraceRay(Scene_TLAS, 0, ~0, 0, 1, 0, rayDesc, payload);\0D\0A\0D\0A    ////// Cast a ray into the scene and retrieve a shaded color.\0D\0A    ////UINT currentRecursionDepth = 0;\0D\0A    ////float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    //// Write the raytraced color to the output texture.\0D\0A    //    gRenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A\0D\0A\0D\0A    //------------------------\0D\0A\09// Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    MyRay ray = GenerateCameraRay(DispatchRaysIndex().xy, g_sceneCB.cameraPosition.xyz, g_sceneCB.viewProjectionInv);\0D\0A \0D\0A    // Cast a ray into the scene and retrieve a shaded color.\0D\0A    UINT currentRecursionDepth = 0;\0D\0A    float4 color = TraceRadianceRay(Scene_TLAS, ray, currentRecursionDepth);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    gRenderTarget[DispatchRaysIndex().xy] = color;\0D\0A}\0D\0A\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout MyRayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    uint indexSizeInBytes = 2; // UINT16\0D\0A    uint iTriangleIndexStrideInBytes = indexSizeInBytes * 3;\0D\0A    uint iBaseOffsetInBytes = (l_ObjectCB_Static.object_cb_static[InstanceIndex()].startIndex_in_IB_SRV / 3 + PrimitiveIndex())\0D\0A     * iTriangleIndexStrideInBytes; // \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset (\EB\B0\94\EC\9D\B4\ED\8A\B8 \EB\8B\A8\EC\9C\84)\0D\0A    \0D\0A    uint startIndex_in_VB_SRV = l_ObjectCB_Static.object_cb_static[InstanceIndex()].startIndex_in_VB_SRV; //0 or 24\0D\0A    const uint3 indices3 = Load3x16BitIndices(Indices, iBaseOffsetInBytes);\0D\0A\0D\0A    float4 triangleColorArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[1]].color,\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[2]].color\0D\0A    };\0D\0A\0D\0A    float3 vertexNormalArr[3] =\0D\0A    {\0D\0A        Vertices[startIndex_in_VB_SRV + indices3[0]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[1]].normal,\0D\0A\09\09Vertices[startIndex_in_VB_SRV + indices3[2]].normal\0D\0A    };\0D\0A\0D\0A    float3 hitWorldPos = WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A\0D\0A    float3 triangleNormal = Apply_Barycentric_Float3(vertexNormalArr, attr);\0D\0A\0D\0A    triangleNormal = mul(triangleNormal, l_ObjectCB_Dynamic.object_cb_dynamic[InstanceIndex()].InvTranspose).xyz;\0D\0A    triangleNormal = normalize(triangleNormal);\0D\0A\0D\0A        \0D\0A\0D\0A    float4 reflectedColor = float4(0, 0, 0, 0);\0D\0A    if (true)\0D\0A    {\0D\0A   // Trace a reflection ray.\0D\0A        MyRay reflectionRay = { HitWorldPosition(), reflect(WorldRayDirection(), triangleNormal) };\0D\0A        float4 reflectionColor = TraceRadianceRay(Scene_TLAS, reflectionRay, payload.recursionDepth);\0D\0A\0D\0A        float3 fresnelR = FresnelReflectanceSchlick(WorldRayDirection(), triangleNormal, float3(0.9f, 0.9f, 0.9f) /*albedo*/);\0D\0A        reflectedColor = 0.25f /*reflectanceCoef*/ * float4(fresnelR, 1) * reflectionColor;\0D\0A    }\0D\0A\0D\0A\0D\0A    float4 diffuseColor = CalculateDiffuseLighting(g_sceneCB, hitWorldPos, triangleNormal);\0D\0A    float4 lightColor = diffuseColor + g_sceneCB.lightAmbientColor;\0D\0A    //payload.color = Apply_Barycentric_Float4(triangleColorArr, attr) * lightColor;\0D\0A    payload.color = l_ObjectCB_Static.object_cb_static[InstanceIndex()].albedo; // for debug albedo\0D\0A    payload.color = Apply_Barycentric_Float4(triangleColorArr, attr);\0D\0A\0D\0A   \0D\0A\0D\0A        payload.color += reflectedColor;\0D\0A\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout MyRayPayload payload)\0D\0A{\0D\0A    float4 background = float4(0.8f, 1.f, 1.f, 1.000000000f);\0D\0A    payload.color = background;\0D\0A\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!206 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!207 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingDefines.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_DEFINES\0D\0A#define RAYTRACING_DEFINES\0D\0A\0D\0A#define MAX_RAY_RECURSION_DEPTH 2\0D\0A#define NUM_OBJECTS 3 // TODO \EA\B0\9C\EC\88\98 TEMP\0D\0A//#define MAX_RAY_RECURSION_DEPTH 3    // ~ primary rays + reflections + shadow rays from reflected geometry.\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0A\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct DXR_Scene_CB\0D\0A{\0D\0A\09float4x4 viewProjectionInv;\0D\0A    float4 cameraPosition;\0D\0A    float4 lightPosition;\0D\0A    float4 lightAmbientColor;\0D\0A    float4 lightDiffuseColor;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_STATIC\0D\0A{\0D\0A    UINT startIndex_in_IB_SRV; // Index Buffer ShaderResourceView\EC\9D\98 \EC\8B\9C\EC\9E\91 \EC\9D\B8\EB\8D\B1\EC\8A\A4\0D\0A    UINT startIndex_in_VB_SRV;\0D\0A    float2 padding;\0D\0A    XMFLOAT4 albedo;\0D\0A};\0D\0Astruct OBJECT_CB_STATIC_Arr\0D\0A{\0D\0A    OBJECT_CB_STATIC object_cb_static[NUM_OBJECTS];\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_DYNAMIC\0D\0A{\0D\0A    float4x4 InvTranspose;\0D\0A};\0D\0A\0D\0Astruct OBJECT_CB_DYNAMIC_Arr\0D\0A{\0D\0A    OBJECT_CB_DYNAMIC object_cb_dynamic[NUM_OBJECTS];\0D\0A};\0D\0A\0D\0Astruct VertexPositionNormalColorTexture\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float4 color;\0D\0A    float2 uv;\0D\0A};\0D\0A\0D\0Astruct MyRay\0D\0A{\0D\0A    float3 origin;\0D\0A    float3 direction;\0D\0A};\0D\0Astruct MyRayPayload\0D\0A{\0D\0A    XMFLOAT4 color;\0D\0A    UINT   recursionDepth;\0D\0A};\0D\0A\0D\0A// Ray types traced\0D\0Anamespace RayType {\0D\0A    enum Enum {\0D\0A        Radiance = 0,   // ~ Primary, reflected camera/view rays calculating color for each hit.\0D\0A        //Shadow,         // ~ Shadow/visibility rays, only testing for occlusion\0D\0A        Count\0D\0A    };\0D\0A}\0D\0A\0D\0Anamespace TraceRayParameters\0D\0A{\0D\0A    static const UINT InstanceMask = ~0;   // Everything is visible.\0D\0A    namespace HitGroup {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A        static const UINT GeometryStride = RayType::Count;\0D\0A    }\0D\0A    namespace MissShader {\0D\0A        static const UINT Offset[RayType::Count] =\0D\0A        {\0D\0A            0, // Radiance ray\0D\0A            //1  // Shadow ray\0D\0A        };\0D\0A    }\0D\0A}\0D\0A#endif // RAYTRACING_DEFINES"}
!208 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracingFunctions.hlsli", !"#ifndef RAYTRACING_FUNCTIONS\0D\0A#define RAYTRACING_FUNCTIONS\0D\0A\0D\0A\0D\0A#include \22RaytracingDefines.h\22\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0A\0D\0A// offsetBytes : \EC\82\BC\EA\B0\81\ED\98\95\EC\9D\98 \EC\B2\AB \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C\EC\9D\98 offset\0D\0Auint3 Load3x16BitIndices(ByteAddressBuffer Indices,uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3; // offsetBytes\EB\A5\BC 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\A1\9C \EB\A7\8C\EB\93\A4\EA\B8\B0\0D\0A    // \EC\98\A4\ED\94\84\EC\85\8B \EA\B8\B0\EB\B0\98 2\EA\B0\9C int \EB\A1\9C\EB\93\9C\0D\0A    // int 2\EA\B0\9C\EB\A5\BC \EB\A1\9C\EB\93\9C\ED\96\88\EC\A7\80\EB\A7\8C, UINT16\EC\9C\BC\EB\A1\9C \EC\A0\80\EC\9E\A5\ED\96\88\EA\B8\B0 \EB\95\8C\EB\AC\B8\EC\97\90 \EC\8B\A4\EC\A7\88\EC\A0\81\EC\9C\BC\EB\A1\A0 4\EA\B0\9C\EA\B0\80 \EB\A1\9C\EB\93\9C \EB\90\A8\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A \0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes) // \EC\9D\B8\EC\9E\90\EB\A1\9C \EB\93\A4\EC\96\B4\EC\98\A8 \EC\9D\B8\EB\8D\B1\EC\8A\A4 \EC\9B\90\EC\86\8C \EC\B2\AB \EC\98\A4\ED\94\84\EC\85\8B\EC\9D\B4 4\EC\9D\98 \EB\B0\B0\EC\88\98\EB\9D\BC\EB\A9\B4\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff; //32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EC\95\9E\EC\9D\98 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff; // 32\EB\B9\84\ED\8A\B8 \EC\A4\91 \EB\92\A4 16\EB\B9\84\ED\8A\B8 \EB\BD\91\EC\95\84\EC\98\B4\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    }\0D\0A    else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(DXR_Scene_CB sceneCB, uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray\0D\0A    float4 world = mul(float4(screenPos, 0, 1), sceneCB.viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A    origin = sceneCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin); // \EC\B9\B4\EB\A9\94\EB\9D\BC\EC\97\90\EC\84\9C \ED\94\BD\EC\85\80(\EC\9B\94\EB\93\9C) \EB\B0\A9\ED\96\A5\0D\0A}\0D\0A\0D\0A// Generate a ray in world space for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0Ainline MyRay GenerateCameraRay(int2 index, in float3 cameraPosition, in float4x4 viewProjectionInv)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A\09// Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A\09// Unproject the pixel coordinate into a world positon.\0D\0A    float4 world = mul(float4(screenPos, 0, 1), viewProjectionInv);\0D\0A    world.xyz /= world.w;\0D\0A\0D\0A    MyRay ray;\0D\0A    ray.origin = cameraPosition;\0D\0A    ray.direction = normalize(world.xyz - ray.origin);\0D\0A\0D\0A    return ray;\0D\0A}\0D\0A\0D\0A// \EB\AC\B4\EA\B2\8C\EC\A4\91\EC\8B\AC \EA\B0\80\EC\A4\91\EC\B9\98 \EC\A0\81\EC\9A\A9\0D\0Afloat4 Apply_Barycentric_Float4(float4 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0Afloat3 Apply_Barycentric_Float3(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0Afloat4 CalculateDiffuseLighting(DXR_Scene_CB sceneCB, float3 hitWorldPos, float3 normal)\0D\0A{\0D\0A    float3 pixelToLight = normalize(sceneCB.lightPosition.xyz - hitWorldPos);\0D\0A\0D\0A    float fNDotL = max(0.f, dot(pixelToLight, normal)); // \EB\9E\8C\EB\B2\84\ED\8A\B8\0D\0A\0D\0A    return sceneCB.lightDiffuseColor * fNDotL; // TODO : LocalRootSig\EC\9D\98 \EC\98\A4\EB\B8\8C\EC\A0\9D\ED\8A\B8 \EC\95\8C\EB\B2\A0\EB\8F\84 \EC\A0\81\EC\9A\A9\0D\0A}\0D\0A\0D\0A// Fresnel reflectance - schlick approximation.\0D\0Afloat3 FresnelReflectanceSchlick(in float3 I, in float3 N, in float3 f0)\0D\0A{\0D\0A    float cosi = saturate(dot(-I, N));\0D\0A    return f0 + (1 - f0) * pow(1 - cosi, 5);\0D\0A}\0D\0A\0D\0A#endif\0D\0A"}
!209 = !{!"..\5CBin\5CShader\5CStaticCompiled\5CRaytracing.hlsl"}
!210 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/I", !"D:\5CProjects\5CGit\5CMyProjects\5CMyDX12Engine\5CEngine\5CBin\5CShader\5CStaticCompiled", !"/Fo", !"..\5CBin\5CRaytracing.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!211 = !{i32 1, i32 3}
!212 = !{i32 1, i32 6}
!213 = !{!"lib", i32 6, i32 3}
!214 = !{!215, !221, !224, null}
!215 = !{!216, !218, !219}
!216 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene_TLAS@@3URaytracingAccelerationStructure@@A", !"Scene_TLAS", i32 1, i32 0, i32 1, i32 16, i32 0, !217}
!217 = !{i32 0, i32 4}
!218 = !{i32 1, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 1, i32 1, i32 1, i32 11, i32 0, null}
!219 = !{i32 2, %"class.StructuredBuffer<VertexPositionNormalColorTexture>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexPositionNormalColorTexture@@@@A", !"Vertices", i32 1, i32 2, i32 1, i32 12, i32 0, !220}
!220 = !{i32 1, i32 48}
!221 = !{!222}
!222 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?gRenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"gRenderTarget", i32 1, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !223}
!223 = !{i32 0, i32 9}
!224 = !{!225, !226, !227}
!225 = !{i32 0, %g_sceneCB* @g_sceneCB, !"g_sceneCB", i32 1, i32 0, i32 1, i32 128, null}
!226 = !{i32 1, %l_ObjectCB_Static* @l_ObjectCB_Static, !"l_ObjectCB_Static", i32 1, i32 1, i32 1, i32 96, null}
!227 = !{i32 2, %l_ObjectCB_Dynamic* @l_ObjectCB_Dynamic, !"l_ObjectCB_Dynamic", i32 1, i32 2, i32 1, i32 192, null}
!228 = !{i32 0, %struct.ByteAddressBuffer undef, !229, %struct.BuiltInTriangleIntersectionAttributes undef, !231, %struct.DXR_Scene_CB undef, !233, %struct.RaytracingAccelerationStructure undef, !229, %"class.RWTexture2D<vector<float, 4> >" undef, !240, %"class.StructuredBuffer<VertexPositionNormalColorTexture>" undef, !242, %struct.VertexPositionNormalColorTexture undef, !244, %struct.OBJECT_CB_STATIC_Arr undef, !249, %struct.OBJECT_CB_STATIC undef, !251, %struct.OBJECT_CB_DYNAMIC_Arr undef, !256, %struct.OBJECT_CB_DYNAMIC undef, !258, %struct.MyRay undef, !260, %struct.RayDesc undef, !263, %struct.MyRayPayload undef, !268, %g_sceneCB undef, !271, %l_ObjectCB_Static undef, !273, %l_ObjectCB_Dynamic undef, !275}
!229 = !{i32 4, !230}
!230 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!231 = !{i32 8, !232}
!232 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!233 = !{i32 128, !234, !236, !237, !238, !239}
!234 = !{i32 6, !"viewProjectionInv", i32 2, !235, i32 3, i32 0, i32 7, i32 9}
!235 = !{i32 4, i32 4, i32 2}
!236 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!237 = !{i32 6, !"lightPosition", i32 3, i32 80, i32 7, i32 9}
!238 = !{i32 6, !"lightAmbientColor", i32 3, i32 96, i32 7, i32 9}
!239 = !{i32 6, !"lightDiffuseColor", i32 3, i32 112, i32 7, i32 9}
!240 = !{i32 16, !241}
!241 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!242 = !{i32 56, !243}
!243 = !{i32 6, !"h", i32 3, i32 0}
!244 = !{i32 56, !245, !246, !247, !248}
!245 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!246 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!247 = !{i32 6, !"color", i32 3, i32 32, i32 7, i32 9}
!248 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!249 = !{i32 96, !250}
!250 = !{i32 6, !"object_cb_static", i32 3, i32 0}
!251 = !{i32 32, !252, !253, !254, !255}
!252 = !{i32 6, !"startIndex_in_IB_SRV", i32 3, i32 0, i32 7, i32 5}
!253 = !{i32 6, !"startIndex_in_VB_SRV", i32 3, i32 4, i32 7, i32 5}
!254 = !{i32 6, !"padding", i32 3, i32 8, i32 7, i32 9}
!255 = !{i32 6, !"albedo", i32 3, i32 16, i32 7, i32 9}
!256 = !{i32 192, !257}
!257 = !{i32 6, !"object_cb_dynamic", i32 3, i32 0}
!258 = !{i32 64, !259}
!259 = !{i32 6, !"InvTranspose", i32 2, !235, i32 3, i32 0, i32 7, i32 9}
!260 = !{i32 28, !261, !262}
!261 = !{i32 6, !"origin", i32 3, i32 0, i32 7, i32 9}
!262 = !{i32 6, !"direction", i32 3, i32 16, i32 7, i32 9}
!263 = !{i32 32, !264, !265, !266, !267}
!264 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!265 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!266 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!267 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!268 = !{i32 20, !269, !270}
!269 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!270 = !{i32 6, !"recursionDepth", i32 3, i32 16, i32 7, i32 5}
!271 = !{i32 128, !272}
!272 = !{i32 6, !"g_sceneCB", i32 3, i32 0}
!273 = !{i32 96, !274}
!274 = !{i32 6, !"l_ObjectCB_Static", i32 3, i32 0}
!275 = !{i32 192, !276}
!276 = !{i32 6, !"l_ObjectCB_Dynamic", i32 3, i32 0}
!277 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !278, void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !280, void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !283}
!278 = !{!279}
!279 = !{i32 1, !45, !45}
!280 = !{!279, !281, !282}
!281 = !{i32 2, !45, !45}
!282 = !{i32 0, !45, !45}
!283 = !{!279, !281}
!284 = !{null, !"", null, !214, !285}
!285 = !{i32 0, i64 65553}
!286 = !{void (%struct.MyRayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXUMyRayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !287}
!287 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !288}
!288 = !{i32 0}
!289 = !{void (%struct.MyRayPayload*)* @"\01?MyMissShader@@YAXUMyRayPayload@@@Z", !"\01?MyMissShader@@YAXUMyRayPayload@@@Z", null, null, !290}
!290 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !288}
!291 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !292}
!292 = !{i32 8, i32 7, i32 5, !288}
!293 = !DILocation(line: 36, column: 5, scope: !101, inlinedAt: !294)
!294 = distinct !DILocation(line: 85, column: 20, scope: !111)
!295 = !DILocation(line: 88, column: 5, scope: !111)
!296 = !DILocation(line: 81, column: 99, scope: !111)
!297 = !DILocation(line: 81, column: 59, scope: !111)
!298 = !DILocation(line: 81, column: 35, scope: !111)
!299 = !DILocation(line: 81, column: 17, scope: !111)
!300 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "viewProjectionInv", arg: 3, scope: !130, file: !32, line: 58, type: !72)
!301 = !DIExpression(DW_OP_bit_piece, 0, 32)
!302 = !DILocation(line: 58, column: 82, scope: !130, inlinedAt: !303)
!303 = distinct !DILocation(line: 81, column: 17, scope: !111)
!304 = !DIExpression(DW_OP_bit_piece, 32, 32)
!305 = !DIExpression(DW_OP_bit_piece, 64, 32)
!306 = !DIExpression(DW_OP_bit_piece, 96, 32)
!307 = !DIExpression(DW_OP_bit_piece, 128, 32)
!308 = !DIExpression(DW_OP_bit_piece, 160, 32)
!309 = !DIExpression(DW_OP_bit_piece, 192, 32)
!310 = !DIExpression(DW_OP_bit_piece, 224, 32)
!311 = !DIExpression(DW_OP_bit_piece, 256, 32)
!312 = !DIExpression(DW_OP_bit_piece, 288, 32)
!313 = !DIExpression(DW_OP_bit_piece, 320, 32)
!314 = !DIExpression(DW_OP_bit_piece, 352, 32)
!315 = !DIExpression(DW_OP_bit_piece, 384, 32)
!316 = !DIExpression(DW_OP_bit_piece, 416, 32)
!317 = !DIExpression(DW_OP_bit_piece, 448, 32)
!318 = !DIExpression(DW_OP_bit_piece, 480, 32)
!319 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cameraPosition", arg: 2, scope: !130, file: !32, line: 58, type: !22)
!320 = !DILocation(line: 58, column: 54, scope: !130, inlinedAt: !303)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !130, file: !32, line: 58, type: !133)
!322 = !DILocation(line: 58, column: 37, scope: !130, inlinedAt: !303)
!323 = !DILocation(line: 60, column: 17, scope: !130, inlinedAt: !303)
!324 = !DILocation(line: 60, column: 23, scope: !130, inlinedAt: !303)
!325 = !DILocation(line: 60, column: 12, scope: !130, inlinedAt: !303)
!326 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !130, file: !32, line: 60, type: !172)
!327 = !DILocation(line: 61, column: 29, scope: !130, inlinedAt: !303)
!328 = !DILocation(line: 61, column: 27, scope: !130, inlinedAt: !303)
!329 = !DILocation(line: 61, column: 57, scope: !130, inlinedAt: !303)
!330 = !DILocation(line: 61, column: 63, scope: !130, inlinedAt: !303)
!331 = !DILocation(line: 61, column: 12, scope: !130, inlinedAt: !303)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !130, file: !32, line: 61, type: !172)
!333 = !DILocation(line: 64, column: 19, scope: !130, inlinedAt: !303)
!334 = !DILocation(line: 64, column: 17, scope: !130, inlinedAt: !303)
!335 = !DILocation(line: 67, column: 20, scope: !130, inlinedAt: !303)
!336 = !DILocation(line: 67, column: 12, scope: !130, inlinedAt: !303)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !130, file: !32, line: 67, type: !10)
!338 = !DILocation(line: 68, column: 15, scope: !130, inlinedAt: !303)
!339 = !DILocation(line: 71, column: 16, scope: !130, inlinedAt: !303)
!340 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 0, scope: !130, file: !32, line: 70, type: !105)
!341 = !DILocation(line: 70, column: 11, scope: !130, inlinedAt: !303)
!342 = !DILocation(line: 72, column: 41, scope: !130, inlinedAt: !303)
!343 = !DILocation(line: 72, column: 21, scope: !130, inlinedAt: !303)
!344 = !DILocation(line: 72, column: 19, scope: !130, inlinedAt: !303)
!345 = !DILocation(line: 74, column: 5, scope: !130, inlinedAt: !303)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ray", arg: 2, scope: !101, file: !1, line: 19, type: !105)
!347 = !DILocation(line: 19, column: 73, scope: !101, inlinedAt: !294)
!348 = !DILocation(line: 84, column: 10, scope: !111)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentRecursionDepth", scope: !111, file: !1, line: 84, type: !109)
!350 = !DIExpression()
!351 = !DILocation(line: 85, column: 20, scope: !111)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentRayRecursionDepth", arg: 3, scope: !101, file: !1, line: 19, type: !109)
!353 = !DILocation(line: 19, column: 86, scope: !101, inlinedAt: !294)
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scene", arg: 1, scope: !101, file: !1, line: 19, type: !104)
!355 = !DILocation(line: 19, column: 57, scope: !101, inlinedAt: !294)
!356 = !DILocation(line: 21, column: 9, scope: !101, inlinedAt: !294)
!357 = !DILocation(line: 28, column: 13, scope: !101, inlinedAt: !294)
!358 = !DILocation(line: 28, column: 20, scope: !101, inlinedAt: !294)
!359 = !DILocation(line: 29, column: 10, scope: !101, inlinedAt: !294)
!360 = !DILocation(line: 29, column: 20, scope: !101, inlinedAt: !294)
!361 = !DILocation(line: 32, column: 13, scope: !101, inlinedAt: !294)
!362 = !DILocation(line: 32, column: 18, scope: !101, inlinedAt: !294)
!363 = !DILocation(line: 33, column: 13, scope: !101, inlinedAt: !294)
!364 = !DILocation(line: 33, column: 18, scope: !101, inlinedAt: !294)
!365 = !DILocation(line: 34, column: 31, scope: !101, inlinedAt: !294)
!366 = !DILocation(line: 34, column: 78, scope: !101, inlinedAt: !294)
!367 = !DILocation(line: 46, column: 23, scope: !101, inlinedAt: !294)
!368 = !DILocation(line: 46, column: 5, scope: !101, inlinedAt: !294)
!369 = !DILocation(line: 47, column: 1, scope: !101, inlinedAt: !294)
!370 = !DILocation(line: 85, column: 12, scope: !111)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !111, file: !1, line: 85, type: !10)
!372 = !DILocation(line: 88, column: 19, scope: !111)
!373 = !DILocation(line: 88, column: 43, scope: !111)
!374 = !DILocation(line: 89, column: 1, scope: !111)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDesc", scope: !101, file: !1, line: 27, type: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 27, size: 256, align: 32, elements: !377)
!377 = !{!378, !379, !380, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !376, file: !1, line: 27, baseType: !23, size: 96, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !376, file: !1, line: 27, baseType: !14, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !376, file: !1, line: 27, baseType: !23, size: 96, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !376, file: !1, line: 27, baseType: !14, size: 32, align: 32, offset: 224)
!382 = !DILocation(line: 27, column: 13, scope: !101, inlinedAt: !294)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayPayload", scope: !101, file: !1, line: 34, type: !121)
!384 = !DILocation(line: 34, column: 18, scope: !101, inlinedAt: !294)
!385 = !DILocation(line: 109, column: 9, scope: !117)
!386 = !DILocation(line: 23, column: 36, scope: !31, inlinedAt: !387)
!387 = distinct !DILocation(line: 105, column: 28, scope: !117)
!388 = !DILocation(line: 36, column: 5, scope: !101, inlinedAt: !389)
!389 = distinct !DILocation(line: 135, column: 34, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !1, line: 132, column: 5)
!391 = distinct !DILexicalBlock(scope: !117, file: !1, line: 131, column: 9)
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !117, file: !1, line: 97, type: !126)
!393 = !DILocation(line: 97, column: 69, scope: !117)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !117, file: !1, line: 97, type: !121)
!395 = !DILocation(line: 97, column: 44, scope: !117)
!396 = !DILocation(line: 99, column: 10, scope: !117)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !117, file: !1, line: 99, type: !46)
!398 = !DILocation(line: 100, column: 57, scope: !117)
!399 = !DILocation(line: 100, column: 10, scope: !117)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iTriangleIndexStrideInBytes", scope: !117, file: !1, line: 100, type: !46)
!401 = !DILocation(line: 101, column: 67, scope: !117)
!402 = !DILocation(line: 101, column: 84, scope: !117)
!403 = !DILocation(line: 101, column: 105, scope: !117)
!404 = !DILocation(line: 101, column: 111, scope: !117)
!405 = !DILocation(line: 101, column: 109, scope: !117)
!406 = !DILocation(line: 102, column: 6, scope: !117)
!407 = !DILocation(line: 101, column: 10, scope: !117)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iBaseOffsetInBytes", scope: !117, file: !1, line: 101, type: !46)
!409 = !DILocation(line: 104, column: 68, scope: !117)
!410 = !DILocation(line: 104, column: 85, scope: !117)
!411 = !DILocation(line: 104, column: 10, scope: !117)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startIndex_in_VB_SRV", scope: !117, file: !1, line: 104, type: !46)
!413 = !DILocation(line: 105, column: 28, scope: !117)
!414 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 2, scope: !31, file: !32, line: 9, type: !46)
!415 = !DILocation(line: 9, column: 57, scope: !31, inlinedAt: !387)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Indices", arg: 1, scope: !31, file: !32, line: 9, type: !44)
!417 = !DILocation(line: 9, column: 44, scope: !31, inlinedAt: !387)
!418 = !DILocation(line: 20, column: 49, scope: !31, inlinedAt: !387)
!419 = !DILocation(line: 20, column: 16, scope: !31, inlinedAt: !387)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !31, file: !32, line: 20, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !31, file: !32, line: 23, type: !423)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 23, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 23, size: 64, align: 32, elements: !426, templateParams: !429)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !425, file: !1, line: 23, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !425, file: !1, line: 23, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!429 = !{!43, !61}
!430 = !DILocation(line: 23, column: 17, scope: !31, inlinedAt: !387)
!431 = !DILocation(line: 26, column: 28, scope: !432, inlinedAt: !387)
!432 = distinct !DILexicalBlock(scope: !31, file: !32, line: 26, column: 9)
!433 = !DILocation(line: 27, column: 13, scope: !101, inlinedAt: !389)
!434 = !DILocation(line: 34, column: 18, scope: !101, inlinedAt: !389)
!435 = !DILocation(line: 26, column: 9, scope: !31, inlinedAt: !387)
!436 = !DILocation(line: 28, column: 40, scope: !437, inlinedAt: !387)
!437 = distinct !DILexicalBlock(scope: !432, file: !32, line: 27, column: 5)
!438 = !DILocation(line: 28, column: 19, scope: !437, inlinedAt: !387)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !31, file: !32, line: 11, type: !35)
!440 = !DILocation(line: 11, column: 11, scope: !31, inlinedAt: !387)
!441 = !DILocation(line: 29, column: 41, scope: !437, inlinedAt: !387)
!442 = !DILocation(line: 29, column: 48, scope: !437, inlinedAt: !387)
!443 = !DILocation(line: 29, column: 19, scope: !437, inlinedAt: !387)
!444 = !DILocation(line: 30, column: 40, scope: !437, inlinedAt: !387)
!445 = !DILocation(line: 30, column: 19, scope: !437, inlinedAt: !387)
!446 = !DILocation(line: 31, column: 5, scope: !437, inlinedAt: !387)
!447 = !DILocation(line: 34, column: 41, scope: !448, inlinedAt: !387)
!448 = distinct !DILexicalBlock(scope: !432, file: !32, line: 33, column: 5)
!449 = !DILocation(line: 34, column: 48, scope: !448, inlinedAt: !387)
!450 = !DILocation(line: 34, column: 19, scope: !448, inlinedAt: !387)
!451 = !DILocation(line: 35, column: 40, scope: !448, inlinedAt: !387)
!452 = !DILocation(line: 35, column: 19, scope: !448, inlinedAt: !387)
!453 = !DILocation(line: 36, column: 41, scope: !448, inlinedAt: !387)
!454 = !DILocation(line: 36, column: 48, scope: !448, inlinedAt: !387)
!455 = !DILocation(line: 36, column: 19, scope: !448, inlinedAt: !387)
!456 = !DILocation(line: 39, column: 5, scope: !31, inlinedAt: !387)
!457 = !DILocation(line: 105, column: 17, scope: !117)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices3", scope: !117, file: !1, line: 105, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!460 = !DILocation(line: 108, column: 5, scope: !117)
!461 = !DILocation(line: 109, column: 39, scope: !117)
!462 = !DILocation(line: 109, column: 54, scope: !117)
!463 = !DILocation(line: 110, column: 39, scope: !117)
!464 = !DILocation(line: 110, column: 9, scope: !117)
!465 = !DILocation(line: 110, column: 54, scope: !117)
!466 = !DILocation(line: 111, column: 39, scope: !117)
!467 = !DILocation(line: 111, column: 9, scope: !117)
!468 = !DILocation(line: 111, column: 54, scope: !117)
!469 = !DILocation(line: 115, column: 5, scope: !117)
!470 = !DILocation(line: 116, column: 39, scope: !117)
!471 = !DILocation(line: 116, column: 9, scope: !117)
!472 = !DILocation(line: 116, column: 54, scope: !117)
!473 = !DILocation(line: 117, column: 33, scope: !117)
!474 = !DILocation(line: 117, column: 3, scope: !117)
!475 = !DILocation(line: 117, column: 48, scope: !117)
!476 = !DILocation(line: 118, column: 33, scope: !117)
!477 = !DILocation(line: 118, column: 3, scope: !117)
!478 = !DILocation(line: 118, column: 48, scope: !117)
!479 = !DILocation(line: 121, column: 12, scope: !117)
!480 = !DILocation(line: 123, column: 29, scope: !117)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !62, file: !32, line: 84, type: !53)
!482 = !DILocation(line: 84, column: 98, scope: !62, inlinedAt: !483)
!483 = distinct !DILocation(line: 123, column: 29, scope: !117)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vertexAttribute", arg: 1, scope: !62, file: !32, line: 84, type: !65)
!485 = !DILocation(line: 84, column: 40, scope: !62, inlinedAt: !483)
!486 = !{i32 0, i32 96, i32 3}
